[{"ayah_id":"48:1","surah":48,"ayah":1,"arabic":"إِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِينًا","english":"(O Esteemed Beloved!) Surely, We decreed for you a clear victory (and the dominance of Islam so that your great struggle might be completed with success),","vec_preview":[0.012500000186264515,0.031099999323487282,-0.02800000086426735,-0.01600000075995922,0.023499999195337296,-0.010499999858438969,0.0020000000949949026,-0.04179999977350235]},{"ayah_id":"48:2","surah":48,"ayah":2,"arabic":"لِّيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِن ذَنبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعْمَتَهُ عَلَيْكَ وَيَهْدِيَكَ صِرَاطًا مُّسْتَقِيمًا","english":"So that Allah forgives, for your sake, all the earlier and later sins (of all those people) of your Umma ([Community]* who struggled, fought and sacrificed by your command), and (this way) may complete His blessing on you (outwardly and inwardly) in the form of Islam’s victory and forgiveness for your Umma (Community), and may keep (your Umma) firm-footed on the straight path (through your mediation),","vec_preview":[0.01720000058412552,0.01860000006854534,-0.027300000190734863,0.0006000000284984708,0.01810000091791153,-0.021199999377131462,-0.008700000122189522,-0.03929999843239784]},{"ayah_id":"48:3","surah":48,"ayah":3,"arabic":"وَيَنصُرَكَ اللَّهُ نَصْرًا عَزِيزًا","english":"And so that Allah grants you most honourable help and support.","vec_preview":[0.010599999688565731,0.0215000007301569,-0.0215000007301569,-0.0010000000474974513,0.026900000870227814,-0.02239999920129776,-0.01769999973475933,-0.03999999910593033]},{"ayah_id":"48:4","surah":48,"ayah":4,"arabic":"هُوَ الَّذِي أَنزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ لِيَزْدَادُوا إِيمَانًا مَّعَ إِيمَانِهِمْ ۗ وَلِلَّهِ جُنُودُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا","english":"He is the One Who sent down calmness and tranquillity into the hearts of the believers so that their faith gets increased with more faith (and the faith learnt—‘the knowledge of certitude’ changes into the faith seen—‘the eye of certitude’). And all the armies of the heavens and the earth belong to Allah alone. And Allah is All-Knowing, Most Wise.","vec_preview":[-0.007699999958276749,0.021299999207258224,-0.028300000354647636,-0.003700000001117587,0.026799999177455902,-0.02930000051856041,-0.03290000185370445,-0.03889999911189079]},{"ayah_id":"48:5","surah":48,"ayah":5,"arabic":"لِّيُدْخِلَ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا وَيُكَفِّرَ عَنْهُمْ سَيِّئَاتِهِمْ ۚ وَكَانَ ذَٰلِكَ عِندَ اللَّهِ فَوْزًا عَظِيمًا","english":"(All these favours are put together) so that He admits the believing men and women to the Gardens with streams flowing under them. They will live in them forever. And (moreover) He removes from them their evil actions (as He has forgiven them their mistakes)—and this is a great success (of the believers) in the sight of Allah—","vec_preview":[0.021299999207258224,0.013399999588727951,-0.04800000041723251,-0.00039999998989515007,0.032999999821186066,-0.05180000141263008,-0.00839999970048666,-0.03759999945759773]},{"ayah_id":"48:6","surah":48,"ayah":6,"arabic":"وَيُعَذِّبَ الْمُنَافِقِينَ وَالْمُنَافِقَاتِ وَالْمُشْرِكِينَ وَالْمُشْرِكَاتِ الظَّانِّينَ بِاللَّهِ ظَنَّ السَّوْءِ ۚ عَلَيْهِمْ دَائِرَةُ السَّوْءِ ۖ وَغَضِبَ اللَّهُ عَلَيْهِمْ وَلَعَنَهُمْ وَأَعَدَّ لَهُمْ جَهَنَّمَ ۖ وَسَاءَتْ مَصِيرًا","english":"And (so that) He may punish the hypocritical men and women and the polytheistic men and women who entertain evil assumptions about Allah. For them is (predestined) an evil turn of fortune. And Allah has afflicted them with His wrath, has cursed them and has prepared for them Hell. And that is a very evil resting place.","vec_preview":[0.003000000026077032,0.010900000110268593,-0.04470000043511391,0.01590000092983246,0.028300000354647636,-0.05609999969601631,-0.016100000590085983,-0.042399998754262924]},{"ayah_id":"48:7","surah":48,"ayah":7,"arabic":"وَلِلَّهِ جُنُودُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا","english":"And all armies of the heavens and the earth belong to Allah alone. And Allah is Almighty, Most Wise.","vec_preview":[-9.999999747378752e-05,0.014999999664723873,-0.032099999487400055,0.008999999612569809,0.009200000204145908,-0.029200000688433647,-0.01489999983459711,-0.0284000001847744]},{"ayah_id":"48:8","surah":48,"ayah":8,"arabic":"إِنَّا أَرْسَلْنَاكَ شَاهِدًا وَمُبَشِّرًا وَنَذِيرًا","english":"Indeed, We have sent you as an eyewitness (of the actions and the state of affairs of Umma [Community] to bear testimony on the Day of Reckoning) and as a Bearer of good news and as a Warner,","vec_preview":[0.006500000134110451,0.025200000032782555,-0.02759999968111515,0.016599999740719795,0.023600000888109207,-0.03460000082850456,-0.0071000000461936,-0.039000000804662704]},{"ayah_id":"48:9","surah":48,"ayah":9,"arabic":"لِّتُؤْمِنُوا بِاللَّهِ وَرَسُولِهِ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُ وَتُسَبِّحُوهُ بُكْرَةً وَأَصِيلًا","english":"So that, (O people,) you may believe in Allah and His Messenger (blessings and peace be upon him) and may help his (Din [Religion]), and revere and venerate him heart and soul, and (with that) glorify Allah morning and evening.","vec_preview":[0.0020000000949949026,0.01489999983459711,-0.031199999153614044,0.020800000056624413,0.025699999183416367,-0.031099999323487282,-0.019200000911951065,-0.04230000078678131]},{"ayah_id":"48:10","surah":48,"ayah":10,"arabic":"إِنَّ الَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ اللَّهَ يَدُ اللَّهِ فَوْقَ أَيْدِيهِمْ ۚ فَمَن نَّكَثَ فَإِنَّمَا يَنكُثُ عَلَىٰ نَفْسِهِ ۖ وَمَنْ أَوْفَىٰ بِمَا عَاهَدَ عَلَيْهُ اللَّهَ فَسَيُؤْتِيهِ أَجْرًا عَظِيمًا","english":"(O Beloved!) Indeed, those who pledge allegiance to you in fact pledge allegiance to Allah alone. Allah’s hand is over their hands (in the form of your hand). Then whoever breaks his pledge breaks it only to his own harm. But he who fulfils what he has promised to Allah, He will bless him with immense reward.","vec_preview":[0.0007999999797903001,0.025200000032782555,-0.02800000086426735,-0.00019999999494757503,0.03669999912381172,-0.041099999099969864,-0.03359999880194664,-0.05130000039935112]},{"ayah_id":"48:11","surah":48,"ayah":11,"arabic":"سَيَقُولُ لَكَ الْمُخَلَّفُونَ مِنَ الْأَعْرَابِ شَغَلَتْنَا أَمْوَالُنَا وَأَهْلُونَا فَاسْتَغْفِرْ لَنَا ۚ يَقُولُونَ بِأَلْسِنَتِهِم مَّا لَيْسَ فِي قُلُوبِهِمْ ۚ قُلْ فَمَن يَمْلِكُ لَكُم مِّنَ اللَّهِ شَيْئًا إِنْ أَرَادَ بِكُمْ ضَرًّا أَوْ أَرَادَ بِكُمْ نَفْعًا ۚ بَلْ كَانَ اللَّهُ بِمَا تَعْمَلُونَ خَبِيرًا","english":"Soon the Bedouins who lagged behind (from participating in al-Hudaybiya) will say to you (apologetically): ‘Our money matters and families kept us busy. (Therefore, we missed your company.) So ask forgiveness for us from Allah.’ They utter such (words) with their tongues that are not in their hearts. Say: ‘Who has the power to save you against (the decision) of Allah if He intends to do you harm, or if He intends to do you good? But Allah is Well Aware of what you do.","vec_preview":[0.009800000116229057,0.008799999952316284,-0.030700000002980232,-0.014000000432133675,0.037300001829862595,-0.023800000548362732,-0.010099999606609344,-0.041099999099969864]},{"ayah_id":"48:12","surah":48,"ayah":12,"arabic":"بَلْ ظَنَنتُمْ أَن لَّن يَنقَلِبَ الرَّسُولُ وَالْمُؤْمِنُونَ إِلَىٰ أَهْلِيهِمْ أَبَدًا وَزُيِّنَ ذَٰلِكَ فِي قُلُوبِكُمْ وَظَنَنتُمْ ظَنَّ السَّوْءِ وَكُنتُمْ قَوْمًا بُورًا","english":"No, in fact, you thought that the Messenger (blessings and peace be upon him) and the believers (his Companions) would never return to their families now, and (your ill-commanding selves) made that (thought) seem to your hearts far fascinating. And you imagined a highly evil speculation and became a people bound to perish.’","vec_preview":[0.01759999990463257,-0.005900000222027302,-0.045899998396635056,-0.0007999999797903001,0.023099999874830246,-0.048900000751018524,-0.02329999953508377,-0.052799999713897705]},{"ayah_id":"48:13","surah":48,"ayah":13,"arabic":"وَمَن لَّمْ يُؤْمِن بِاللَّهِ وَرَسُولِهِ فَإِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَعِيرًا","english":"And whoever does not believe in Allah and His Messenger (blessings and peace be upon him), then We have prepared Hell for the disbelievers.","vec_preview":[-0.002899999963119626,-0.003700000001117587,-0.023499999195337296,0.0010000000474974513,0.023600000888109207,-0.03889999911189079,-0.02500000037252903,-0.025499999523162842]},{"ayah_id":"48:14","surah":48,"ayah":14,"arabic":"وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ يَغْفِرُ لِمَن يَشَاءُ وَيُعَذِّبُ مَن يَشَاءُ ۚ وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا","english":"And the Kingdom of the heavens and the earth belongs to Allah alone. He forgives whom He wills and punishes whom He wills. And Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.01889999955892563,0.015399999916553497,-0.0284000001847744,0.015699999406933784,-0.010999999940395355,-0.03400000184774399,-0.004999999888241291,-0.030899999663233757]},{"ayah_id":"48:15","surah":48,"ayah":15,"arabic":"سَيَقُولُ الْمُخَلَّفُونَ إِذَا انطَلَقْتُمْ إِلَىٰ مَغَانِمَ لِتَأْخُذُوهَا ذَرُونَا نَتَّبِعْكُمْ ۖ يُرِيدُونَ أَن يُبَدِّلُوا كَلَامَ اللَّهِ ۚ قُل لَّن تَتَّبِعُونَا كَذَٰلِكُمْ قَالَ اللَّهُ مِن قَبْلُ ۖ فَسَيَقُولُونَ بَلْ تَحْسُدُونَنَا ۚ بَلْ كَانُوا لَا يَفْقَهُونَ إِلَّا قَلِيلًا","english":"When you will set out to collect the spoils (of Khaybar), those who remained behind (in the march towards al-Hudaybiya) will say: ‘Allow us also to follow you.’ They seek to alter Allah’s Words. Say: ‘You shall by no means follow us. Allah said the same beforehand.’ So now they will say: ‘In fact, you are jealous of us.’ The truth is that they understand (the truth) but little.","vec_preview":[0.0012000000569969416,0.01810000091791153,-0.033399999141693115,-0.010999999940395355,0.03229999914765358,-0.04839999973773956,-0.016200000420212746,-0.05649999901652336]},{"ayah_id":"48:16","surah":48,"ayah":16,"arabic":"قُل لِّلْمُخَلَّفِينَ مِنَ الْأَعْرَابِ سَتُدْعَوْنَ إِلَىٰ قَوْمٍ أُولِي بَأْسٍ شَدِيدٍ تُقَاتِلُونَهُمْ أَوْ يُسْلِمُونَ ۖ فَإِن تُطِيعُوا يُؤْتِكُمُ اللَّهُ أَجْرًا حَسَنًا ۖ وَإِن تَتَوَلَّوْا كَمَا تَوَلَّيْتُم مِّن قَبْلُ يُعَذِّبْكُمْ عَذَابًا أَلِيمًا","english":"Say to the Bedouins lagging behind: ‘You will be called up soon (to fight) against a hard-hitting, warring people. Then you will fight them on (for the promotion of peace and human dignity), or they will become Muslims. So if you obey the command, Allah will give you an excellent reward. But if you turn away as you did before, He will make you suffer from an agonizing torment.’","vec_preview":[0.01590000092983246,0.020099999383091927,-0.040300000458955765,-0.011800000444054604,0.053300000727176666,-0.05770000070333481,-0.014600000344216824,-0.039000000804662704]},{"ayah_id":"48:17","surah":48,"ayah":17,"arabic":"لَّيْسَ عَلَى الْأَعْمَىٰ حَرَجٌ وَلَا عَلَى الْأَعْرَجِ حَرَجٌ وَلَا عَلَى الْمَرِيضِ حَرَجٌ ۗ وَمَن يُطِعِ اللَّهَ وَرَسُولَهُ يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۖ وَمَن يَتَوَلَّ يُعَذِّبْهُ عَذَابًا أَلِيمًا","english":"There is no blame on the blind or the lame or the sick (for their disability to fight). And He who obeys Allah and His Messenger (blessings and peace be upon him), He will admit him to the Gardens with streams flowing under them. But whoever turns away (from obedience), He will punish him with a grievous torment.","vec_preview":[0.01209999993443489,0.014100000262260437,-0.04010000079870224,0.009800000116229057,0.04399999976158142,-0.05050000175833702,-0.0008999999845400453,-0.031199999153614044]},{"ayah_id":"48:18","surah":48,"ayah":18,"arabic":"۞ لَّقَدْ رَضِيَ اللَّهُ عَنِ الْمُؤْمِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ الشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمْ فَأَنزَلَ السَّكِينَةَ عَلَيْهِمْ وَأَثَابَهُمْ فَتْحًا قَرِيبًا","english":"Surely, Allah was well pleased with the believers when they pledged allegiance to you under the tree (at al-Hudaybiya). So the (passion of truth and fidelity) that permeated their hearts, Allah had its knowledge and sent down an exceptional calmness and tranquillity (into their hearts, and awarded them the forthcoming victory (of Khaybar),","vec_preview":[9.999999747378752e-05,0.034299999475479126,-0.03550000116229057,9.999999747378752e-05,0.030300000682473183,-0.030700000002980232,-0.005900000222027302,-0.048900000751018524]},{"ayah_id":"48:19","surah":48,"ayah":19,"arabic":"وَمَغَانِمَ كَثِيرَةً يَأْخُذُونَهَا ۗ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا","english":"And (also) the abundant spoils that they are taking and Allah is Almighty, Most Wise.","vec_preview":[0.016699999570846558,0.024000000208616257,-0.019700000062584877,-0.004699999932199717,0.01730000041425228,-0.035599999129772186,-0.016300000250339508,-0.031199999153614044]},{"ayah_id":"48:20","surah":48,"ayah":20,"arabic":"وَعَدَكُمُ اللَّهُ مَغَانِمَ كَثِيرَةً تَأْخُذُونَهَا فَعَجَّلَ لَكُمْ هَـٰذِهِ وَكَفَّ أَيْدِيَ النَّاسِ عَنكُمْ وَلِتَكُونَ آيَةً لِّلْمُؤْمِنِينَ وَيَهْدِيَكُمْ صِرَاطًا مُّسْتَقِيمًا","english":"And Allah has promised you abundant spoils (resulting from many victories) which you will win, but He has hastened to you this (booty of Khaybar) and has held back from you the hands of the people (of Mecca, Khaybar, Banu Asad and Ghatafan tribes and all other enemies), so that it may become a sign for the believers (of the forthcoming triumph and victory), and that He may keep you treading the straight road (firm-footed and with tranquil hearts).","vec_preview":[0.01730000041425228,0.03319999948143959,-0.02459999918937683,-0.016499999910593033,0.05000000074505806,-0.02459999918937683,-0.0142000000923872,-0.0478999987244606]},{"ayah_id":"48:21","surah":48,"ayah":21,"arabic":"وَأُخْرَىٰ لَمْ تَقْدِرُوا عَلَيْهَا قَدْ أَحَاطَ اللَّهُ بِهَا ۚ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرًا","english":"And other (big victories of Mecca, Hawazin and Hunayn, then Persia and Rome) over which you had no power—surely Allah has also encompassed them (for you), and Allah wields Absolute Power over everything.","vec_preview":[0.004399999976158142,0.009399999864399433,-0.028999999165534973,-0.004999999888241291,0.007300000172108412,-0.05090000107884407,-0.022299999371170998,-0.027300000190734863]},{"ayah_id":"48:22","surah":48,"ayah":22,"arabic":"وَلَوْ قَاتَلَكُمُ الَّذِينَ كَفَرُوا لَوَلَّوُا الْأَدْبَارَ ثُمَّ لَا يَجِدُونَ وَلِيًّا وَلَا نَصِيرًا","english":"And, (O believers,) if the disbelievers had (initiated war and) fought with you (at al-Hudaybiya), they would certainly have fled turning their backs and found no friend and helper. (But Allah intended to open the door of victories to you through dialogue and negotiations for peace.)","vec_preview":[0.011800000444054604,0.020899999886751175,-0.02539999969303608,0.00839999970048666,0.023499999195337296,-0.04580000042915344,-0.023600000888109207,-0.03779999911785126]},{"ayah_id":"48:23","surah":48,"ayah":23,"arabic":"سُنَّةَ اللَّهِ الَّتِي قَدْ خَلَتْ مِن قَبْلُ ۖ وَلَن تَجِدَ لِسُنَّةِ اللَّهِ تَبْدِيلًا","english":"(This) is Allah’s pattern that has been established through time, and you will never find any change in the Laws of Allah.","vec_preview":[-0.02410000003874302,-0.003800000064074993,-0.021700000390410423,0.0008999999845400453,-0.0066999997943639755,-0.05040000006556511,-0.02239999920129776,-0.04349999874830246]},{"ayah_id":"48:24","surah":48,"ayah":24,"arabic":"وَهُوَ الَّذِي كَفَّ أَيْدِيَهُمْ عَنكُمْ وَأَيْدِيَكُمْ عَنْهُم بِبَطْنِ مَكَّةَ مِن بَعْدِ أَنْ أَظْفَرَكُمْ عَلَيْهِمْ ۚ وَكَانَ اللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا","english":"And He is the One Who held back the hands of those (disbelievers) from you and your hands from them on the frontier of Mecca (near al-Hudaybiya) after giving you the upper hand over their (party). And Allah best monitors what you do.","vec_preview":[0.01080000028014183,0.01510000042617321,-0.01899999938905239,-0.018300000578165054,0.03610000014305115,-0.03929999843239784,-0.01600000075995922,-0.04830000177025795]},{"ayah_id":"48:25","surah":48,"ayah":25,"arabic":"هُمُ الَّذِينَ كَفَرُوا وَصَدُّوكُمْ عَنِ الْمَسْجِدِ الْحَرَامِ وَالْهَدْيَ مَعْكُوفًا أَن يَبْلُغَ مَحِلَّهُ ۚ وَلَوْلَا رِجَالٌ مُّؤْمِنُونَ وَنِسَاءٌ مُّؤْمِنَاتٌ لَّمْ تَعْلَمُوهُمْ أَن تَطَئُوهُمْ فَتُصِيبَكُم مِّنْهُم مَّعَرَّةٌ بِغَيْرِ عِلْمٍ ۖ لِّيُدْخِلَ اللَّهُ فِي رَحْمَتِهِ مَن يَشَاءُ ۚ لَوْ تَزَيَّلُوا لَعَذَّبْنَا الَّذِينَ كَفَرُوا مِنْهُمْ عَذَابًا أَلِيمًا","english":"It is they who disbelieved and hindered you from the Sacred Mosque, and prevented the sacrificial animals as well that were kept from reaching their place. And had there not been many such believing men and women (present in Mecca) as you also did not know that you might crush them underfoot without knowing, and some harm and hardship might also be caused to you by them inadvertently, (We would have allowed you there and then to fight. But the victory of Mecca was delayed) so that Allah might admit to His mercy whom He willed. Had (the disbelievers and the believers there) distinguishably drawn apart from one another, We would have punished the disbelievers with a painful torment.","vec_preview":[0.00570000009611249,0.020099999383091927,-0.03519999980926514,-0.008700000122189522,0.042500000447034836,-0.0414000004529953,-0.012299999594688416,-0.037300001829862595]},{"ayah_id":"48:26","surah":48,"ayah":26,"arabic":"إِذْ جَعَلَ الَّذِينَ كَفَرُوا فِي قُلُوبِهِمُ الْحَمِيَّةَ حَمِيَّةَ الْجَاهِلِيَّةِ فَأَنزَلَ اللَّهُ سَكِينَتَهُ عَلَىٰ رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَلْزَمَهُمْ كَلِمَةَ التَّقْوَىٰ وَكَانُوا أَحَقَّ بِهَا وَأَهْلَهَا ۚ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا","english":"Whilst the disbelievers anchored in their hearts the conceited obstinacy (which was) stubbornness and egocentricity of the days of ignorance, Allah sent down on His Messenger (blessings and peace be upon him) and the believers an exceptional calmness and tranquillity and made them firm on the word of Godwariness. And it is this that they were most entitled to and (also) worthy of. And Allah knows everything full well.","vec_preview":[0.007000000216066837,0.027300000190734863,-0.04089999943971634,0.009200000204145908,0.008700000122189522,-0.03660000115633011,-0.03359999880194664,-0.03759999945759773]},{"ayah_id":"48:27","surah":48,"ayah":27,"arabic":"لَّقَدْ صَدَقَ اللَّهُ رَسُولَهُ الرُّؤْيَا بِالْحَقِّ ۖ لَتَدْخُلُنَّ الْمَسْجِدَ الْحَرَامَ إِن شَاءَ اللَّهُ آمِنِينَ مُحَلِّقِينَ رُءُوسَكُمْ وَمُقَصِّرِينَ لَا تَخَافُونَ ۖ فَعَلِمَ مَا لَمْ تَعْلَمُوا فَجَعَلَ مِن دُونِ ذَٰلِكَ فَتْحًا قَرِيبًا","english":"Surely, Allah showed His Messenger (blessings and peace be upon him) the dream exactly true to the reality that, if Allah wills, you will most certainly enter the Sacred Mosque safely, (some) with heads shaved and (some) with hair cut short, (in a state of security,) having no fear. So He knew (the al-Hudaybiya treaty as a preamble to the truth of the dream) which you did not know, and gave you an immediate victory (the victory of Khaybar even before the victory of Mecca, soon after returning from al-Hudaybiya. The next year He bestowed the victory of Mecca and entry to the Sacred Mosque.)","vec_preview":[0.01209999993443489,0.02370000071823597,-0.03799999877810478,0.0010000000474974513,0.030400000512599945,-0.038600001484155655,-0.00279999990016222,-0.05380000174045563]},{"ayah_id":"48:28","surah":48,"ayah":28,"arabic":"هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ ۚ وَكَفَىٰ بِاللَّهِ شَهِيدًا","english":"He is the One Who sent His Messenger (blessings and peace be upon him) with guidance and the Din (Religion) of truth to make it prevail over all other religions. And Allah is Sufficient as a witness (to the truthfulness and veracity of the Messenger [blessings and peace be upon him]).","vec_preview":[0.023399999365210533,0.011900000274181366,-0.02979999966919422,-0.00570000009611249,0.010200000368058681,-0.01640000008046627,-0.0215000007301569,-0.03579999879002571]},{"ayah_id":"48:29","surah":48,"ayah":29,"arabic":"مُّحَمَّدٌ رَّسُولُ اللَّهِ ۚ وَالَّذِينَ مَعَهُ أَشِدَّاءُ عَلَى الْكُفَّارِ رُحَمَاءُ بَيْنَهُمْ ۖ تَرَاهُمْ رُكَّعًا سُجَّدًا يَبْتَغُونَ فَضْلًا مِّنَ اللَّهِ وَرِضْوَانًا ۖ سِيمَاهُمْ فِي وُجُوهِهِم مِّنْ أَثَرِ السُّجُودِ ۚ ذَٰلِكَ مَثَلُهُمْ فِي التَّوْرَاةِ ۚ وَمَثَلُهُمْ فِي الْإِنجِيلِ كَزَرْعٍ أَخْرَجَ شَطْأَهُ فَآزَرَهُ فَاسْتَغْلَظَ فَاسْتَوَىٰ عَلَىٰ سُوقِهِ يُعْجِبُ الزُّرَّاعَ لِيَغِيظَ بِهِمُ الْكُفَّارَ ۗ وَعَدَ اللَّهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ مِنْهُم مَّغْفِرَةً وَأَجْرًا عَظِيمًا","english":"Muhammad (blessings and peace be upon him) is the Messenger of Allah. And those with him are hard and tough against the disbelievers but kind-hearted and merciful amongst themselves. You see them excessively bowing and prostrating themselves. They simply seek Allah’s grace and pleasure. Their mark is an impression of prostrations on their faces (prominent on the foreheads as light). These traits of theirs are (mentioned) in the Torah and the (same) qualities are also (described) in the Injil (the Gospel). These (Companions) are like a cultivated crop (of Our Esteemed Beloved) which (first of all) brought forth its thin shoot, then made it powerful and strong, and then it thickened and stood straight on its stalk. (And when it flourished, bloomed and danced,) it delighted and charmed the cultivators. (Allah has, likewise, made the Companions of His Beloved strong, grown up trees of faith,) so that by means of them He would inflame the hearts of the disbelievers (that burn in the jealousy of the Holy Prophet Muhammad [blessings and peace be upon him]). Those who believe and do pious works, Allah has promised them forgiveness and an immense reward.","vec_preview":[0.011599999852478504,0.01140000019222498,-0.023499999195337296,0.004800000227987766,0.03849999979138374,-0.04800000041723251,-0.01489999983459711,-0.019200000911951065]}]