[{"ayah_id":"28:1","surah":28,"ayah":1,"arabic":"طسم","english":"Ta, Sin, Mim. (Only Allah and the Messenger [blessings and peace be upon him] know the real meaning.)","vec_preview":[0.014399999752640724,0.03319999948143959,-0.03240000084042549,0.041999999433755875,0.002099999925121665,-0.027699999511241913,-0.004399999976158142,-0.02800000086426735]},{"ayah_id":"28:2","surah":28,"ayah":2,"arabic":"تِلْكَ آيَاتُ الْكِتَابِ الْمُبِينِ","english":"These are the Verses of the enlightening Book.","vec_preview":[0.003800000064074993,-0.00279999990016222,-0.012799999676644802,0.003599999938160181,0.019700000062584877,0.00430000014603138,-0.010300000198185444,-0.0551999993622303]},{"ayah_id":"28:3","surah":28,"ayah":3,"arabic":"نَتْلُو عَلَيْكَ مِن نَّبَإِ مُوسَىٰ وَفِرْعَوْنَ بِالْحَقِّ لِقَوْمٍ يُؤْمِنُونَ","english":"(O Esteemed Beloved!) We recite to you from the true account of Musa (Moses) and Pharaoh for those who have believed.","vec_preview":[-0.002099999925121665,0.017899999395012856,-0.02370000071823597,-0.01140000019222498,0.03700000047683716,-0.022299999371170998,-0.030400000512599945,-0.020899999886751175]},{"ayah_id":"28:4","surah":28,"ayah":4,"arabic":"إِنَّ فِرْعَوْنَ عَلَا فِي الْأَرْضِ وَجَعَلَ أَهْلَهَا شِيَعًا يَسْتَضْعِفُ طَائِفَةً مِّنْهُمْ يُذَبِّحُ أَبْنَاءَهُمْ وَيَسْتَحْيِي نِسَاءَهُمْ ۚ إِنَّهُ كَانَ مِنَ الْمُفْسِدِينَ","english":"Certainly, Pharaoh had become an arrogant rebel (i.e., a tyrannical despot) in the land, and he had divided the citizens of his (state) into (various) sects (and groups). He had oppressed and weakened one of these groups (the population comprising the Children of Israel). He used to kill their sons (to crush their future strength), and let their women live (to increase their number without men and spread immorality and indecency amongst them). Surely, he was one of those who rouse disruption.","vec_preview":[0.008299999870359898,0.01810000091791153,-0.03009999915957451,0.02810000069439411,0.028699999675154686,-0.05550000071525574,-0.00989999994635582,-0.03310000151395798]},{"ayah_id":"28:5","surah":28,"ayah":5,"arabic":"وَنُرِيدُ أَن نَّمُنَّ عَلَى الَّذِينَ اسْتُضْعِفُوا فِي الْأَرْضِ وَنَجْعَلَهُمْ أَئِمَّةً وَنَجْعَلَهُمُ الْوَارِثِينَ","english":"And We wanted to do favour to the people who had been weakened in the land (through oppression, exploitation and deprivation of rights and freedom) and make them leaders (of the oppressed people) and inheritors (of the throne of the kingdom);","vec_preview":[-0.0019000000320374966,0.0027000000700354576,-0.03280000016093254,0.0044999998062849045,0.030300000682473183,-0.028999999165534973,-0.020999999716877937,-0.033799998462200165]},{"ayah_id":"28:6","surah":28,"ayah":6,"arabic":"وَنُمَكِّنَ لَهُمْ فِي الْأَرْضِ وَنُرِيَ فِرْعَوْنَ وَهَامَانَ وَجُنُودَهُمَا مِنْهُم مَّا كَانُوا يَحْذَرُونَ","english":"And to give them governance and power in the land and show Pharaoh and Haman and their armies (the revolution) that they used to fear.","vec_preview":[-0.007000000216066837,0.024399999529123306,-0.04100000113248825,0.01489999983459711,0.041099999099969864,-0.042500000447034836,-0.01360000018030405,-0.039400000125169754]},{"ayah_id":"28:7","surah":28,"ayah":7,"arabic":"وَأَوْحَيْنَا إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ ۖ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي ۖ إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ","english":"And We revealed to the heart of the mother of Musa (Moses): ‘Suckle him on, but when you fear (for his life), put him afloat into the river, and be not afraid (of this situation) nor grieve. Surely, We shall bring him back to you, and shall make him one of Our Messengers.’","vec_preview":[0.003599999938160181,0.019300000742077827,-0.027499999850988388,0.0027000000700354576,0.01730000041425228,-0.052299998700618744,-0.02710000053048134,-0.03579999879002571]},{"ayah_id":"28:8","surah":28,"ayah":8,"arabic":"فَالْتَقَطَهُ آلُ فِرْعَوْنَ لِيَكُونَ لَهُمْ عَدُوًّا وَحَزَنًا ۗ إِنَّ فِرْعَوْنَ وَهَامَانَ وَجُنُودَهُمَا كَانُوا خَاطِئِينَ","english":"Then Pharaoh’s family picked him up (from the river) so that (by the will of Allah) he proved for them an enemy and (a cause of) grief. Surely, Pharaoh, Haman and their armies were the evildoers.","vec_preview":[-0.0015999999595806003,0.02290000021457672,-0.04349999874830246,0.02850000001490116,0.045499999076128006,-0.05620000138878822,-0.011599999852478504,-0.04309999942779541]},{"ayah_id":"28:9","surah":28,"ayah":9,"arabic":"وَقَالَتِ امْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِّي وَلَكَ ۖ لَا تَقْتُلُوهُ عَسَىٰ أَن يَنفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا وَهُمْ لَا يَشْعُرُونَ","english":"And the wife of Pharaoh said (on seeing Musa [Moses]): ‘(This child) is coolness of eyes for me and for you; do not kill him. He may perhaps bring us benefit or we may adopt him as a son.’ And they were unaware (of the outcome of this plan).","vec_preview":[-0.0044999998062849045,-0.003800000064074993,-0.014499999582767487,0.01209999993443489,0.04839999973773956,-0.06210000067949295,-0.023499999195337296,-0.051600001752376556]},{"ayah_id":"28:10","surah":28,"ayah":10,"arabic":"وَأَصْبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَارِغًا ۖ إِن كَادَتْ لَتُبْدِي بِهِ لَوْلَا أَن رَّبَطْنَا عَلَىٰ قَلْبِهَا لِتَكُونَ مِنَ الْمُؤْمِنِينَ","english":"And the heart of Musa’s (Moses’s) mother felt empty (of patience). And she would nearly have disclosed the secret (owing to her impatience), had We not energized her heart with the strength of peace and patience so that she might remain one of the firm believers (in Allah’s promise).","vec_preview":[-0.00800000037997961,-0.002300000051036477,-0.010700000450015068,0.004000000189989805,-0.000699999975040555,-0.049800001084804535,-0.03240000084042549,-0.023600000888109207]},{"ayah_id":"28:11","surah":28,"ayah":11,"arabic":"وَقَالَتْ لِأُخْتِهِ قُصِّيهِ ۖ فَبَصُرَتْ بِهِ عَن جُنُبٍ وَهُمْ لَا يَشْعُرُونَ","english":"And (Musa’s [Moses’s] mother) said to his sister: ‘Follow him (to be aware of him).’ So she watched him from a distance, but they were (completely) unaware.","vec_preview":[-0.01640000008046627,0.012400000356137753,-0.016599999740719795,0.002199999988079071,-0.00019999999494757503,-0.029400000348687172,-0.017899999395012856,-0.054999999701976776]},{"ayah_id":"28:12","surah":28,"ayah":12,"arabic":"۞ وَحَرَّمْنَا عَلَيْهِ الْمَرَاضِعَ مِن قَبْلُ فَقَالَتْ هَلْ أَدُلُّكُمْ عَلَىٰ أَهْلِ بَيْتٍ يَكْفُلُونَهُ لَكُمْ وَهُمْ لَهُ نَاصِحُونَ","english":"And We had in advance prohibited him from the feed of wet nurses. So (Musa’s [Moses’s] sister) said: ‘Shall I tell you about a family who will bring up this (child) for you and will (also) be his well-wisher?’","vec_preview":[0.010300000198185444,0.005100000184029341,-0.024800000712275505,0.002199999988079071,0.021800000220537186,-0.032499998807907104,-0.02850000001490116,-0.05119999870657921]},{"ayah_id":"28:13","surah":28,"ayah":13,"arabic":"فَرَدَدْنَاهُ إِلَىٰ أُمِّهِ كَيْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ وَلِتَعْلَمَ أَنَّ وَعْدَ اللَّهِ حَقٌّ وَلَـٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ","english":"So (this way) We returned Musa (Moses) to his mother so that her eyes might keep cool and so that she might not feel grieved and in order that she might know (with certitude) that Allah’s promise is true but most of the people do not know.","vec_preview":[-0.006300000008195639,0.017799999564886093,-0.024800000712275505,-0.02539999969303608,0.020800000056624413,-0.029999999329447746,-0.01140000019222498,-0.048700001090765]},{"ayah_id":"28:14","surah":28,"ayah":14,"arabic":"وَلَمَّا بَلَغَ أَشُدَّهُ وَاسْتَوَىٰ آتَيْنَاهُ حُكْمًا وَعِلْمًا ۚ وَكَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ","english":"And when Musa (Moses) reached his maturity and (the age of) moderation and stability, We honoured him with the command (of Prophethood) and knowledge and wisdom. And that is how We reward the righteous.","vec_preview":[-0.0003000000142492354,0.005400000140070915,-0.03959999978542328,0.0066999997943639755,0.02250000089406967,-0.033900000154972076,-0.013899999670684338,-0.02710000053048134]},{"ayah_id":"28:15","surah":28,"ayah":15,"arabic":"وَدَخَلَ الْمَدِينَةَ عَلَىٰ حِينِ غَفْلَةٍ مِّنْ أَهْلِهَا فَوَجَدَ فِيهَا رَجُلَيْنِ يَقْتَتِلَانِ هَـٰذَا مِن شِيعَتِهِ وَهَـٰذَا مِنْ عَدُوِّهِ ۖ فَاسْتَغَاثَهُ الَّذِي مِن شِيعَتِهِ عَلَى الَّذِي مِنْ عَدُوِّهِ فَوَكَزَهُ مُوسَىٰ فَقَضَىٰ عَلَيْهِ ۖ قَالَ هَـٰذَا مِنْ عَمَلِ الشَّيْطَانِ ۖ إِنَّهُ عَدُوٌّ مُّضِلٌّ مُّبِينٌ","english":"And Musa (Moses) entered the city (in Egypt) at a time when its people were lying (asleep) unaware. There he found two men fighting with each other, one from his (own) party (the Children of Israel), and the other from his enemies (the people of Pharaoh). The man from his own party asked him for help against the other who was from his enemies. So Musa (Moses) struck him with his fist and killed him. (Then) he said: ‘This is Satan’s work (which I have committed); no doubt he is an open, misleading enemy.’","vec_preview":[0.020999999716877937,0.016100000590085983,-0.027300000190734863,0.007499999832361937,0.02319999970495701,-0.037300001829862595,-0.03689999878406525,-0.04690000042319298]},{"ayah_id":"28:16","surah":28,"ayah":16,"arabic":"قَالَ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ","english":"(Musa [Moses]) submitted: ‘O my Lord, no doubt I have wronged my soul; so bless me with forgiveness.’ Then He forgave him. Surely, He is the Most Forgiving, Ever-Merciful.","vec_preview":[0.022099999710917473,0.005200000014156103,-0.029500000178813934,-0.004900000058114529,0.007799999788403511,-0.04569999873638153,-0.02979999966919422,-0.03840000182390213]},{"ayah_id":"28:17","surah":28,"ayah":17,"arabic":"قَالَ رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيرًا لِّلْمُجْرِمِينَ","english":"(Moreover) he submitted: ‘O my Lord, because of Your favour (of forgiveness) You have blessed me with, I shall never be a helper of the wrongdoers.’","vec_preview":[0.010200000368058681,0.001500000013038516,-0.027499999850988388,-0.0215000007301569,0.03480000048875809,-0.04529999941587448,-0.032499998807907104,-0.042100001126527786]},{"ayah_id":"28:18","surah":28,"ayah":18,"arabic":"فَأَصْبَحَ فِي الْمَدِينَةِ خَائِفًا يَتَرَقَّبُ فَإِذَا الَّذِي اسْتَنصَرَهُ بِالْأَمْسِ يَسْتَصْرِخُهُ ۚ قَالَ لَهُ مُوسَىٰ إِنَّكَ لَغَوِيٌّ مُّبِينٌ","english":"So Musa (Moses), anxious and afraid, kept waiting till morning (to discover what would happen next). Then, suddenly, the man who sought his help the day before was crying out to him for help (again). Musa (Moses) said to him: ‘Surely, you are the one who has truly lost the right path.’","vec_preview":[0.001500000013038516,0.03099999949336052,-0.010200000368058681,0.0017000000225380063,0.03660000115633011,-0.022199999541044235,-0.026599999517202377,-0.053199999034404755]},{"ayah_id":"28:19","surah":28,"ayah":19,"arabic":"فَلَمَّا أَنْ أَرَادَ أَن يَبْطِشَ بِالَّذِي هُوَ عَدُوٌّ لَّهُمَا قَالَ يَا مُوسَىٰ أَتُرِيدُ أَن تَقْتُلَنِي كَمَا قَتَلْتَ نَفْسًا بِالْأَمْسِ ۖ إِن تُرِيدُ إِلَّا أَن تَكُونَ جَبَّارًا فِي الْأَرْضِ وَمَا تُرِيدُ أَن تَكُونَ مِنَ الْمُصْلِحِينَ","english":"Then, when Musa (Moses) decided to catch hold of the person who was an enemy to both of them, he exclaimed: ‘O Musa (Moses), do you want to kill me (too) as you killed a man the day before? You intend only to become a tyrant in the land, and you do not desire to become one of the reformers.’","vec_preview":[0.01679999940097332,0.0003000000142492354,-0.032999999821186066,0.013700000010430813,0.028300000354647636,-0.053300000727176666,-0.03400000184774399,-0.03400000184774399]},{"ayah_id":"28:20","surah":28,"ayah":20,"arabic":"وَجَاءَ رَجُلٌ مِّنْ أَقْصَى الْمَدِينَةِ يَسْعَىٰ قَالَ يَا مُوسَىٰ إِنَّ الْمَلَأَ يَأْتَمِرُونَ بِكَ لِيَقْتُلُوكَ فَاخْرُجْ إِنِّي لَكَ مِنَ النَّاصِحِينَ","english":"And a man came running from the far end of the city and said: ‘O Musa (Moses), the chiefs (of the people of Pharaoh) are counselling about you to kill you, so depart (from here). Surely, I am of your well-wishers.’","vec_preview":[0.013500000350177288,0.020500000566244125,-0.022099999710917473,-0.009600000455975533,0.03660000115633011,-0.030899999663233757,-0.02410000003874302,-0.04529999941587448]},{"ayah_id":"28:21","surah":28,"ayah":21,"arabic":"فَخَرَجَ مِنْهَا خَائِفًا يَتَرَقَّبُ ۖ قَالَ رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ","english":"So Musa (Moses), afraid and waiting for (Allah’s help), went off from there. He prayed: ‘O my Lord, deliver me from the oppressing people.’","vec_preview":[0.011800000444054604,0.012199999764561653,-0.03779999911785126,-0.0017999999690800905,0.022299999371170998,-0.03920000046491623,-0.016599999740719795,-0.05700000002980232]},{"ayah_id":"28:22","surah":28,"ayah":22,"arabic":"وَلَمَّا تَوَجَّهَ تِلْقَاءَ مَدْيَنَ قَالَ عَسَىٰ رَبِّي أَن يَهْدِيَنِي سَوَاءَ السَّبِيلِ","english":"And when he moved towards Madyan, he said: ‘I hope my Lord will show me the straight path (to take me to the desired destination).’","vec_preview":[0.01720000058412552,0.002899999963119626,-0.035100001841783524,-0.018799999728798866,-0.002400000113993883,-0.031099999323487282,-0.006500000134110451,-0.03500000014901161]},{"ayah_id":"28:23","surah":28,"ayah":23,"arabic":"وَلَمَّا وَرَدَ مَاءَ مَدْيَنَ وَجَدَ عَلَيْهِ أُمَّةً مِّنَ النَّاسِ يَسْقُونَ وَوَجَدَ مِن دُونِهِمُ امْرَأَتَيْنِ تَذُودَانِ ۖ قَالَ مَا خَطْبُكُمَا ۖ قَالَتَا لَا نَسْقِي حَتَّىٰ يُصْدِرَ الرِّعَاءُ ۖ وَأَبُونَا شَيْخٌ كَبِيرٌ","english":"And when he arrived at the watering (well) of Madyan, he found there a crowd of people watering (their flocks). And on a side, he saw two women, withdrawn, holding back (their goats. Musa [Moses]) asked: ‘Why are you (standing) in this condition?’ Both said: ‘We cannot water (our goats) till the shepherds take back their flocks and our father is an aged man.’","vec_preview":[0.00839999970048666,0.03830000013113022,-0.035999998450279236,-0.02019999921321869,0.048900000751018524,-0.02669999934732914,-0.02290000021457672,-0.03790000081062317]},{"ayah_id":"28:24","surah":28,"ayah":24,"arabic":"فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰ إِلَى الظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ","english":"So he watered their (flocks) and then turned back to the shade and submitted: ‘O Lord, I am in need of whatever good You send down to me.’","vec_preview":[0.003800000064074993,0.012600000016391277,-0.03830000013113022,-0.011599999852478504,0.023900000378489494,-0.041200000792741776,-0.019600000232458115,-0.05040000006556511]},{"ayah_id":"28:25","surah":28,"ayah":25,"arabic":"فَجَاءَتْهُ إِحْدَاهُمَا تَمْشِي عَلَى اسْتِحْيَاءٍ قَالَتْ إِنَّ أَبِي يَدْعُوكَ لِيَجْزِيَكَ أَجْرَ مَا سَقَيْتَ لَنَا ۚ فَلَمَّا جَاءَهُ وَقَصَّ عَلَيْهِ الْقَصَصَ قَالَ لَا تَخَفْ ۖ نَجَوْتَ مِنَ الْقَوْمِ الظَّالِمِينَ","english":"Then (after a while) one of those two (girls) came to him walking modestly. She said: ‘My father invites you so that he may reward you for (your labour in) watering (the flocks) for us. So when Musa (Moses) came to (Shu‘ayb, the father of those girls,) and narrated to him (the preceding) incidents, he said: ‘Do not fear. You are safe and secure from the oppressive people.’","vec_preview":[0.018799999728798866,0.020999999716877937,-0.03579999879002571,-0.0019000000320374966,0.04820000007748604,-0.022099999710917473,-0.02280000038444996,-0.0502999983727932]},{"ayah_id":"28:26","surah":28,"ayah":26,"arabic":"قَالَتْ إِحْدَاهُمَا يَا أَبَتِ اسْتَأْجِرْهُ ۖ إِنَّ خَيْرَ مَنِ اسْتَأْجَرْتَ الْقَوِيُّ الْأَمِينُ","english":"One of those (girls) said: ‘O (my) respectable father, take him (into your service). Surely, the best person you can employ is the one who is strong and trustworthy (and he is worthy of this assignment).’","vec_preview":[0.004399999976158142,0.017799999564886093,-0.023000000044703484,-0.011900000274181366,0.04280000180006027,-0.03929999843239784,-0.04320000112056732,-0.03269999846816063]},{"ayah_id":"28:27","surah":28,"ayah":27,"arabic":"قَالَ إِنِّي أُرِيدُ أَنْ أُنكِحَكَ إِحْدَى ابْنَتَيَّ هَاتَيْنِ عَلَىٰ أَن تَأْجُرَنِي ثَمَانِيَ حِجَجٍ ۖ فَإِنْ أَتْمَمْتَ عَشْرًا فَمِنْ عِندِكَ ۖ وَمَا أُرِيدُ أَنْ أَشُقَّ عَلَيْكَ ۚ سَتَجِدُنِي إِن شَاءَ اللَّهُ مِنَ الصَّالِحِينَ","english":"He said (to Musa [Moses]): ‘I intend to marry to you one of my two daughters by (the dower) that you serve me on hire for eight years, but if you complete ten (years), it will be (a favour) from you. And I do not want to make it hard for you. If Allah wills, you will find me of the pious.’","vec_preview":[0.02250000089406967,0.003100000089034438,-0.023600000888109207,0.0044999998062849045,0.050599999725818634,-0.037700001150369644,-0.024399999529123306,-0.062199998646974564]},{"ayah_id":"28:28","surah":28,"ayah":28,"arabic":"قَالَ ذَٰلِكَ بَيْنِي وَبَيْنَكَ ۖ أَيَّمَا الْأَجَلَيْنِ قَضَيْتُ فَلَا عُدْوَانَ عَلَيَّ ۖ وَاللَّهُ عَلَىٰ مَا نَقُولُ وَكِيلٌ","english":"Musa (Moses) said: ‘This (agreement) is (settled) between me and you. Whichever of the two terms I complete, I shall not be forced. And Allah is the Custodian over what we say.’","vec_preview":[0.01549999974668026,0.012900000438094139,-0.04190000146627426,0.0020000000949949026,0.00989999994635582,-0.03660000115633011,-0.03959999978542328,-0.03020000085234642]},{"ayah_id":"28:29","surah":28,"ayah":29,"arabic":"۞ فَلَمَّا قَضَىٰ مُوسَى الْأَجَلَ وَسَارَ بِأَهْلِهِ آنَسَ مِن جَانِبِ الطُّورِ نَارًا قَالَ لِأَهْلِهِ امْكُثُوا إِنِّي آنَسْتُ نَارًا لَّعَلِّي آتِيكُم مِّنْهَا بِخَبَرٍ أَوْ جَذْوَةٍ مِّنَ النَّارِ لَعَلَّكُمْ تَصْطَلُونَ","english":"So when Musa (Moses) completed the appointed term and set out with his wife, he saw a fire in the direction of Tur. (That was a flash of absolute beauty which caught his heart and fascinated him.) He said to his wife: ‘Stay (here). I have seen a fire. I may bring you some news (about Him) from that (fire in whose pursuit I have long been wandering), or (I may bring you) some burning brand from the (febrile) fire so that you (too) may feel the burn.’","vec_preview":[-0.0005000000237487257,0.010300000198185444,-0.032600000500679016,0.005200000014156103,0.029899999499320984,-0.05660000070929527,-0.027400000020861626,-0.03759999945759773]},{"ayah_id":"28:30","surah":28,"ayah":30,"arabic":"فَلَمَّا أَتَاهَا نُودِيَ مِن شَاطِئِ الْوَادِ الْأَيْمَنِ فِي الْبُقْعَةِ الْمُبَارَكَةِ مِنَ الشَّجَرَةِ أَن يَا مُوسَىٰ إِنِّي أَنَا اللَّهُ رَبُّ الْعَالَمِينَ","english":"When Musa (Moses) reached there, a call was made from the right side of (the blessed Tur) valley from a tree (located) in a blessed spot: ‘O Musa (Moses), verily, I am Allah, the Sustainer of all the worlds.","vec_preview":[-0.014800000004470348,0.007300000172108412,-0.04729999974370003,0.0017000000225380063,0.023399999365210533,-0.027699999511241913,-0.0044999998062849045,-0.0284000001847744]},{"ayah_id":"28:31","surah":28,"ayah":31,"arabic":"وَأَنْ أَلْقِ عَصَاكَ ۖ فَلَمَّا رَآهَا تَهْتَزُّ كَأَنَّهَا جَانٌّ وَلَّىٰ مُدْبِرًا وَلَمْ يُعَقِّبْ ۚ يَا مُوسَىٰ أَقْبِلْ وَلَا تَخَفْ ۖ إِنَّكَ مِنَ الْآمِنِينَ","english":"And throw your staff (on the ground).’ So when Musa (Moses) saw it moving fast, coiling and curling as if it was a snake, he turned his back, jogged off and did not look behind. (The Voice said:) ‘O Musa (Moses), come forth and do not fear. Surely, you are of the secure.","vec_preview":[0.0066999997943639755,0.010200000368058681,-0.03370000049471855,0.010999999940395355,0.016599999740719795,-0.02969999983906746,-0.018699999898672104,-0.04470000043511391]},{"ayah_id":"28:32","surah":28,"ayah":32,"arabic":"اسْلُكْ يَدَكَ فِي جَيْبِكَ تَخْرُجْ بَيْضَاءَ مِنْ غَيْرِ سُوءٍ وَاضْمُمْ إِلَيْكَ جَنَاحَكَ مِنَ الرَّهْبِ ۖ فَذَانِكَ بُرْهَانَانِ مِن رَّبِّكَ إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ ۚ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ","english":"Put your hand inside your collar opening. It will come out shining white without any disease. And flex your hand close to your (breast to remove) fear. These two signs from your Lord are for (sending to) Pharaoh and his courtiers (to observe). Surely, they are disobedient people.’","vec_preview":[0.006599999964237213,0.02590000070631504,-0.04479999840259552,0.009700000286102295,0.05139999836683273,-0.05119999870657921,-0.01940000057220459,-0.048500001430511475]},{"ayah_id":"28:33","surah":28,"ayah":33,"arabic":"قَالَ رَبِّ إِنِّي قَتَلْتُ مِنْهُمْ نَفْسًا فَأَخَافُ أَن يَقْتُلُونِ","english":"Musa (Moses) submitted: ‘O Lord, I killed one of them, so I fear they would kill me.","vec_preview":[0.006800000090152025,0.007400000002235174,-0.024000000208616257,-0.0020000000949949026,0.04179999977350235,-0.04360000044107437,-0.04149999842047691,-0.05779999867081642]},{"ayah_id":"28:34","surah":28,"ayah":34,"arabic":"وَأَخِي هَارُونُ هُوَ أَفْصَحُ مِنِّي لِسَانًا فَأَرْسِلْهُ مَعِيَ رِدْءًا يُصَدِّقُنِي ۖ إِنِّي أَخَافُ أَن يُكَذِّبُونِ","english":"And my brother Harun (Aaron) is more communicative and eloquent in speech than I, so send him with me as a helper that he may bear me out. And I (also) fear that they will reject me.’","vec_preview":[0.002099999925121665,0.009999999776482582,-0.0210999995470047,-0.004399999976158142,0.024700000882148743,-0.042500000447034836,-0.044599998742341995,-0.05400000140070915]},{"ayah_id":"28:35","surah":28,"ayah":35,"arabic":"قَالَ سَنَشُدُّ عَضُدَكَ بِأَخِيكَ وَنَجْعَلُ لَكُمَا سُلْطَانًا فَلَا يَصِلُونَ إِلَيْكُمَا ۚ بِآيَاتِنَا أَنتُمَا وَمَنِ اتَّبَعَكُمَا الْغَالِبُونَ","english":"(Allah) said: ‘We shall strengthen your arm with your brother and shall create for both of you dread and dominance (in the hearts of the people and in the impact of your endeavours). So they will not be able to reach you (to do harm) because of Our signs. You two and your followers will triumph and prevail.’","vec_preview":[0.01720000058412552,0.010099999606609344,-0.029999999329447746,-0.006099999882280827,0.03400000184774399,-0.04610000178217888,-0.025499999523162842,-0.04780000075697899]},{"ayah_id":"28:36","surah":28,"ayah":36,"arabic":"فَلَمَّا جَاءَهُم مُّوسَىٰ بِآيَاتِنَا بَيِّنَاتٍ قَالُوا مَا هَـٰذَا إِلَّا سِحْرٌ مُّفْتَرًى وَمَا سَمِعْنَا بِهَـٰذَا فِي آبَائِنَا الْأَوَّلِينَ","english":"So when Musa (Moses) came to them with Our clear and enlightening Signs, they said: ‘This is nothing but invented magic; we (never) heard of these things amongst our ancestors.’","vec_preview":[-0.012199999764561653,0.010099999606609344,-0.03370000049471855,0.011599999852478504,0.015699999406933784,-0.04749999940395355,-0.014600000344216824,-0.028699999675154686]},{"ayah_id":"28:37","surah":28,"ayah":37,"arabic":"وَقَالَ مُوسَىٰ رَبِّي أَعْلَمُ بِمَن جَاءَ بِالْهُدَىٰ مِنْ عِندِهِ وَمَن تَكُونُ لَهُ عَاقِبَةُ الدَّارِ ۖ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ","english":"And Musa (Moses) said: ‘My Lord knows best the one who has brought guidance from Him, and (also) the one for whom the House of the Hereafter will be the (best) end. Surely, the wrongdoers will not prosper.’","vec_preview":[0.013199999928474426,-0.004900000058114529,-0.030300000682473183,0.00559999980032444,0.020899999886751175,-0.05700000002980232,-0.03880000114440918,-0.031599998474121094]},{"ayah_id":"28:38","surah":28,"ayah":38,"arabic":"وَقَالَ فِرْعَوْنُ يَا أَيُّهَا الْمَلَأُ مَا عَلِمْتُ لَكُم مِّنْ إِلَـٰهٍ غَيْرِي فَأَوْقِدْ لِي يَا هَامَانُ عَلَى الطِّينِ فَاجْعَل لِّي صَرْحًا لَّعَلِّي أَطَّلِعُ إِلَىٰ إِلَـٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُ مِنَ الْكَاذِبِينَ","english":"And Pharaoh said: ‘O courtiers, I do not know any god other than me for you. O Haman! Kindle a fire on clay (to bake bricks) for me; then build me a high tower (with them. Climbing it,) I may perhaps have an access to the Lord of Musa (Moses). And I regard him as one of the liars.’","vec_preview":[-0.0066999997943639755,0.003000000026077032,-0.028599999845027924,0.0010000000474974513,0.042500000447034836,-0.03869999945163727,-0.023499999195337296,-0.04100000113248825]},{"ayah_id":"28:39","surah":28,"ayah":39,"arabic":"وَاسْتَكْبَرَ هُوَ وَجُنُودُهُ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَظَنُّوا أَنَّهُمْ إِلَيْنَا لَا يُرْجَعُونَ","english":"And he (Pharaoh) himself and his warriors were unjust in the land, committing arrogance and defiance and thought they would not be brought back to Us.","vec_preview":[-0.01679999940097332,0.00139999995008111,-0.03350000083446503,-0.010300000198185444,0.01769999973475933,-0.03920000046491623,-0.023900000378489494,-0.027699999511241913]},{"ayah_id":"28:40","surah":28,"ayah":40,"arabic":"فَأَخَذْنَاهُ وَجُنُودَهُ فَنَبَذْنَاهُمْ فِي الْيَمِّ ۖ فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الظَّالِمِينَ","english":"So We seized him and his forces (in the torment) and threw them into the sea. Observe then how (terrible) was the end of the tyrants!","vec_preview":[0.011099999770522118,0.014100000262260437,-0.03350000083446503,0.0044999998062849045,0.017899999395012856,-0.04800000041723251,-0.020899999886751175,-0.02810000069439411]},{"ayah_id":"28:41","surah":28,"ayah":41,"arabic":"وَجَعَلْنَاهُمْ أَئِمَّةً يَدْعُونَ إِلَى النَّارِ ۖ وَيَوْمَ الْقِيَامَةِ لَا يُنصَرُونَ","english":"And We made them the leaders (of the inmates of Hell), for they used to invite (people) towards Hell. And they will not be given any help on the Day of Resurrection.","vec_preview":[-0.00839999970048666,0.01209999993443489,-0.03370000049471855,0.00039999998989515007,0.02290000021457672,-0.033799998462200165,-0.021800000220537186,-0.039400000125169754]},{"ayah_id":"28:42","surah":28,"ayah":42,"arabic":"وَأَتْبَعْنَاهُمْ فِي هَـٰذِهِ الدُّنْيَا لَعْنَةً ۖ وَيَوْمَ الْقِيَامَةِ هُم مِّنَ الْمَقْبُوحِينَ","english":"And We made a curse to chase them in this world, and on the Day of Resurrection (as well) they will be (counted) amongst the miserable.","vec_preview":[0.01549999974668026,0.016499999910593033,-0.026000000536441803,0.0024999999441206455,0.022099999710917473,-0.03590000048279762,-0.01140000019222498,-0.03759999945759773]},{"ayah_id":"28:43","surah":28,"ayah":43,"arabic":"وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ مِن بَعْدِ مَا أَهْلَكْنَا الْقُرُونَ الْأُولَىٰ بَصَائِرَ لِلنَّاسِ وَهُدًى وَرَحْمَةً لَّعَلَّهُمْ يَتَذَكَّرُونَ","english":"And surely, after (this situation that) We had destroyed the former (defiant) communities, We gave Musa (Moses) the Book which was (a rich source of) vision, guidance and mercy for the people so that they might take advice.","vec_preview":[0.018300000578165054,-0.004600000102072954,-0.02449999935925007,-0.006500000134110451,0.013000000268220901,-0.03830000013113022,-0.023399999365210533,-0.04769999906420708]},{"ayah_id":"28:44","surah":28,"ayah":44,"arabic":"وَمَا كُنتَ بِجَانِبِ الْغَرْبِيِّ إِذْ قَضَيْنَا إِلَىٰ مُوسَى الْأَمْرَ وَمَا كُنتَ مِنَ الشَّاهِدِينَ","english":"And you were not (present at that time) on the western side (of Tur) when We sent the command (of Prophethood) towards Musa (Moses), nor were you amongst (those seventy people who were) witnesses (to the Revelation to Musa [Moses]. So what else is this narration except the news of the unseen?)","vec_preview":[0.0032999999821186066,-0.012900000438094139,-0.020800000056624413,-0.006300000008195639,0.01720000058412552,-0.04450000077486038,-0.027899999171495438,-0.0430000014603138]},{"ayah_id":"28:45","surah":28,"ayah":45,"arabic":"وَلَـٰكِنَّا أَنشَأْنَا قُرُونًا فَتَطَاوَلَ عَلَيْهِمُ الْعُمُرُ ۚ وَمَا كُنتَ ثَاوِيًا فِي أَهْلِ مَدْيَنَ تَتْلُو عَلَيْهِمْ آيَاتِنَا وَلَـٰكِنَّا كُنَّا مُرْسِلِينَ","english":"But We raised many generations (successively after Musa [Moses]) and long ages passed over them. Nor were you living amongst the people of Madyan (like Musa [Moses] and Shu‘ayb) reciting Our Verses to them. But it is for Us to send (you exalting with tidings of the unseen).","vec_preview":[0.01269999984651804,-0.014800000004470348,-0.02669999934732914,0.0027000000700354576,0.003100000089034438,-0.05380000174045563,-0.03830000013113022,-0.044599998742341995]},{"ayah_id":"28:46","surah":28,"ayah":46,"arabic":"وَمَا كُنتَ بِجَانِبِ الطُّورِ إِذْ نَادَيْنَا وَلَـٰكِن رَّحْمَةً مِّن رَّبِّكَ لِتُنذِرَ قَوْمًا مَّا أَتَاهُم مِّن نَّذِيرٍ مِّن قَبْلِكَ لَعَلَّهُمْ يَتَذَكَّرُونَ","english":"Nor were you (present at that time) on the side of Tur when We called out to Musa (Moses). But (enlightening you on all these matters of the unseen) is an (exceptional) mercy from your Lord so that (having awareness of these incidents) you may warn these people (of the torment of Allah) to whom no Warner has come before you, in order that they may accept admonition.","vec_preview":[0.010200000368058681,0.008999999612569809,-0.03200000151991844,-0.020800000056624413,0.013700000010430813,-0.0640999972820282,-0.015200000256299973,-0.05779999867081642]},{"ayah_id":"28:47","surah":28,"ayah":47,"arabic":"وَلَوْلَا أَن تُصِيبَهُم مُّصِيبَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ فَيَقُولُوا رَبَّنَا لَوْلَا أَرْسَلْتَ إِلَيْنَا رَسُولًا فَنَتَّبِعَ آيَاتِكَ وَنَكُونَ مِنَ الْمُؤْمِنِينَ","english":"And (We would not send any Messenger) if this was not the case that when some suffering should seize them due to their own evil deeds which they did, they would say: ‘O our Lord, why did You not send us any Messenger so that we might follow Your Revelations and become of the believers?’","vec_preview":[0.017100000753998756,0.014399999752640724,-0.044599998742341995,-0.007300000172108412,0.017999999225139618,-0.04470000043511391,-0.0142000000923872,-0.04349999874830246]},{"ayah_id":"28:48","surah":28,"ayah":48,"arabic":"فَلَمَّا جَاءَهُمُ الْحَقُّ مِنْ عِندِنَا قَالُوا لَوْلَا أُوتِيَ مِثْلَ مَا أُوتِيَ مُوسَىٰ ۚ أَوَلَمْ يَكْفُرُوا بِمَا أُوتِيَ مُوسَىٰ مِن قَبْلُ ۖ قَالُوا سِحْرَانِ تَظَاهَرَا وَقَالُوا إِنَّا بِكُلٍّ كَافِرُونَ","english":"Then when the truth came to them from Our presence, they said: ‘Why has this (Messenger) not been given the (signs) like those (signs) which were given to Musa (Moses)?’ Did they not deny those (signs) which were given to Musa (Moses) before this? They said: ‘Both (the Qur’an as well as the Torah) are magic (which) confirm and agree with each other.’ And they said: ‘We deny all (of them).’","vec_preview":[-0.006300000008195639,0.0007999999797903001,-0.02800000086426735,0.009399999864399433,0.019200000911951065,-0.0348999984562397,-0.01140000019222498,-0.02669999934732914]},{"ayah_id":"28:49","surah":28,"ayah":49,"arabic":"قُلْ فَأْتُوا بِكِتَابٍ مِّنْ عِندِ اللَّهِ هُوَ أَهْدَىٰ مِنْهُمَا أَتَّبِعْهُ إِن كُنتُمْ صَادِقِينَ","english":"Say: ‘Bring some (other) book from Allah which guides better than these two, (then) I shall follow that if you are truthful (in your blames).’","vec_preview":[0.016899999231100082,0.007699999958276749,-0.026599999517202377,-0.01769999973475933,0.025200000032782555,-0.006800000090152025,-0.026200000196695328,-0.05990000069141388]},{"ayah_id":"28:50","surah":28,"ayah":50,"arabic":"فَإِن لَّمْ يَسْتَجِيبُوا لَكَ فَاعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَاءَهُمْ ۚ وَمَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَوَاهُ بِغَيْرِ هُدًى مِّنَ اللَّهِ ۚ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","english":"But if they do not accept what you say, then know that (they do not have any logic); they merely follow their lusts. And who can be more astray than the one who follows his desire, abandoning the guidance from Allah? Surely, Allah does not guide the wrongdoers.","vec_preview":[0.004800000227987766,0.010400000028312206,-0.02889999933540821,-0.0066999997943639755,0.03220000118017197,-0.05249999836087227,-0.03269999846816063,-0.03620000183582306]},{"ayah_id":"28:51","surah":28,"ayah":51,"arabic":"۞ وَلَقَدْ وَصَّلْنَا لَهُمُ الْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُونَ","english":"And in fact, We kept sending for them successive commands (of the Qur’an) so that they might take direction and guidance.","vec_preview":[-0.008999999612569809,0.007799999788403511,-0.029200000688433647,-0.002300000051036477,0.041200000792741776,-0.0272000003606081,-0.012299999594688416,-0.05510000139474869]},{"ayah_id":"28:52","surah":28,"ayah":52,"arabic":"الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ مِن قَبْلِهِ هُم بِهِ يُؤْمِنُونَ","english":"Those whom We gave the Book before this, they believe in this (Qur’an as well in the continuation of the same guidance).","vec_preview":[0.021400000900030136,-0.001500000013038516,-0.0284000001847744,-0.006399999838322401,0.03590000048279762,-0.03009999915957451,-0.024900000542402267,-0.05000000074505806]},{"ayah_id":"28:53","surah":28,"ayah":53,"arabic":"وَإِذَا يُتْلَىٰ عَلَيْهِمْ قَالُوا آمَنَّا بِهِ إِنَّهُ الْحَقُّ مِن رَّبِّنَا إِنَّا كُنَّا مِن قَبْلِهِ مُسْلِمِينَ","english":"And when (the Qur’an) is recited to them, they say: ‘We believe in it; verily, it is the truth from our Lord. In fact, we had become Muslims (i.e., the yielding) even before this.’","vec_preview":[-0.010999999940395355,0.009999999776482582,-0.03869999945163727,-0.013299999758601189,0.03189999982714653,-0.03200000151991844,-0.025599999353289604,-0.03920000046491623]},{"ayah_id":"28:54","surah":28,"ayah":54,"arabic":"أُولَـٰئِكَ يُؤْتَوْنَ أَجْرَهُم مَّرَّتَيْنِ بِمَا صَبَرُوا وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ","english":"It is these people who will be given their reward twice because they remained steadfast and fended off evil with good, and spent in Our way out of the bounty We bestowed upon them.","vec_preview":[0.011699999682605267,0.027400000020861626,-0.04639999940991402,-0.007000000216066837,0.01360000018030405,-0.039500001817941666,-0.006899999920278788,-0.037300001829862595]},{"ayah_id":"28:55","surah":28,"ayah":55,"arabic":"وَإِذَا سَمِعُوا اللَّغْوَ أَعْرَضُوا عَنْهُ وَقَالُوا لَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ سَلَامٌ عَلَيْكُمْ لَا نَبْتَغِي الْجَاهِلِينَ","english":"And when they hear anything absurd, they turn away from it and say: ‘For us are our deeds and for you are your deeds. Peace be upon you! We do not want (to adopt the mentality and conduct of) the ignorant. (Why should we give up our good for the sake of their evil?)’","vec_preview":[0.0027000000700354576,0.019200000911951065,-0.04859999939799309,-0.0008999999845400453,0.026900000870227814,-0.03370000049471855,-0.027799999341368675,-0.05050000175833702]},{"ayah_id":"28:56","surah":28,"ayah":56,"arabic":"إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَـٰكِنَّ اللَّهَ يَهْدِي مَن يَشَاءُ ۚ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ","english":"The truth is that whoever you like (to bring on to the path of guidance), you do not yourself bring him on to the path of guidance. Instead, (it so happens that) whomever Allah pleases, He makes him tread the path of guidance (through your mediation). And He knows best those who find the path of guidance.","vec_preview":[-0.013700000010430813,0.012799999676644802,-0.023600000888109207,0.01899999938905239,0.0215000007301569,-0.03709999844431877,-0.03290000185370445,-0.049400001764297485]},{"ayah_id":"28:57","surah":28,"ayah":57,"arabic":"وَقَالُوا إِن نَّتَّبِعِ الْهُدَىٰ مَعَكَ نُتَخَطَّفْ مِنْ أَرْضِنَا ۚ أَوَلَمْ نُمَكِّن لَّهُمْ حَرَمًا آمِنًا يُجْبَىٰ إِلَيْهِ ثَمَرَاتُ كُلِّ شَيْءٍ رِّزْقًا مِّن لَّدُنَّا وَلَـٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ","english":"And (the ignorant of its value) say: ‘If we follow the guidance in your company, we shall be snatched out of our land.’ Have We not made them settle in (this) secure and peaceful Sanctuary (Mecca—your own land) where all kinds of fruits are supplied (from all over the world) as sustenance from Us? But most of them do not know (for whose sake this whole process operates).","vec_preview":[0.007000000216066837,0.012799999676644802,-0.020999999716877937,-0.0066999997943639755,0.025699999183416367,-0.03139999881386757,-0.010200000368058681,-0.052400000393390656]},{"ayah_id":"28:58","surah":28,"ayah":58,"arabic":"وَكَمْ أَهْلَكْنَا مِن قَرْيَةٍ بَطِرَتْ مَعِيشَتَهَا ۖ فَتِلْكَ مَسَاكِنُهُمْ لَمْ تُسْكَن مِّن بَعْدِهِمْ إِلَّا قَلِيلًا ۖ وَكُنَّا نَحْنُ الْوَارِثِينَ","english":"And how many towns have We destroyed that became arrogant and ungrateful on account of their prosperous economies! So here are (the remains of) their (ruined) houses that have been inhabited after them but little. And We alone are the Inheritor and Owner (in the end).","vec_preview":[0.017500000074505806,-0.0066999997943639755,-0.014299999922513962,-0.002400000113993883,0.017999999225139618,-0.03480000048875809,-0.025800000876188278,-0.04580000042915344]},{"ayah_id":"28:59","surah":28,"ayah":59,"arabic":"وَمَا كَانَ رَبُّكَ مُهْلِكَ الْقُرَىٰ حَتَّىٰ يَبْعَثَ فِي أُمِّهَا رَسُولًا يَتْلُو عَلَيْهِمْ آيَاتِنَا ۚ وَمَا كُنَّا مُهْلِكِي الْقُرَىٰ إِلَّا وَأَهْلُهَا ظَالِمُونَ","english":"And your Lord does not destroy the towns until He sends to their capital city a Messenger who recites to them Our Verses. And We do not destroy towns unless their dwellers are given to oppression.","vec_preview":[0.02590000070631504,0.003000000026077032,-0.0364999994635582,0.01360000018030405,0.006800000090152025,-0.03709999844431877,-0.008500000461935997,-0.04690000042319298]},{"ayah_id":"28:60","surah":28,"ayah":60,"arabic":"وَمَا أُوتِيتُم مِّن شَيْءٍ فَمَتَاعُ الْحَيَاةِ الدُّنْيَا وَزِينَتُهَا ۚ وَمَا عِندَ اللَّهِ خَيْرٌ وَأَبْقَىٰ ۚ أَفَلَا تَعْقِلُونَ","english":"And whatever you have been given are but provisions of the worldly life, its charms and beauty. But what is (yet) with Allah is far better (than this) and eternal. Do you not understand (this fact)?","vec_preview":[0.004100000020116568,0.009100000374019146,-0.03269999846816063,0.004800000227987766,0.0203000009059906,-0.04170000180602074,-0.012000000104308128,-0.041999999433755875]},{"ayah_id":"28:61","surah":28,"ayah":61,"arabic":"أَفَمَن وَعَدْنَاهُ وَعْدًا حَسَنًا فَهُوَ لَاقِيهِ كَمَن مَّتَّعْنَاهُ مَتَاعَ الْحَيَاةِ الدُّنْيَا ثُمَّ هُوَ يَوْمَ الْقِيَامَةِ مِنَ الْمُحْضَرِينَ","english":"Can he to whom We have made an excellent promise (pertaining to Hereafter), and who becomes one to attain to it be like the (ill-fated) one We have given the good things of worldly life, then (owing to ingratitude for the bounties) becomes of those who will be brought forth on the Last Day (for punishment)?","vec_preview":[0.011300000362098217,0.019500000402331352,-0.03590000048279762,-0.0066999997943639755,0.01850000023841858,-0.032499998807907104,-0.026000000536441803,-0.04259999841451645]},{"ayah_id":"28:62","surah":28,"ayah":62,"arabic":"وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَائِيَ الَّذِينَ كُنتُمْ تَزْعُمُونَ","english":"And the Day when (Allah) will call them and say: ‘Where are those that you regarded as My partners and considered them (gods)?’","vec_preview":[0.008899999782443047,0.02669999934732914,-0.03280000016093254,-0.004800000227987766,0.02070000022649765,-0.029100000858306885,-0.026200000196695328,-0.04769999906420708]},{"ayah_id":"28:63","surah":28,"ayah":63,"arabic":"قَالَ الَّذِينَ حَقَّ عَلَيْهِمُ الْقَوْلُ رَبَّنَا هَـٰؤُلَاءِ الَّذِينَ أَغْوَيْنَا أَغْوَيْنَاهُمْ كَمَا غَوَيْنَا ۖ تَبَرَّأْنَا إِلَيْكَ ۖ مَا كَانُوا إِيَّانَا يَعْبُدُونَ","english":"The people against whom the command (of torment) has been proved will say: ‘O our Lord, it is these people who we misguided. We led them astray (the same way) as we (ourselves) lost the right path. We turn to You showing our disgust towards them and (in fact) they did not worship us. (They rather worshipped their lusts.)’","vec_preview":[0.0026000000070780516,0.02370000071823597,-0.021400000900030136,0.006099999882280827,0.03269999846816063,-0.04690000042319298,-0.027000000700354576,-0.042899999767541885]},{"ayah_id":"28:64","surah":28,"ayah":64,"arabic":"وَقِيلَ ادْعُوا شُرَكَاءَكُمْ فَدَعَوْهُمْ فَلَمْ يَسْتَجِيبُوا لَهُمْ وَرَأَوُا الْعَذَابَ ۚ لَوْ أَنَّهُمْ كَانُوا يَهْتَدُونَ","english":"And it will be said (to them): ‘Call your (self-made) partners.’ So they will call them but they (the partners) will not respond to them and those people will see the torment. Would that they had taken guidance (in the world)!","vec_preview":[0.023099999874830246,0.010999999940395355,-0.03799999877810478,-0.013299999758601189,0.04800000041723251,-0.05510000139474869,-0.03370000049471855,-0.04919999837875366]},{"ayah_id":"28:65","surah":28,"ayah":65,"arabic":"وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ مَاذَا أَجَبْتُمُ الْمُرْسَلِينَ","english":"And the Day when (Allah) will call to them, He will say: ‘What answer did you serve to the Messengers?’","vec_preview":[0.00039999998989515007,0.027799999341368675,-0.02979999966919422,-0.000699999975040555,0.011099999770522118,-0.011699999682605267,-0.010200000368058681,-0.04390000179409981]},{"ayah_id":"28:66","surah":28,"ayah":66,"arabic":"فَعَمِيَتْ عَلَيْهِمُ الْأَنبَاءُ يَوْمَئِذٍ فَهُمْ لَا يَتَسَاءَلُونَ","english":"On that Day, all information will become unknown to them, and they will not be able to ask (even) one another.","vec_preview":[0.0010000000474974513,0.031700000166893005,-0.0421999990940094,-0.010499999858438969,0.0035000001080334187,-0.008299999870359898,-0.03739999979734421,-0.04919999837875366]},{"ayah_id":"28:67","surah":28,"ayah":67,"arabic":"فَأَمَّا مَن تَابَ وَآمَنَ وَعَمِلَ صَالِحًا فَعَسَىٰ أَن يَكُونَ مِنَ الْمُفْلِحِينَ","english":"But whoever repents and believes and does pious deeds will surely be of those who are successful.","vec_preview":[0.02759999968111515,0.026100000366568565,-0.03739999979734421,-0.0007999999797903001,0.027699999511241913,-0.02889999933540821,-0.02800000086426735,-0.0272000003606081]},{"ayah_id":"28:68","surah":28,"ayah":68,"arabic":"وَرَبُّكَ يَخْلُقُ مَا يَشَاءُ وَيَخْتَارُ ۗ مَا كَانَ لَهُمُ الْخِيَرَةُ ۚ سُبْحَانَ اللَّهِ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ","english":"And your Lord creates whatever He wills and chooses (whom He pleases for Prophethood and for the right of intercession). These (disbelievers and polytheists) have no authority or choice (in this matter). Holy is Allah the Glorious and Exalted, far above (the false gods) that they associate as partners (with Allah)!","vec_preview":[0.01080000028014183,0.01679999940097332,-0.032099999487400055,-0.0013000000035390258,0.0017000000225380063,-0.03139999881386757,-0.02290000021457672,-0.031300000846385956]},{"ayah_id":"28:69","surah":28,"ayah":69,"arabic":"وَرَبُّكَ يَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ وَمَا يُعْلِنُونَ","english":"And your Lord knows (all) what their breasts hide (inside) and what they make known.","vec_preview":[-0.005400000140070915,0.0272000003606081,-0.00839999970048666,0.022099999710917473,0.02539999969303608,-0.019700000062584877,-0.023800000548362732,-0.046300001442432404]},{"ayah_id":"28:70","surah":28,"ayah":70,"arabic":"وَهُوَ اللَّهُ لَا إِلَـٰهَ إِلَّا هُوَ ۖ لَهُ الْحَمْدُ فِي الْأُولَىٰ وَالْآخِرَةِ ۖ وَلَهُ الْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ","english":"And He alone is Allah; apart from Him there is no God. All praise belongs to Him in the world and in the Hereafter. And His alone is the (true) command and rule and to Him alone will you be returned.","vec_preview":[0.0017999999690800905,-0.003599999938160181,-0.027300000190734863,0.007199999876320362,0.025200000032782555,-0.04450000077486038,-0.021900000050663948,-0.03680000081658363]},{"ayah_id":"28:71","surah":28,"ayah":71,"arabic":"قُلْ أَرَأَيْتُمْ إِن جَعَلَ اللَّهُ عَلَيْكُمُ اللَّيْلَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ إِلَـٰهٌ غَيْرُ اللَّهِ يَأْتِيكُم بِضِيَاءٍ ۖ أَفَلَا تَسْمَعُونَ","english":"Say: ‘Just answer: If Allah prolongs the night over you till the Day of Resurrection, (then) what god is there besides Allah who will bring you light? Do you not hear (these words)?’","vec_preview":[0.009499999694526196,0.01979999989271164,-0.01979999989271164,-0.006500000134110451,0.04149999842047691,-0.03880000114440918,-0.010400000028312206,-0.04270000010728836]},{"ayah_id":"28:72","surah":28,"ayah":72,"arabic":"قُلْ أَرَأَيْتُمْ إِن جَعَلَ اللَّهُ عَلَيْكُمُ النَّهَارَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ إِلَـٰهٌ غَيْرُ اللَّهِ يَأْتِيكُم بِلَيْلٍ تَسْكُنُونَ فِيهِ ۖ أَفَلَا تُبْصِرُونَ","english":"Say: ‘Just tell me this (as well): If Allah prolongs the day over you till the Day of Resurrection, (then) what god is there besides Allah who will bring you night in which you may take rest? Do you not see?’","vec_preview":[0.010700000450015068,0.02810000069439411,-0.020400000736117363,-0.00570000009611249,0.03750000149011612,-0.03790000081062317,-0.016300000250339508,-0.039799999445676804]},{"ayah_id":"28:73","surah":28,"ayah":73,"arabic":"وَمِن رَّحْمَتِهِ جَعَلَ لَكُمُ اللَّيْلَ وَالنَّهَارَ لِتَسْكُنُوا فِيهِ وَلِتَبْتَغُوا مِن فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ","english":"And it is out of His mercy that He has made night and day for you so that at night you may take rest and (during the day) you may seek His bounty (sustenance) and so that you may become grateful.","vec_preview":[0.017899999395012856,0.012199999764561653,-0.027699999511241913,-0.009600000455975533,0.020600000396370888,-0.03700000047683716,-0.01080000028014183,-0.058400001376867294]},{"ayah_id":"28:74","surah":28,"ayah":74,"arabic":"وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَائِيَ الَّذِينَ كُنتُمْ تَزْعُمُونَ","english":"And the Day when He will call to them and say: ‘Where are they who you regarded as My partners and considered (gods)?’","vec_preview":[0.008899999782443047,0.02669999934732914,-0.03280000016093254,-0.004800000227987766,0.02070000022649765,-0.029100000858306885,-0.026200000196695328,-0.04769999906420708]},{"ayah_id":"28:75","surah":28,"ayah":75,"arabic":"وَنَزَعْنَا مِن كُلِّ أُمَّةٍ شَهِيدًا فَقُلْنَا هَاتُوا بُرْهَانَكُمْ فَعَلِمُوا أَنَّ الْحَقَّ لِلَّهِ وَضَلَّ عَنْهُم مَّا كَانُوا يَفْتَرُونَ","english":"And We shall take out from every community a witness, and We shall then say (to the disbelievers): ‘Bring your proof.’ Then they will know that the truth belongs to Allah, and all (the lies) they used to invent will disappear from them.","vec_preview":[-0.0010000000474974513,0.009100000374019146,-0.03099999949336052,-0.013500000350177288,0.028200000524520874,-0.02239999920129776,-0.01889999955892563,-0.03720000013709068]},{"ayah_id":"28:76","surah":28,"ayah":76,"arabic":"۞ إِنَّ قَارُونَ كَانَ مِن قَوْمِ مُوسَىٰ فَبَغَىٰ عَلَيْهِمْ ۖ وَآتَيْنَاهُ مِنَ الْكُنُوزِ مَا إِنَّ مَفَاتِحَهُ لَتَنُوءُ بِالْعُصْبَةِ أُولِي الْقُوَّةِ إِذْ قَالَ لَهُ قَوْمُهُ لَا تَفْرَحْ ۖ إِنَّ اللَّهَ لَا يُحِبُّ الْفَرِحِينَ","english":"No doubt Qarun (Korah) was of the people of Musa (Moses) but he oppressed them. And We gave him so much of treasures that it was hard for a powerful party of strong men to (carry) his keys whilst his people said to him: ‘Do not be arrogant and conceited (out of rejoicing). Verily, Allah does not like those who gloat.","vec_preview":[-0.014100000262260437,0.004000000189989805,-0.0272000003606081,-0.00139999995008111,0.027699999511241913,-0.049400001764297485,-0.03689999878406525,-0.026399999856948853]},{"ayah_id":"28:77","surah":28,"ayah":77,"arabic":"وَابْتَغِ فِيمَا آتَاكَ اللَّهُ الدَّارَ الْآخِرَةَ ۖ وَلَا تَنسَ نَصِيبَكَ مِنَ الدُّنْيَا ۖ وَأَحْسِن كَمَا أَحْسَنَ اللَّهُ إِلَيْكَ ۖ وَلَا تَبْغِ الْفَسَادَ فِي الْأَرْضِ ۖ إِنَّ اللَّهَ لَا يُحِبُّ الْمُفْسِدِينَ","english":"And seek the home of the Hereafter with what (wealth) Allah has given you, and (also) do not forget your share of the world. And do (such) good (to the people) as Allah has done good to you. But do not look for (ways to spread) evil and terror in the land (through oppression, accumulation of wealth and exploitation). Surely, Allah does not like those who violate peace.’","vec_preview":[0.00989999994635582,0.016100000590085983,-0.042899999767541885,-0.0017000000225380063,0.018400000408291817,-0.04839999973773956,-0.016200000420212746,-0.0430000014603138]},{"ayah_id":"28:78","surah":28,"ayah":78,"arabic":"قَالَ إِنَّمَا أُوتِيتُهُ عَلَىٰ عِلْمٍ عِندِي ۚ أَوَلَمْ يَعْلَمْ أَنَّ اللَّهَ قَدْ أَهْلَكَ مِن قَبْلِهِ مِنَ الْقُرُونِ مَنْ هُوَ أَشَدُّ مِنْهُ قُوَّةً وَأَكْثَرُ جَمْعًا ۚ وَلَا يُسْأَلُ عَن ذُنُوبِهِمُ الْمُجْرِمُونَ","english":"He said: ‘(Why should I spend this capital for the good of people and society?) This wealth has been given to me only on the basis of (the professional) knowledge and skill I possess.’ Did he not know that Allah had indeed destroyed before him many communities who were far stronger than him in might and far ahead in accumulating (wealth and manpower)? And the culprits will not be questioned (for fact-finding or any excuse or reason) about their sins (at the time of destruction).","vec_preview":[0.008999999612569809,-0.00930000003427267,-0.018300000578165054,-0.0008999999845400453,0.029400000348687172,-0.04010000079870224,-0.032099999487400055,-0.039799999445676804]},{"ayah_id":"28:79","surah":28,"ayah":79,"arabic":"فَخَرَجَ عَلَىٰ قَوْمِهِ فِي زِينَتِهِ ۖ قَالَ الَّذِينَ يُرِيدُونَ الْحَيَاةَ الدُّنْيَا يَا لَيْتَ لَنَا مِثْلَ مَا أُوتِيَ قَارُونُ إِنَّهُ لَذُو حَظٍّ عَظِيمٍ","english":"Then he went forth before his people, (fully) adorned and ornamented. (Seeing his apparent pomp and show) those who were desirous of worldly life could not help saying: ‘Would that there were such (affluence and riches) for us (as well) as Qarun (Korah) has been given! Surely, he has a mighty fortune.’","vec_preview":[0.006200000178068876,0.005400000140070915,-0.012400000356137753,-0.014399999752640724,0.010599999688565731,-0.0340999998152256,-0.026799999177455902,-0.0430000014603138]},{"ayah_id":"28:80","surah":28,"ayah":80,"arabic":"وَقَالَ الَّذِينَ أُوتُوا الْعِلْمَ وَيْلَكُمْ ثَوَابُ اللَّهِ خَيْرٌ لِّمَنْ آمَنَ وَعَمِلَ صَالِحًا وَلَا يُلَقَّاهَا إِلَّا الصَّابِرُونَ","english":"And (on the other side) those who had been granted knowledge (of the truth) said: ‘Woe to you! Allah’s reward is (far) better (than this wealth and adornment) for him who has believed and is committed to pious deeds. But this (reward and compensation) will not be given except to those who keep patience.’","vec_preview":[0.00430000014603138,0.02850000001490116,-0.030300000682473183,-0.00989999994635582,0.04960000142455101,-0.04230000078678131,-0.008200000040233135,-0.03500000014901161]},{"ayah_id":"28:81","surah":28,"ayah":81,"arabic":"فَخَسَفْنَا بِهِ وَبِدَارِهِ الْأَرْضَ فَمَا كَانَ لَهُ مِن فِئَةٍ يَنصُرُونَهُ مِن دُونِ اللَّهِ وَمَا كَانَ مِنَ الْمُنتَصِرِينَ","english":"Then We sank him (Qarun [Korah]) and his house into the earth. So except Allah, there was no (such) party that could help him (in saving from the torment). Nor could he stop the torment himself.","vec_preview":[0.0019000000320374966,0.00930000003427267,-0.024900000542402267,-0.006599999964237213,0.015699999406933784,-0.04690000042319298,-0.02800000086426735,-0.02630000002682209]},{"ayah_id":"28:82","surah":28,"ayah":82,"arabic":"وَأَصْبَحَ الَّذِينَ تَمَنَّوْا مَكَانَهُ بِالْأَمْسِ يَقُولُونَ وَيْكَأَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَن يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ ۖ لَوْلَا أَن مَّنَّ اللَّهُ عَلَيْنَا لَخَسَفَ بِنَا ۖ وَيْكَأَنَّهُ لَا يُفْلِحُ الْكَافِرُونَ","english":"And those who were longing for his position and prominence the day before said (feeling sorry and regretful): ‘How amazing! Allah gives abundantly to whom He wills and sparingly (to whom He wills) of His servants. Had Allah not done favour to us, He would have sunk us (too). Ah! (It is now understood) that the disbelievers cannot attain to deliverance.’","vec_preview":[0.002300000051036477,0.011300000362098217,-0.03099999949336052,0.010099999606609344,0.03359999880194664,-0.02879999950528145,-0.02160000056028366,-0.03720000013709068]},{"ayah_id":"28:83","surah":28,"ayah":83,"arabic":"تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوًّا فِي الْأَرْضِ وَلَا فَسَادًا ۚ وَالْعَاقِبَةُ لِلْمُتَّقِينَ","english":"(This) is the Home of the Hereafter We have made for such people that seek neither violence and vanity nor mischief in the land. And good end is for the Godfearing.","vec_preview":[0.008999999612569809,0.01140000019222498,-0.038600001484155655,-0.006300000008195639,0.017000000923871994,-0.04839999973773956,-0.026499999687075615,-0.04899999871850014]},{"ayah_id":"28:84","surah":28,"ayah":84,"arabic":"مَن جَاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِّنْهَا ۖ وَمَن جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى الَّذِينَ عَمِلُوا السَّيِّئَاتِ إِلَّا مَا كَانُوا يَعْمَلُونَ","english":"Whoever brings good, for him is reward better than that; and whoever brings evil, then there is no compensation for the evildoers but equal to what they used to do.","vec_preview":[0.024399999529123306,0.017799999564886093,-0.04729999974370003,0.012799999676644802,0.025299999862909317,-0.03909999877214432,-0.021900000050663948,-0.029500000178813934]},{"ayah_id":"28:85","surah":28,"ayah":85,"arabic":"إِنَّ الَّذِي فَرَضَ عَلَيْكَ الْقُرْآنَ لَرَادُّكَ إِلَىٰ مَعَادٍ ۚ قُل رَّبِّي أَعْلَمُ مَن جَاءَ بِالْهُدَىٰ وَمَنْ هُوَ فِي ضَلَالٍ مُّبِينٍ","english":"Surely, the (Lord) Who has enjoined (the teaching, preaching and establishment of the system given in) the Qur’an upon you will bring you back (according to your desire) to the place of return (Mecca or the Hereafter with victory and success). Say: ‘My Lord knows best the one who brought guidance and (also) the one who is in open error.’*","vec_preview":[0.021800000220537186,0.018400000408291817,-0.03350000083446503,0.00800000037997961,0.041600000113248825,-0.02800000086426735,-0.020600000396370888,-0.04259999841451645]},{"ayah_id":"28:86","surah":28,"ayah":86,"arabic":"وَمَا كُنتَ تَرْجُو أَن يُلْقَىٰ إِلَيْكَ الْكِتَابُ إِلَّا رَحْمَةً مِّن رَّبِّكَ ۖ فَلَا تَكُونَنَّ ظَهِيرًا لِّلْكَافِرِينَ","english":"(The Muslim Umma [Community] is addressed through the Prophet, blessings and peace be upon him:) And you did not expect that this (Book) will be revealed to you, but it is (revealed by) the mercy of your Lord. So never be a helper of the disbelievers.","vec_preview":[0.023800000548362732,0.0032999999821186066,-0.03449999913573265,-0.014700000174343586,0.017100000753998756,-0.031700000166893005,-0.012900000438094139,-0.052299998700618744]},{"ayah_id":"28:87","surah":28,"ayah":87,"arabic":"وَلَا يَصُدُّنَّكَ عَنْ آيَاتِ اللَّهِ بَعْدَ إِذْ أُنزِلَتْ إِلَيْكَ ۖ وَادْعُ إِلَىٰ رَبِّكَ ۖ وَلَا تَكُونَنَّ مِنَ الْمُشْرِكِينَ","english":"And never let these (disbelievers) turn you away from (implementing and preaching of) the Revelations of Allah after they have been sent down to you. And keep calling (the people) towards your Lord, and never become of those who associate partners with Allah.","vec_preview":[-0.00279999990016222,0.002899999963119626,-0.03970000147819519,-0.009499999694526196,0.021800000220537186,-0.04699999839067459,-0.008999999612569809,-0.0560000017285347]},{"ayah_id":"28:88","surah":28,"ayah":88,"arabic":"وَلَا تَدْعُ مَعَ اللَّهِ إِلَـٰهًا آخَرَ ۘ لَا إِلَـٰهَ إِلَّا هُوَ ۚ كُلُّ شَيْءٍ هَالِكٌ إِلَّا وَجْهَهُ ۚ لَهُ الْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ","english":"And never worship any other (self-made) god besides Allah. None has the right to be worshipped except He. Everything has to perish but He. His is the command and to Him you (all) will be returned.","vec_preview":[0.0005000000237487257,-0.0010000000474974513,-0.032999999821186066,0.015200000256299973,0.02800000086426735,-0.0364999994635582,-0.006899999920278788,-0.0430000014603138]}]