[{"ayah_id":"60:1","surah":60,"ayah":1,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِم بِالْمَوَدَّةِ وَقَدْ كَفَرُوا بِمَا جَاءَكُم مِّنَ الْحَقِّ يُخْرِجُونَ الرَّسُولَ وَإِيَّاكُمْ ۙ أَن تُؤْمِنُوا بِاللَّهِ رَبِّكُمْ إِن كُنتُمْ خَرَجْتُمْ جِهَادًا فِي سَبِيلِي وَابْتِغَاءَ مَرْضَاتِي ۚ تُسِرُّونَ إِلَيْهِم بِالْمَوَدَّةِ وَأَنَا أَعْلَمُ بِمَا أَخْفَيْتُمْ وَمَا أَعْلَنتُمْ ۚ وَمَن يَفْعَلْهُ مِنكُمْ فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ","english":"O believers! Do not make friends with My enemies and your enemies. You communicate to them information because of (your) friendship, whereas they just deny the very truth that has come to you. They drive out the Messenger (blessings and peace be upon him) and you (from your land) because you believe in Allah, your Sustainer. If you have set out to fight in My way and seek My pleasure (then do not have friendship with them). You send them secret messages of friendship whilst I know best what you hide and what you make known. And whoever of you does this (misdeed) has deviated from the straight path.","vec_preview":[0.025599999353289604,0.0215000007301569,-0.03759999945759773,-0.013000000268220901,0.031099999323487282,-0.04910000041127205,-0.027899999171495438,-0.050999999046325684]},{"ayah_id":"60:2","surah":60,"ayah":2,"arabic":"إِن يَثْقَفُوكُمْ يَكُونُوا لَكُمْ أَعْدَاءً وَيَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ وَأَلْسِنَتَهُم بِالسُّوءِ وَوَدُّوا لَوْ تَكْفُرُونَ","english":"Should they get the better of you, then (you will see that) they will be your open enemies. And they will extend their hands and tongues to you with evil design and will have the earnest desire that you disbelieve (somehow).","vec_preview":[0.00570000009611249,0.014700000174343586,-0.0430000014603138,0.007199999876320362,0.04500000178813934,-0.03610000014305115,-0.017799999564886093,-0.05009999871253967]},{"ayah_id":"60:3","surah":60,"ayah":3,"arabic":"لَن تَنفَعَكُمْ أَرْحَامُكُمْ وَلَا أَوْلَادُكُمْ ۚ يَوْمَ الْقِيَامَةِ يَفْصِلُ بَيْنَكُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ","english":"Neither your (disbelieving and polytheist) kindred nor your (disbelieving and polytheist) children will be of any good to you on the Day of Resurrection. (On that Day Allah will) bring about complete separation between you (the believers will be sent to Paradise and the disbelievers to Hell). And Allah observes your doings well.","vec_preview":[-0.005799999926239252,0.02759999968111515,-0.03400000184774399,0.007799999788403511,0.027300000190734863,-0.04390000179409981,0.0026000000070780516,-0.04149999842047691]},{"ayah_id":"60:4","surah":60,"ayah":4,"arabic":"قَدْ كَانَتْ لَكُمْ أُسْوَةٌ حَسَنَةٌ فِي إِبْرَاهِيمَ وَالَّذِينَ مَعَهُ إِذْ قَالُوا لِقَوْمِهِمْ إِنَّا بُرَآءُ مِنكُمْ وَمِمَّا تَعْبُدُونَ مِن دُونِ اللَّهِ كَفَرْنَا بِكُمْ وَبَدَا بَيْنَنَا وَبَيْنَكُمُ الْعَدَاوَةُ وَالْبَغْضَاءُ أَبَدًا حَتَّىٰ تُؤْمِنُوا بِاللَّهِ وَحْدَهُ إِلَّا قَوْلَ إِبْرَاهِيمَ لِأَبِيهِ لَأَسْتَغْفِرَنَّ لَكَ وَمَا أَمْلِكُ لَكَ مِنَ اللَّهِ مِن شَيْءٍ ۖ رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ","english":"Indeed, in Ibrahim (Abraham) and his companions there is an excellent example for you (to follow), when they said to their people: ‘We are utterly weary of (and cut off from) you and the idols that you worship apart from Allah; we have openly rejected you all. The enmity, hatred and malice between us and you have become evident forever until you believe in Allah, the One.’ But Ibrahim’s (Abraham’s) saying to his (foster) father: ‘I shall certainly pray for your forgiveness,’ (was just a promise made to him well before, which he fulfilled and gave him a reminder as well saying:) ‘I do not possess anything for you before Allah (owing to your disbelief and idol-worship.’ Then he separated from his people, praying:) ‘O our Lord, we put our trust in You alone, and we turn in repentance to You alone, and (all) have to return to You alone.","vec_preview":[0.013299999758601189,0.02889999933540821,-0.032499998807907104,0.008299999870359898,0.02879999950528145,-0.0478999987244606,-0.009999999776482582,-0.021800000220537186]},{"ayah_id":"60:5","surah":60,"ayah":5,"arabic":"رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا ۖ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ","english":"O our Lord! Make us not a source of trial for the disbelievers (i.e., give them not control over us) and forgive us. O our Lord, surely You alone are the Almighty, the Lord of Honour, the Most Wise.’","vec_preview":[-0.0013000000035390258,0.002899999963119626,-0.03830000013113022,0.002300000051036477,0.019200000911951065,-0.048500001430511475,-0.024299999698996544,-0.04450000077486038]},{"ayah_id":"60:6","surah":60,"ayah":6,"arabic":"لَقَدْ كَانَ لَكُمْ فِيهِمْ أُسْوَةٌ حَسَنَةٌ لِّمَن كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الْآخِرَ ۚ وَمَن يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ","english":"Indeed, there is for you an excellent example in them (to follow), for him (in particular) who hopes (to appear before the presence of) Allah and looks forward to the Last Day. But whoever turns away, then Allah is Self-Sufficient and Praiseworthy.","vec_preview":[0.01140000019222498,0.03290000185370445,-0.02500000037252903,0.00139999995008111,0.03310000151395798,-0.04470000043511391,-0.013399999588727951,-0.024800000712275505]},{"ayah_id":"60:7","surah":60,"ayah":7,"arabic":"۞ عَسَى اللَّهُ أَن يَجْعَلَ بَيْنَكُمْ وَبَيْنَ الَّذِينَ عَادَيْتُم مِّنْهُم مَّوَدَّةً ۚ وَاللَّهُ قَدِيرٌ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ","english":"It may be that Allah brings about friendship (at a later stage) between you and those of them who are now your foes. And Allah is All-Powerful and Most Forgiving, Ever-Merciful.","vec_preview":[0.016899999231100082,0.02669999934732914,-0.027499999850988388,0.003800000064074993,0.03590000048279762,-0.03959999978542328,-0.027000000700354576,-0.03620000183582306]},{"ayah_id":"60:8","surah":60,"ayah":8,"arabic":"لَّا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ لَمْ يُقَاتِلُوكُمْ فِي الدِّينِ وَلَمْ يُخْرِجُوكُم مِّن دِيَارِكُمْ أَن تَبَرُّوهُمْ وَتُقْسِطُوا إِلَيْهِمْ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ","english":"Allah does not forbid you to be good to them and treat them with equity and justice who did not fight against you on (the question of) Din (Religion), nor did they drive you out of your homes (i.e., homeland). Surely, Allah likes those who conduct themselves with equity and justice.","vec_preview":[-0.013299999758601189,0.019899999722838402,-0.03669999912381172,-0.0066999997943639755,0.026399999856948853,-0.04820000007748604,-0.00839999970048666,-0.04050000011920929]},{"ayah_id":"60:9","surah":60,"ayah":9,"arabic":"إِنَّمَا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ قَاتَلُوكُمْ فِي الدِّينِ وَأَخْرَجُوكُم مِّن دِيَارِكُمْ وَظَاهَرُوا عَلَىٰ إِخْرَاجِكُمْ أَن تَوَلَّوْهُمْ ۚ وَمَن يَتَوَلَّهُمْ فَأُولَـٰئِكَ هُمُ الظَّالِمُونَ","english":"Allah only forbids you to befriend those who fought against you on (account of) the Din (Religion) and drove you out of your homes (i.e., homeland) and aided (your enemies) in expelling you. And whoever makes friends with them, it is they who are the wrongdoers.","vec_preview":[0.0035000001080334187,0.014600000344216824,-0.023499999195337296,0.004699999932199717,0.0364999994635582,-0.053599998354911804,-0.01119999960064888,-0.04280000180006027]},{"ayah_id":"60:10","surah":60,"ayah":10,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَامْتَحِنُوهُنَّ ۖ اللَّهُ أَعْلَمُ بِإِيمَانِهِنَّ ۖ فَإِنْ عَلِمْتُمُوهُنَّ مُؤْمِنَاتٍ فَلَا تَرْجِعُوهُنَّ إِلَى الْكُفَّارِ ۖ لَا هُنَّ حِلٌّ لَّهُمْ وَلَا هُمْ يَحِلُّونَ لَهُنَّ ۖ وَآتُوهُم مَّا أَنفَقُوا ۚ وَلَا جُنَاحَ عَلَيْكُمْ أَن تَنكِحُوهُنَّ إِذَا آتَيْتُمُوهُنَّ أُجُورَهُنَّ ۚ وَلَا تُمْسِكُوا بِعِصَمِ الْكَوَافِرِ وَاسْأَلُوا مَا أَنفَقْتُمْ وَلْيَسْأَلُوا مَا أَنفَقُوا ۚ ذَٰلِكُمْ حُكْمُ اللَّهِ ۖ يَحْكُمُ بَيْنَكُمْ ۚ وَاللَّهُ عَلِيمٌ حَكِيمٌ","english":"O believers! When the believing women come to you as Emigrants, examine them thoroughly. Allah is Well Aware of (the reality of) their faith. Then if you find with certitude that they are true believers, do not send them back to the disbelievers. Neither are they (the believing women) lawful for those disbelievers, nor are those disbelievers lawful for these (believing women). And pay them (the disbelievers) back the money which they spent (on them as dower). And there is no sin on you if you marry them whilst you pay these (women) their dower. And, O believers, do not hold back the disbelieving women in (your) wedlock, and ask (the disbelievers) for that (money) which you spent (on those women as dower), and they (the disbelievers) may also ask you for that (money) which they spent (on these women as dower). That is the command of Allah. And He judges between you. And Allah is All-Knowing, Most Wise.","vec_preview":[0.00800000037997961,0.019200000911951065,-0.04019999876618385,0.005100000184029341,0.039000000804662704,-0.045899998396635056,-0.02160000056028366,-0.04820000007748604]},{"ayah_id":"60:11","surah":60,"ayah":11,"arabic":"وَإِن فَاتَكُمْ شَيْءٌ مِّنْ أَزْوَاجِكُمْ إِلَى الْكُفَّارِ فَعَاقَبْتُمْ فَآتُوا الَّذِينَ ذَهَبَتْ أَزْوَاجُهُم مِّثْلَ مَا أَنفَقُوا ۚ وَاتَّقُوا اللَّهَ الَّذِي أَنتُم بِهِ مُؤْمِنُونَ","english":"And if any of your wives deserts you and goes over to the disbelievers, then (when) you become dominant in war and gain spoils, pay (out of it) those whose wives deserted them as much (money) as they paid (to them as dower). And keep fearing Allah in Whom you believe.","vec_preview":[0.006099999882280827,0.011800000444054604,-0.03680000081658363,0.004100000020116568,0.02449999935925007,-0.04600000008940697,-0.015699999406933784,-0.04820000007748604]},{"ayah_id":"60:12","surah":60,"ayah":12,"arabic":"يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلَىٰ أَن لَّا يُشْرِكْنَ بِاللَّهِ شَيْئًا وَلَا يَسْرِقْنَ وَلَا يَزْنِينَ وَلَا يَقْتُلْنَ أَوْلَادَهُنَّ وَلَا يَأْتِينَ بِبُهْتَانٍ يَفْتَرِينَهُ بَيْنَ أَيْدِيهِنَّ وَأَرْجُلِهِنَّ وَلَا يَعْصِينَكَ فِي مَعْرُوفٍ ۙ فَبَايِعْهُنَّ وَاسْتَغْفِرْ لَهُنَّ اللَّهَ ۖ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ","english":"O Prophet! When the believing women appear in your presence to take the oath of allegiance that they will not set up anything as partner with Allah and will not steal, nor will they commit adultery, or kill their children, or bring false blame which they have invented between their hands and feet (i.e., will not deceive their husbands declaring some other’s baby as their own), or disobey you in (any) matter pertaining to law, then accept their allegiance and seek forgiveness for them from Allah. Surely, Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.024000000208616257,0.01489999983459711,-0.03280000016093254,0.008100000210106373,0.03310000151395798,-0.0551999993622303,-0.020400000736117363,-0.05510000139474869]},{"ayah_id":"60:13","surah":60,"ayah":13,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ قَدْ يَئِسُوا مِنَ الْآخِرَةِ كَمَا يَئِسَ الْكُفَّارُ مِنْ أَصْحَابِ الْقُبُورِ","english":"O believers! Do not make friends with those on whom Allah has sent His wrath. Surely, they have despaired of the Hereafter as the disbelievers have despaired of those in graves.","vec_preview":[0.0038999998942017555,0.0024999999441206455,-0.03689999878406525,-0.008100000210106373,0.03929999843239784,-0.04600000008940697,-0.024399999529123306,-0.04340000078082085]}]