[{"ayah_id":"46:1","surah":46,"ayah":1,"arabic":"حم","english":"Ha-Mim. (Only Allah and the Messenger [blessings and peace be upon him] know the real meaning.)","vec_preview":[0.020099999383091927,0.03889999911189079,-0.026599999517202377,0.030899999663233757,0.008899999782443047,-0.024900000542402267,-0.017999999225139618,-0.004399999976158142]},{"ayah_id":"46:2","surah":46,"ayah":2,"arabic":"تَنزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ","english":"The revelation of this Book is from Allah, Almighty, Most Wise.","vec_preview":[0.00570000009611249,0.018699999898672104,-0.013100000098347664,-0.007600000128149986,0.007799999788403511,-0.011300000362098217,-0.01360000018030405,-0.045099999755620956]},{"ayah_id":"46:3","surah":46,"ayah":3,"arabic":"مَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ وَأَجَلٍ مُّسَمًّى ۚ وَالَّذِينَ كَفَرُوا عَمَّا أُنذِرُوا مُعْرِضُونَ","english":"We have not created the heavens and the earth and (the creation) that is between them but with wisdom and (the fixing of) an appointed term. And those who have disbelieved turn away from what they have been warned of.","vec_preview":[0.012000000104308128,0.00800000037997961,-0.02070000022649765,-0.008500000461935997,-0.00839999970048666,-0.03200000151991844,-0.0017000000225380063,-0.027799999341368675]},{"ayah_id":"46:4","surah":46,"ayah":4,"arabic":"قُلْ أَرَأَيْتُم مَّا تَدْعُونَ مِن دُونِ اللَّهِ أَرُونِي مَاذَا خَلَقُوا مِنَ الْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِي السَّمَاوَاتِ ۖ ائْتُونِي بِكِتَابٍ مِّن قَبْلِ هَـٰذَا أَوْ أَثَارَةٍ مِّنْ عِلْمٍ إِن كُنتُمْ صَادِقِينَ","english":"Say: ‘Tell me of the (idols) you worship instead of Allah; show me what they have created in the earth, or (bring it forth if) they have a partnership in (the creation of) the heavens. Bring me (as a proof) any Book (revealed) before this (Qur’an), or some remnant of knowledge (transmitted from the bygone people), if you are truthful.’","vec_preview":[0.005200000014156103,-0.0027000000700354576,-0.026799999177455902,-0.01510000042617321,0.0272000003606081,-0.02630000002682209,-0.018699999898672104,-0.039000000804662704]},{"ayah_id":"46:5","surah":46,"ayah":5,"arabic":"وَمَنْ أَضَلُّ مِمَّن يَدْعُو مِن دُونِ اللَّهِ مَن لَّا يَسْتَجِيبُ لَهُ إِلَىٰ يَوْمِ الْقِيَامَةِ وَهُمْ عَن دُعَائِهِمْ غَافِلُونَ","english":"And who can be more in error than someone who worships such (idols) apart from Allah as cannot answer (his question) till the Day of Resurrection? And those (idols) have no consciousness of their prayer and worship.","vec_preview":[-0.01119999960064888,0.013299999758601189,-0.02710000053048134,-0.007499999832361937,0.01679999940097332,-0.04170000180602074,-0.03229999914765358,-0.037700001150369644]},{"ayah_id":"46:6","surah":46,"ayah":6,"arabic":"وَإِذَا حُشِرَ النَّاسُ كَانُوا لَهُمْ أَعْدَاءً وَكَانُوا بِعِبَادَتِهِمْ كَافِرِينَ","english":"And when mankind shall be gathered (on the Day of Resurrection), those (false gods) will be their enemies and will deny their worship (for their own absolution).","vec_preview":[-0.010200000368058681,0.01979999989271164,-0.026200000196695328,0.0215000007301569,0.023800000548362732,-0.03240000084042549,-0.03020000085234642,-0.03269999846816063]},{"ayah_id":"46:7","surah":46,"ayah":7,"arabic":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ قَالَ الَّذِينَ كَفَرُوا لِلْحَقِّ لَمَّا جَاءَهُمْ هَـٰذَا سِحْرٌ مُّبِينٌ","english":"And when Our clear Verses are recited to them, (then) the disbelievers say about the truth (the Qur’an) whilst it has come to them: ‘This is obvious magic.’","vec_preview":[-0.0,0.004600000102072954,-0.03519999980926514,-0.011800000444054604,0.028200000524520874,-0.029400000348687172,-0.02810000069439411,-0.02889999933540821]},{"ayah_id":"46:8","surah":46,"ayah":8,"arabic":"أَمْ يَقُولُونَ افْتَرَاهُ ۖ قُلْ إِنِ افْتَرَيْتُهُ فَلَا تَمْلِكُونَ لِي مِنَ اللَّهِ شَيْئًا ۖ هُوَ أَعْلَمُ بِمَا تُفِيضُونَ فِيهِ ۖ كَفَىٰ بِهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ ۖ وَهُوَ الْغَفُورُ الرَّحِيمُ","english":"Do they say that (the Messenger) has fabricated it (the Qur’an)? Say: ‘If I have concocted it, then you have no authority to save me from (the torment of) Allah. And He knows best the (words) you utter about this (Qur’an) as mockery. He (Allah) is Sufficient as witness between me and you. And He is Most Forgiving, Ever-Merciful.’","vec_preview":[-0.004800000227987766,0.021299999207258224,-0.021400000900030136,-0.0071000000461936,0.03519999980926514,-0.029100000858306885,-0.026000000536441803,-0.03790000081062317]},{"ayah_id":"46:9","surah":46,"ayah":9,"arabic":"قُلْ مَا كُنتُ بِدْعًا مِّنَ الرُّسُلِ وَمَا أَدْرِي مَا يُفْعَلُ بِي وَلَا بِكُمْ ۖ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰ إِلَيَّ وَمَا أَنَا إِلَّا نَذِيرٌ مُّبِينٌ","english":"Say: ‘I am not the first Messenger (sent to mankind that no precedent of Messengership exists before me). Nor do I know of my own accord (i.e., purely by means of my own mental faculty and self-application) what will be done to me or what will be done to you. (My knowledge is nothing except that) I follow that revelation alone which is sent to me. (It is this that provides me knowledge about everything.) And I am simply a clear Warner (on the basis of this knowledge obtained through revelation).","vec_preview":[0.018799999728798866,-0.002300000051036477,-0.027300000190734863,-0.003800000064074993,0.03099999949336052,-0.0471000000834465,-0.03370000049471855,-0.049800001084804535]},{"ayah_id":"46:10","surah":46,"ayah":10,"arabic":"قُلْ أَرَأَيْتُمْ إِن كَانَ مِنْ عِندِ اللَّهِ وَكَفَرْتُم بِهِ وَشَهِدَ شَاهِدٌ مِّن بَنِي إِسْرَائِيلَ عَلَىٰ مِثْلِهِ فَآمَنَ وَاسْتَكْبَرْتُمْ ۖ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","english":"Say: ‘Tell me, if this (Qur’an) is from Allah and you deny it and a witness from the Children of Israel (also) bears testimony to the mention of (the revelation of) such a Book (in the Revealed Books revealed earlier), then he believes (in it as well), but (despite that) you show arrogance (then what will be your fate?) Surely, Allah does not guide the wrongdoing people.’","vec_preview":[-0.006800000090152025,0.004000000189989805,-0.012900000438094139,0.001500000013038516,0.045499999076128006,-0.04439999908208847,-0.014800000004470348,-0.02459999918937683]},{"ayah_id":"46:11","surah":46,"ayah":11,"arabic":"وَقَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا لَوْ كَانَ خَيْرًا مَّا سَبَقُونَا إِلَيْهِ ۚ وَإِذْ لَمْ يَهْتَدُوا بِهِ فَسَيَقُولُونَ هَـٰذَا إِفْكٌ قَدِيمٌ","english":"And the disbelievers said to the believers: ‘Had it (the Din of Muhammad [blessings and peace be upon him]) been a better (religion), these people would not have advanced towards it taking the lead over us. (We would have accepted it before anyone else.)’ And when they (the disbelievers) have not taken guidance from it (themselves), now they say: ‘This is an old lie (and a fabrication).’","vec_preview":[-0.0020000000949949026,-0.007199999876320362,-0.03400000184774399,0.004999999888241291,0.04129999876022339,-0.04580000042915344,-0.03720000013709068,-0.032600000500679016]},{"ayah_id":"46:12","surah":46,"ayah":12,"arabic":"وَمِن قَبْلِهِ كِتَابُ مُوسَىٰ إِمَامًا وَرَحْمَةً ۚ وَهَـٰذَا كِتَابٌ مُّصَدِّقٌ لِّسَانًا عَرَبِيًّا لِّيُنذِرَ الَّذِينَ ظَلَمُوا وَبُشْرَىٰ لِلْمُحْسِنِينَ","english":"And before it was the Book of Musa (Moses [the Torah]), a guide and mercy. And this Book confirms that. It is in the Arabic language to warn the wrongdoers and give good news to the pious.","vec_preview":[0.032099999487400055,0.01590000092983246,-0.0215000007301569,0.004399999976158142,0.017899999395012856,-0.031199999153614044,-0.041099999099969864,-0.03689999878406525]},{"ayah_id":"46:13","surah":46,"ayah":13,"arabic":"إِنَّ الَّذِينَ قَالُوا رَبُّنَا اللَّهُ ثُمَّ اسْتَقَامُوا فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ","english":"Surely, those who say: ‘Allah is our Lord,’ then hold fast (to it) have nothing to fear, nor shall they grieve.","vec_preview":[-0.0006000000284984708,0.009600000455975533,-0.05169999971985817,-0.014700000174343586,0.03790000081062317,-0.03519999980926514,-0.009100000374019146,-0.04600000008940697]},{"ayah_id":"46:14","surah":46,"ayah":14,"arabic":"أُولَـٰئِكَ أَصْحَابُ الْجَنَّةِ خَالِدِينَ فِيهَا جَزَاءً بِمَا كَانُوا يَعْمَلُونَ","english":"They it is, the people of Paradise, who will live in it forever. This is the reward of the deeds they used to do.","vec_preview":[0.010900000110268593,0.006000000052154064,-0.03610000014305115,-0.011500000022351742,0.006200000178068876,-0.02160000056028366,-0.0035000001080334187,-0.039799999445676804]},{"ayah_id":"46:15","surah":46,"ayah":15,"arabic":"وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ إِحْسَانًا ۖ حَمَلَتْهُ أُمُّهُ كُرْهًا وَوَضَعَتْهُ كُرْهًا ۖ وَحَمْلُهُ وَفِصَالُهُ ثَلَاثُونَ شَهْرًا ۚ حَتَّىٰ إِذَا بَلَغَ أَشُدَّهُ وَبَلَغَ أَرْبَعِينَ سَنَةً قَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ","english":"And We have commanded man to be benevolent towards his parents. His mother bears him (in the womb) with pain and gives birth to him with pain. And bearing him (in the womb) and weaning of him (i.e., the period of pregnancy and feeding) is (spread over) thirty months. Till, when he attains to manhood and then reaches (the age of) forty years, he says: ‘O my Lord, bestow on me the ability to give You thanks for the favour which You have done to me and my parents, and that I may do such deeds as may please You, and endow me and my children with virtue and piety. Assuredly I turn to You, and certainly I am of those who obey You in submissiveness.’","vec_preview":[0.019300000742077827,0.004100000020116568,-0.02590000070631504,0.006300000008195639,0.010400000028312206,-0.04490000009536743,-0.023900000378489494,-0.039000000804662704]},{"ayah_id":"46:16","surah":46,"ayah":16,"arabic":"أُولَـٰئِكَ الَّذِينَ نَتَقَبَّلُ عَنْهُمْ أَحْسَنَ مَا عَمِلُوا وَنَتَجَاوَزُ عَن سَيِّئَاتِهِمْ فِي أَصْحَابِ الْجَنَّةِ ۖ وَعْدَ الصِّدْقِ الَّذِي كَانُوا يُوعَدُونَ","english":"It is they whose good works We accept and overlook their omissions. (It is) they (who) are the people of Paradise. This is the true promise which is being made to them.","vec_preview":[0.0019000000320374966,0.007199999876320362,-0.034699998795986176,-0.00430000014603138,0.0017000000225380063,-0.032099999487400055,-0.023800000548362732,-0.04490000009536743]},{"ayah_id":"46:17","surah":46,"ayah":17,"arabic":"وَالَّذِي قَالَ لِوَالِدَيْهِ أُفٍّ لَّكُمَا أَتَعِدَانِنِي أَنْ أُخْرَجَ وَقَدْ خَلَتِ الْقُرُونُ مِن قَبْلِي وَهُمَا يَسْتَغِيثَانِ اللَّهَ وَيْلَكَ آمِنْ إِنَّ وَعْدَ اللَّهِ حَقٌّ فَيَقُولُ مَا هَـٰذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ","english":"And he who says to his parents: ‘Fie on you! Do you promise me that I shall be brought forth (from the grave and given life once more) when generations have passed away before me?’ Now both (the parents) pray to Allah for help (and say to the son:) ‘Woe to you, (O son!) Accept faith. Surely, Allah’s promise is true.’ But he says (in reply): ‘These (words) are nothing but the fiction of the bygone people.’","vec_preview":[0.007199999876320362,0.008299999870359898,-0.022299999371170998,-0.011699999682605267,0.024000000208616257,-0.04659999907016754,-0.021299999207258224,-0.059300001710653305]},{"ayah_id":"46:18","surah":46,"ayah":18,"arabic":"أُولَـٰئِكَ الَّذِينَ حَقَّ عَلَيْهِمُ الْقَوْلُ فِي أُمَمٍ قَدْ خَلَتْ مِن قَبْلِهِم مِّنَ الْجِنِّ وَالْإِنسِ ۖ إِنَّهُمْ كَانُوا خَاسِرِينَ","english":"It is they against whom the command of Allah’s (torment) has proved true amongst generations that have passed of the jinn as well as mankind. Surely, they (all) were the losers.","vec_preview":[0.011500000022351742,0.009700000286102295,-0.02590000070631504,0.01269999984651804,0.021299999207258224,-0.0364999994635582,-0.016100000590085983,-0.039900001138448715]},{"ayah_id":"46:19","surah":46,"ayah":19,"arabic":"وَلِكُلٍّ دَرَجَاتٌ مِّمَّا عَمِلُوا ۖ وَلِيُوَفِّيَهُمْ أَعْمَالَهُمْ وَهُمْ لَا يُظْلَمُونَ","english":"And the ranks (in Paradise and Hell) are allocated for all (separately) according to the (good and evil) deeds which they do, so that (Allah) pays them back in full for their actions and they will not be wronged at all.","vec_preview":[-0.002199999988079071,0.0035000001080334187,-0.051100000739097595,-0.0010999999940395355,0.009800000116229057,-0.0333000011742115,-0.02979999966919422,-0.031199999153614044]},{"ayah_id":"46:20","surah":46,"ayah":20,"arabic":"وَيَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ أَذْهَبْتُمْ طَيِّبَاتِكُمْ فِي حَيَاتِكُمُ الدُّنْيَا وَاسْتَمْتَعْتُم بِهَا فَالْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُونِ بِمَا كُنتُمْ تَسْتَكْبِرُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَبِمَا كُنتُمْ تَفْسُقُونَ","english":"And the Day when the disbelievers will be brought before the Fire of Hell (it will be said to them:) ‘You received your favourite and tasteful luxuries in the life of the world and exacted from them (maximum) benefit. So, Today you will be rewarded the punishment of humiliation because you lived on earth with arrogance unjustly and (also) because you used to disobey.’","vec_preview":[0.01549999974668026,0.029400000348687172,-0.03579999879002571,-0.0012000000569969416,0.017400000244379044,-0.04149999842047691,-0.0020000000949949026,-0.03830000013113022]},{"ayah_id":"46:21","surah":46,"ayah":21,"arabic":"۞ وَاذْكُرْ أَخَا عَادٍ إِذْ أَنذَرَ قَوْمَهُ بِالْأَحْقَافِ وَقَدْ خَلَتِ النُّذُرُ مِن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ أَلَّا تَعْبُدُوا إِلَّا اللَّهَ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ","english":"And, (O Beloved,) remember (Hud) the kinship brother of the people of ‘Ad, when he warned his people (of the dire consequences of their evil deeds) in al-Ahqaf, (the Sand-Dunes [a valley in Yemen, between Oman and Mahra]) although (a number of) Warners (i.e., Messengers) had passed before and after him, (saying:) ‘Worship no one but Allah. I fear for you the punishment of a (Terrible) Day.’","vec_preview":[0.024299999698996544,0.025100000202655792,-0.023499999195337296,-0.01209999993443489,0.02449999935925007,-0.032999999821186066,-0.012799999676644802,-0.05559999868273735]},{"ayah_id":"46:22","surah":46,"ayah":22,"arabic":"قَالُوا أَجِئْتَنَا لِتَأْفِكَنَا عَنْ آلِهَتِنَا فَأْتِنَا بِمَا تَعِدُنَا إِن كُنتَ مِنَ الصَّادِقِينَ","english":"They said: ‘Have you come to us to turn us away from our gods? So bring us that (torment) you are threatening us with if you are of those who speak the truth.’","vec_preview":[-0.007600000128149986,0.00559999980032444,-0.025200000032782555,-0.012500000186264515,0.017000000923871994,-0.011599999852478504,-0.01899999938905239,-0.05050000175833702]},{"ayah_id":"46:23","surah":46,"ayah":23,"arabic":"قَالَ إِنَّمَا الْعِلْمُ عِندَ اللَّهِ وَأُبَلِّغُكُم مَّا أُرْسِلْتُ بِهِ وَلَـٰكِنِّي أَرَاكُمْ قَوْمًا تَجْهَلُونَ","english":"He said: ‘The knowledge (of the Hour of the torment) is with Allah alone. And I am only transmitting to you the injunctions which I have been sent with. But I can see that you are an ignorant people.’","vec_preview":[0.0031999999191612005,0.010099999606609344,-0.021199999377131462,-0.013299999758601189,0.028999999165534973,-0.04529999941587448,-0.015799999237060547,-0.04149999842047691]},{"ayah_id":"46:24","surah":46,"ayah":24,"arabic":"فَلَمَّا رَأَوْهُ عَارِضًا مُّسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَـٰذَا عَارِضٌ مُّمْطِرُنَا ۚ بَلْ هُوَ مَا اسْتَعْجَلْتُم بِهِ ۖ رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ","english":"So when they saw that (torment) advancing on their valleys like a cloud, they said: ‘This is the cloud that is going to rain upon us.’ (Nay, not that,) rather this (cloud) is that (torment) which you were restlessly seeking to hasten. (This) is the storm in which is (approaching) a grievous punishment.","vec_preview":[-0.007899999618530273,0.024900000542402267,-0.03830000013113022,-0.0035000001080334187,0.03959999978542328,-0.05050000175833702,-0.012000000104308128,-0.03799999877810478]},{"ayah_id":"46:25","surah":46,"ayah":25,"arabic":"تُدَمِّرُ كُلَّ شَيْءٍ بِأَمْرِ رَبِّهَا فَأَصْبَحُوا لَا يُرَىٰ إِلَّا مَسَاكِنُهُمْ ۚ كَذَٰلِكَ نَجْزِي الْقَوْمَ الْمُجْرِمِينَ","english":"(That) will destroy everything by the command of its Lord. They were (destroyed) in such a way that nothing could be seen except their (ruined) houses. That is how We punish the evildoers.","vec_preview":[0.002199999988079071,0.019500000402331352,-0.0357000008225441,0.019899999722838402,0.007600000128149986,-0.03590000048279762,-0.019700000062584877,-0.03779999911785126]},{"ayah_id":"46:26","surah":46,"ayah":26,"arabic":"وَلَقَدْ مَكَّنَّاهُمْ فِيمَا إِن مَّكَّنَّاكُمْ فِيهِ وَجَعَلْنَا لَهُمْ سَمْعًا وَأَبْصَارًا وَأَفْئِدَةً فَمَا أَغْنَىٰ عَنْهُمْ سَمْعُهُمْ وَلَا أَبْصَارُهُمْ وَلَا أَفْئِدَتُهُم مِّن شَيْءٍ إِذْ كَانُوا يَجْحَدُونَ بِآيَاتِ اللَّهِ وَحَاقَ بِهِم مَّا كَانُوا بِهِ يَسْتَهْزِئُونَ","english":"(O people of Mecca!) In fact, We had given them power and ability in those fields of activity in which We have not granted you potential. And We blessed them with hearing and sight and (invaluable qualities of) head and heart. But neither their ears nor their eyes, nor their heads and hearts were of any use to them since they kept denying the signs of Allah. And (at last) that (torment) which they used to laugh at besieged them.","vec_preview":[-0.0052999998442828655,0.0215000007301569,-0.0364999994635582,-0.010400000028312206,0.023800000548362732,-0.029200000688433647,-0.01940000057220459,-0.03200000151991844]},{"ayah_id":"46:27","surah":46,"ayah":27,"arabic":"وَلَقَدْ أَهْلَكْنَا مَا حَوْلَكُم مِّنَ الْقُرَىٰ وَصَرَّفْنَا الْآيَاتِ لَعَلَّهُمْ يَرْجِعُونَ","english":"And, (O people of Mecca,) indeed We destroyed many a town around you, and displayed Our signs time and again so that they might turn (back to them from disbelief).","vec_preview":[0.024900000542402267,-0.01360000018030405,-0.03680000081658363,-0.008200000040233135,0.029400000348687172,-0.019200000911951065,-0.006599999964237213,-0.05620000138878822]},{"ayah_id":"46:28","surah":46,"ayah":28,"arabic":"فَلَوْلَا نَصَرَهُمُ الَّذِينَ اتَّخَذُوا مِن دُونِ اللَّهِ قُرْبَانًا آلِهَةً ۖ بَلْ ضَلُّوا عَنْهُمْ ۚ وَذَٰلِكَ إِفْكُهُمْ وَمَا كَانُوا يَفْتَرُونَ","english":"Then why did those (idols) not come to their aid, which they had taken as gods besides Allah for attaining (His) nearness? But in fact, they (false gods) were lost from them. And this (setting up false gods) was their lie. And (it was) this fabrication that they used to weave.","vec_preview":[-0.006000000052154064,0.02319999970495701,-0.02810000069439411,-0.012900000438094139,0.012400000356137753,-0.04610000178217888,-0.026499999687075615,-0.041999999433755875]},{"ayah_id":"46:29","surah":46,"ayah":29,"arabic":"وَإِذْ صَرَفْنَا إِلَيْكَ نَفَرًا مِّنَ الْجِنِّ يَسْتَمِعُونَ الْقُرْآنَ فَلَمَّا حَضَرُوهُ قَالُوا أَنصِتُوا ۖ فَلَمَّا قُضِيَ وَلَّوْا إِلَىٰ قَوْمِهِم مُّنذِرِينَ","english":"And, when, (O Beloved,) We diverted a group of jinn to you, listening to the Qur’an with active attention, (and) when they came there (i.e., before the holy presence of the Messenger [blessings and peace be upon him]), they said (to one another): ‘Keep silent.’ And when (the recitation) was over, they went back as warners to their people (i.e., the callers to the truth).","vec_preview":[0.004900000058114529,0.02019999921321869,-0.05869999900460243,-0.0019000000320374966,0.04410000145435333,-0.04360000044107437,-0.015200000256299973,-0.049800001084804535]},{"ayah_id":"46:30","surah":46,"ayah":30,"arabic":"قَالُوا يَا قَوْمَنَا إِنَّا سَمِعْنَا كِتَابًا أُنزِلَ مِن بَعْدِ مُوسَىٰ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ يَهْدِي إِلَى الْحَقِّ وَإِلَىٰ طَرِيقٍ مُّسْتَقِيمٍ","english":"They said: ‘O our people (O community of jinn), indeed we have heard such a Book that has been revealed after (the Torah of) Musa (Moses. It) confirms (the Books) that came before it, and guides to the true (Din [Religion]) and the straight road.","vec_preview":[0.016100000590085983,0.01209999993443489,-0.03020000085234642,-0.030899999663233757,0.02370000071823597,-0.031099999323487282,-0.024299999698996544,-0.041200000792741776]},{"ayah_id":"46:31","surah":46,"ayah":31,"arabic":"يَا قَوْمَنَا أَجِيبُوا دَاعِيَ اللَّهِ وَآمِنُوا بِهِ يَغْفِرْ لَكُم مِّن ذُنُوبِكُمْ وَيُجِرْكُم مِّنْ عَذَابٍ أَلِيمٍ","english":"O our people! Accept the call of the Caller (the Holy Prophet Muhammad [blessings and peace be upon him]) to Allah and believe in him. Allah will then forgive your sins and save you from a painful punishment.","vec_preview":[0.024800000712275505,0.011300000362098217,-0.026499999687075615,-0.010999999940395355,0.025200000032782555,-0.03799999877810478,-0.028200000524520874,-0.04089999943971634]},{"ayah_id":"46:32","surah":46,"ayah":32,"arabic":"وَمَن لَّا يُجِبْ دَاعِيَ اللَّهِ فَلَيْسَ بِمُعْجِزٍ فِي الْأَرْضِ وَلَيْسَ لَهُ مِن دُونِهِ أَوْلِيَاءُ ۚ أُولَـٰئِكَ فِي ضَلَالٍ مُّبِينٍ","english":"And he who does not accept the call of the Caller (the Holy Prophet Muhammad [blessings and peace be upon him]) to Allah cannot thwart Allah (by running away) on earth. Nor will there be any helpers for him except Allah. It is they who are in open error.’","vec_preview":[-0.006899999920278788,0.002400000113993883,-0.029999999329447746,0.010499999858438969,0.018400000408291817,-0.043800000101327896,-0.016499999910593033,-0.02419999986886978]},{"ayah_id":"46:33","surah":46,"ayah":33,"arabic":"أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَلَمْ يَعْيَ بِخَلْقِهِنَّ بِقَادِرٍ عَلَىٰ أَن يُحْيِيَ الْمَوْتَىٰ ۚ بَلَىٰ إِنَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","english":"Do they not know that Allah, Who created the heavens and the earth and was not tired by creating them, has (also) the power to bring the dead back to life (again)? Yes, of course, He has power over everything.","vec_preview":[0.004399999976158142,0.004800000227987766,-0.027300000190734863,-0.007699999958276749,0.0003000000142492354,-0.03889999911189079,-0.025499999523162842,-0.0333000011742115]},{"ayah_id":"46:34","surah":46,"ayah":34,"arabic":"وَيَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ أَلَيْسَ هَـٰذَا بِالْحَقِّ ۖ قَالُوا بَلَىٰ وَرَبِّنَا ۚ قَالَ فَذُوقُوا الْعَذَابَ بِمَا كُنتُمْ تَكْفُرُونَ","english":"And the Day when the disbelievers will be brought to the Fire (it will be said to them:) ‘Is this (punishment) not based on the truth?’ They will say: ‘Yes, of course! By our Lord (it is true).’ (Allah) will say: ‘Then taste the punishment you used to deny.’","vec_preview":[-0.005100000184029341,0.03240000084042549,-0.032999999821186066,0.0003000000142492354,0.02879999950528145,-0.03420000150799751,-0.015599999576807022,-0.04270000010728836]},{"ayah_id":"46:35","surah":46,"ayah":35,"arabic":"فَاصْبِرْ كَمَا صَبَرَ أُولُو الْعَزْمِ مِنَ الرُّسُلِ وَلَا تَسْتَعْجِل لَّهُمْ ۚ كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوا إِلَّا سَاعَةً مِّن نَّهَارٍ ۚ بَلَاغٌ ۚ فَهَلْ يُهْلَكُ إِلَّا الْقَوْمُ الْفَاسِقُونَ","english":"(O Beloved!) So be steadfast as (other) Messengers were with unwavering determination, and do not hasten (to seek the torment) for these (deniers). The Day they will see this (punishment in the Hereafter) which they are being promised, (they will think) as though they did not stay (in the world) for more than an hour. (This is but) the communication of the Message (from Allah). Those other than the disobedient will not be destroyed.","vec_preview":[0.006800000090152025,0.04650000110268593,-0.027300000190734863,-0.004900000058114529,0.037700001150369644,-0.04619999974966049,-0.0052999998442828655,-0.047600001096725464]}]