[{"ayah_id":"47:1","surah":47,"ayah":1,"arabic":"الَّذِينَ كَفَرُوا وَصَدُّوا عَن سَبِيلِ اللَّهِ أَضَلَّ أَعْمَالَهُمْ","english":"Those who disbelieve and hinder (others) from the way of Allah, Allah destroys their actions (as for their reward in the Hereafter).","vec_preview":[-0.014399999752640724,0.00430000014603138,-0.026599999517202377,-0.008200000040233135,0.01640000008046627,-0.028300000354647636,-0.01679999940097332,-0.024399999529123306]},{"ayah_id":"47:2","surah":47,"ayah":2,"arabic":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَآمَنُوا بِمَا نُزِّلَ عَلَىٰ مُحَمَّدٍ وَهُوَ الْحَقُّ مِن رَّبِّهِمْ ۙ كَفَّرَ عَنْهُمْ سَيِّئَاتِهِمْ وَأَصْلَحَ بَالَهُمْ","english":"And those who embrace faith and do pious works persistently and believe in this (Book) which has been revealed to Muhammad (blessings and peace be upon him), and that is the very truth from their Lord, Allah erases their evil works from their (record of deeds) and refines their states of being.","vec_preview":[0.005200000014156103,0.01640000008046627,-0.04729999974370003,-0.012600000016391277,0.021199999377131462,-0.05829999968409538,-0.019700000062584877,-0.025100000202655792]},{"ayah_id":"47:3","surah":47,"ayah":3,"arabic":"ذَٰلِكَ بِأَنَّ الَّذِينَ كَفَرُوا اتَّبَعُوا الْبَاطِلَ وَأَنَّ الَّذِينَ آمَنُوا اتَّبَعُوا الْحَقَّ مِن رَّبِّهِمْ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ لِلنَّاسِ أَمْثَالَهُمْ","english":"That is because those who disbelieve follow falsehood, and those who believe follow the truth (sent down) from their Lord. That is how Allah illustrates for people their states of being.","vec_preview":[0.003100000089034438,0.020500000566244125,-0.04039999842643738,-0.0006000000284984708,0.025699999183416367,-0.06599999964237213,-0.026399999856948853,-0.03139999881386757]},{"ayah_id":"47:4","surah":47,"ayah":4,"arabic":"فَإِذَا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَرْبَ الرِّقَابِ حَتَّىٰ إِذَا أَثْخَنتُمُوهُمْ فَشُدُّوا الْوَثَاقَ فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِدَاءً حَتَّىٰ تَضَعَ الْحَرْبُ أَوْزَارَهَا ۚ ذَٰلِكَ وَلَوْ يَشَاءُ اللَّهُ لَانتَصَرَ مِنْهُمْ وَلَـٰكِن لِّيَبْلُوَ بَعْضَكُم بِبَعْضٍ ۗ وَالَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ فَلَن يُضِلَّ أَعْمَالَهُمْ","english":"So when you are to fight (for the elimination of militancy and terrorism) against the (warring) disbelievers (in the battlefield), strike their necks (whilst fighting because they slaughtered harmless human lives and destroyed peace by their terrorist activities) till, when you have killed a good many of them (in the battle), then tie (the remaining prisoners) tightly. Thereafter, either set (them) free (without ransom) as a favour or (free them) for ransom (i.e., cost of freedom) till the warring (hostile army) lays down its weapons (i.e., announces the truce). That is (the command). And if Allah had willed, He would have avenged Himself on them (without war). But (He did not do so) in order to try some of you by means of others. And as for those who are slain in the way of Allah, He will not at all make their actions fruitless.","vec_preview":[0.004699999932199717,0.023900000378489494,-0.03240000084042549,0.007699999958276749,0.037300001829862595,-0.045499999076128006,-0.032600000500679016,-0.03889999911189079]},{"ayah_id":"47:5","surah":47,"ayah":5,"arabic":"سَيَهْدِيهِمْ وَيُصْلِحُ بَالَهُمْ","english":"He will soon put them on the straight path (of Paradise), and will greatly enhance their states of being (in the Hereafter).","vec_preview":[-0.0035000001080334187,0.041200000792741776,-0.03020000085234642,0.010400000028312206,0.026399999856948853,-0.006300000008195639,-0.001500000013038516,-0.04800000041723251]},{"ayah_id":"47:6","surah":47,"ayah":6,"arabic":"وَيُدْخِلُهُمُ الْجَنَّةَ عَرَّفَهَا لَهُمْ","english":"And He will (ultimately) admit them to Paradise which He has (already) made well known to them.","vec_preview":[0.0006000000284984708,0.001500000013038516,-0.030300000682473183,0.004900000058114529,-0.009600000455975533,-0.010599999688565731,0.007000000216066837,-0.05180000141263008]},{"ayah_id":"47:7","surah":47,"ayah":7,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِن تَنصُرُوا اللَّهَ يَنصُرْكُمْ وَيُثَبِّتْ أَقْدَامَكُمْ","english":"O believers! If you help (the Din [Religion] of) Allah, He will help you and will make your feet firm.","vec_preview":[0.009700000286102295,-0.0035000001080334187,-0.027699999511241913,-0.00930000003427267,0.04610000178217888,-0.030300000682473183,-0.020500000566244125,-0.04650000110268593]},{"ayah_id":"47:8","surah":47,"ayah":8,"arabic":"وَالَّذِينَ كَفَرُوا فَتَعْسًا لَّهُمْ وَأَضَلَّ أَعْمَالَهُمْ","english":"And those who disbelieve, for them is destruction and (Allah) has ruined their actions.","vec_preview":[-0.007300000172108412,0.0044999998062849045,-0.03799999877810478,0.011599999852478504,0.018400000408291817,-0.023499999195337296,-0.02590000070631504,-0.026599999517202377]},{"ayah_id":"47:9","surah":47,"ayah":9,"arabic":"ذَٰلِكَ بِأَنَّهُمْ كَرِهُوا مَا أَنزَلَ اللَّهُ فَأَحْبَطَ أَعْمَالَهُمْ","english":"That is because they hate that (Book) which Allah has sent down so He has made their actions come to nothing.","vec_preview":[-0.03669999912381172,0.0026000000070780516,-0.03189999982714653,-0.0044999998062849045,0.01590000092983246,-0.032099999487400055,-0.02800000086426735,-0.03550000116229057]},{"ayah_id":"47:10","surah":47,"ayah":10,"arabic":"۞ أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِن قَبْلِهِمْ ۚ دَمَّرَ اللَّهُ عَلَيْهِمْ ۖ وَلِلْكَافِرِينَ أَمْثَالُهَا","english":"Have they not travelled and toured in the earth so that they could see the fate of those who passed before them? Allah cast upon them total destruction. There are many such calamities awaiting the disbelievers.","vec_preview":[0.012600000016391277,0.012900000438094139,-0.04430000111460686,0.008700000122189522,0.025200000032782555,-0.03550000116229057,-0.02250000089406967,-0.027899999171495438]},{"ayah_id":"47:11","surah":47,"ayah":11,"arabic":"ذَٰلِكَ بِأَنَّ اللَّهَ مَوْلَى الَّذِينَ آمَنُوا وَأَنَّ الْكَافِرِينَ لَا مَوْلَىٰ لَهُمْ","english":"That is because Allah is the Protector and Helper of those who believe, and for sure the disbelievers do not have any protector and helper.","vec_preview":[-0.009399999864399433,-0.0031999999191612005,-0.030899999663233757,-0.008200000040233135,0.029100000858306885,-0.045499999076128006,-0.045099999755620956,-0.029999999329447746]},{"ayah_id":"47:12","surah":47,"ayah":12,"arabic":"إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۖ وَالَّذِينَ كَفَرُوا يَتَمَتَّعُونَ وَيَأْكُلُونَ كَمَا تَأْكُلُ الْأَنْعَامُ وَالنَّارُ مَثْوًى لَّهُمْ","english":"Surely, those who believe and do pious works, Allah will admit them to Gardens with streams flowing under them, and those who disbelieve and are enjoying (worldly) gains and eat as cattle (animals) do, so Hell alone will be their abode.","vec_preview":[0.014800000004470348,0.019099999219179153,-0.045099999755620956,0.020899999886751175,0.03440000116825104,-0.049300000071525574,-0.013700000010430813,-0.03889999911189079]},{"ayah_id":"47:13","surah":47,"ayah":13,"arabic":"وَكَأَيِّن مِّن قَرْيَةٍ هِيَ أَشَدُّ قُوَّةً مِّن قَرْيَتِكَ الَّتِي أَخْرَجَتْكَ أَهْلَكْنَاهُمْ فَلَا نَاصِرَ لَهُمْ","english":"And, (O Beloved,) how many a town have We destroyed whose citizens wielded greater power (i.e., resources and authority) than (the residents of) your city (Mecca) whose (powerful chiefs) have driven you out (by emigration)! We have destroyed them as well, and no one came to their help (who could save them).","vec_preview":[0.004800000227987766,0.004699999932199717,-0.013399999588727951,0.002400000113993883,0.010599999688565731,-0.027400000020861626,-0.02370000071823597,-0.03909999877214432]},{"ayah_id":"47:14","surah":47,"ayah":14,"arabic":"أَفَمَن كَانَ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّهِ كَمَن زُيِّنَ لَهُ سُوءُ عَمَلِهِ وَاتَّبَعُوا أَهْوَاءَهُم","english":"Is someone who is (firm) on the clear proof from his Lord like those whose evil actions are shown to them as fair and who follow the desires of their (ill-commanding) selves?","vec_preview":[0.012199999764561653,0.014299999922513962,-0.05169999971985817,0.010200000368058681,0.018799999728798866,-0.05260000005364418,-0.03530000150203705,-0.033399999141693115]},{"ayah_id":"47:15","surah":47,"ayah":15,"arabic":"مَّثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ ۖ فِيهَا أَنْهَارٌ مِّن مَّاءٍ غَيْرِ آسِنٍ وَأَنْهَارٌ مِّن لَّبَنٍ لَّمْ يَتَغَيَّرْ طَعْمُهُ وَأَنْهَارٌ مِّنْ خَمْرٍ لَّذَّةٍ لِّلشَّارِبِينَ وَأَنْهَارٌ مِّنْ عَسَلٍ مُّصَفًّى ۖ وَلَهُمْ فِيهَا مِن كُلِّ الثَّمَرَاتِ وَمَغْفِرَةٌ مِّن رَّبِّهِمْ ۖ كَمَنْ هُوَ خَالِدٌ فِي النَّارِ وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ","english":"A feature of the Paradise which is promised to the Godfearing is that therein are streams of (such) water as will never putrefy (in smell or colour), and (in it) will be streams of milk whose taste and flavour will never change, and streams of (such a pure) wine that is an absolute delight for all who drink it and streams of purified honey; and (in it) will be fruits of every kind (for them) and forgiveness (of every sort) from their Lord. Can this (pious man) be like those who are permanent residents of Hell and who will be given scalding water to drink which will cut their gut into pieces?","vec_preview":[0.0017999999690800905,0.0340999998152256,-0.043299999088048935,-0.008700000122189522,0.011599999852478504,-0.020899999886751175,-0.027499999850988388,-0.04129999876022339]},{"ayah_id":"47:16","surah":47,"ayah":16,"arabic":"وَمِنْهُم مَّن يَسْتَمِعُ إِلَيْكَ حَتَّىٰ إِذَا خَرَجُوا مِنْ عِندِكَ قَالُوا لِلَّذِينَ أُوتُوا الْعِلْمَ مَاذَا قَالَ آنِفًا ۚ أُولَـٰئِكَ الَّذِينَ طَبَعَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَاتَّبَعُوا أَهْوَاءَهُمْ","english":"And amongst them are those who give ears to you (without their heads and hearts in it) till, when they leave your presence and go (out), they ask those who have been given (profitable) knowledge: ‘What is it that he (the Messenger [blessings and peace be upon him]) said just now?’ It is they whose hearts Allah has sealed up and they are following their lusts.","vec_preview":[-0.010400000028312206,0.03480000048875809,-0.03269999846816063,-0.0003000000142492354,0.030799999833106995,-0.04670000076293945,-0.01549999974668026,-0.05130000039935112]},{"ayah_id":"47:17","surah":47,"ayah":17,"arabic":"وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ","english":"And as for those who have taken guidance, Allah increases their guidance and honours them with their station of Godwariness.","vec_preview":[0.0026000000070780516,0.027499999850988388,-0.03200000151991844,0.00039999998989515007,0.007799999788403511,-0.02889999933540821,-0.0284000001847744,-0.04149999842047691]},{"ayah_id":"47:18","surah":47,"ayah":18,"arabic":"فَهَلْ يَنظُرُونَ إِلَّا السَّاعَةَ أَن تَأْتِيَهُم بَغْتَةً ۖ فَقَدْ جَاءَ أَشْرَاطُهَا ۚ فَأَنَّىٰ لَهُمْ إِذَا جَاءَتْهُمْ ذِكْرَاهُمْ","english":"So are they (the deniers) now just waiting for the Last Hour to come upon them all of a sudden? Its signs have no doubt drawn (near). But what (good) will their admonition do to them when the Last Hour (itself) approaches?","vec_preview":[-0.009499999694526196,0.013899999670684338,-0.03849999979138374,0.013899999670684338,0.016200000420212746,-0.02759999968111515,-0.016599999740719795,-0.05689999833703041]},{"ayah_id":"47:19","surah":47,"ayah":19,"arabic":"فَاعْلَمْ أَنَّهُ لَا إِلَـٰهَ إِلَّا اللَّهُ وَاسْتَغْفِرْ لِذَنبِكَ وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ۗ وَاللَّهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوَاكُمْ","english":"Know then that there is no God except Allah and (to offer worship and to educate the Umma [Community]) always ask forgiveness (from Allah) lest an action unworthy of your incomparable station may come into occurrence.* And also seek forgiveness (i.e., intercede) for the believing men and women (for that is all they may have in balance for forgiveness). And, (O people,) Allah knows (all about) the places where you move about (in the world) and your mansions of repose (in the Hereafter).","vec_preview":[0.01119999960064888,0.01549999974668026,-0.02669999934732914,0.01080000028014183,0.02979999966919422,-0.04430000111460686,-0.011900000274181366,-0.044199999421834946]},{"ayah_id":"47:20","surah":47,"ayah":20,"arabic":"وَيَقُولُ الَّذِينَ آمَنُوا لَوْلَا نُزِّلَتْ سُورَةٌ ۖ فَإِذَا أُنزِلَتْ سُورَةٌ مُّحْكَمَةٌ وَذُكِرَ فِيهَا الْقِتَالُ ۙ رَأَيْتَ الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ يَنظُرُونَ إِلَيْكَ نَظَرَ الْمَغْشِيِّ عَلَيْهِ مِنَ الْمَوْتِ ۖ فَأَوْلَىٰ لَهُمْ","english":"And the believers say why a Sura (Chapter) is not revealed (about the command of defensive fighting). But when a clear Sura is revealed and (defensive) fighting for the cause of Allah is (plainly) mentioned in it, you see those who have the disease (of hypocrisy) in their hearts looking at you like someone who is fainting to death. So, for them is disaster.","vec_preview":[-0.00039999998989515007,0.03150000050663948,-0.020800000056624413,-0.009600000455975533,0.04969999939203262,-0.04560000076889992,-0.03420000150799751,-0.05889999866485596]},{"ayah_id":"47:21","surah":47,"ayah":21,"arabic":"طَاعَةٌ وَقَوْلٌ مَّعْرُوفٌ ۚ فَإِذَا عَزَمَ الْأَمْرُ فَلَوْ صَدَقُوا اللَّهَ لَكَانَ خَيْرًا لَّهُمْ","english":"(Best for them would be) obedience and good words. So when the command of fighting (for self-protection and self-defence) was definite (and firm), then if they had been true to Allah (in obedience and dedication), that would have been better for them.","vec_preview":[-0.0017999999690800905,0.02199999988079071,-0.03550000116229057,-0.0035000001080334187,0.041600000113248825,-0.023399999365210533,-0.02160000056028366,-0.042899999767541885]},{"ayah_id":"47:22","surah":47,"ayah":22,"arabic":"فَهَلْ عَسَيْتُمْ إِن تَوَلَّيْتُمْ أَن تُفْسِدُوا فِي الْأَرْضِ وَتُقَطِّعُوا أَرْحَامَكُمْ","english":"So, (O hypocrites,) what is expected of you is that if you (escape fighting by dodging and) attain to power, you will spread only mischief in the land and break your ties of kinship (which Allah and His Messenger [blessings and peace be upon him] have commanded to strengthen with affection and care).","vec_preview":[-0.009700000286102295,0.023499999195337296,-0.03269999846816063,0.023000000044703484,0.02419999986886978,-0.025299999862909317,-0.004100000020116568,-0.042100001126527786]},{"ayah_id":"47:23","surah":47,"ayah":23,"arabic":"أُولَـٰئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ فَأَصَمَّهُمْ وَأَعْمَىٰ أَبْصَارَهُمْ","english":"It is they whom Allah has cursed and made deaf (their ears) and blinded their eyes.","vec_preview":[0.00039999998989515007,0.009600000455975533,-0.025200000032782555,0.03060000017285347,0.019500000402331352,-0.031300000846385956,-0.021800000220537186,-0.0357000008225441]},{"ayah_id":"47:24","surah":47,"ayah":24,"arabic":"أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلَىٰ قُلُوبٍ أَقْفَالُهَا","english":"Do they not think over the Qur’an, or are their hearts locked?","vec_preview":[0.004100000020116568,0.023900000378489494,-0.015799999237060547,0.0038999998942017555,0.005900000222027302,-0.02329999953508377,-0.029200000688433647,-0.03009999915957451]},{"ayah_id":"47:25","surah":47,"ayah":25,"arabic":"إِنَّ الَّذِينَ ارْتَدُّوا عَلَىٰ أَدْبَارِهِم مِّن بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَى ۙ الشَّيْطَانُ سَوَّلَ لَهُمْ وَأَمْلَىٰ لَهُمْ","english":"Surely, those who turned back (to disbelief) after the guidance had become clear to them, Satan (by fraud) made (turning back to disbelief) look good to them and gave them false hope of living long (in the world).","vec_preview":[0.014299999922513962,0.009200000204145908,-0.02630000002682209,0.009399999864399433,0.030400000512599945,-0.03020000085234642,-0.02199999988079071,-0.045099999755620956]},{"ayah_id":"47:26","surah":47,"ayah":26,"arabic":"ذَٰلِكَ بِأَنَّهُمْ قَالُوا لِلَّذِينَ كَرِهُوا مَا نَزَّلَ اللَّهُ سَنُطِيعُكُمْ فِي بَعْضِ الْأَمْرِ ۖ وَاللَّهُ يَعْلَمُ إِسْرَارَهُمْ","english":"That is because they said to those who dislike the Book revealed by Allah: ‘We shall obey you in certain matters.’ And Allah knows best their secret consultations.","vec_preview":[-0.02800000086426735,0.008299999870359898,-0.0357000008225441,-0.0052999998442828655,0.028599999845027924,-0.03229999914765358,-0.013100000098347664,-0.04010000079870224]},{"ayah_id":"47:27","surah":47,"ayah":27,"arabic":"فَكَيْفَ إِذَا تَوَفَّتْهُمُ الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ","english":"Then what will be (their plight at the time) when the angels will snatch out their souls (this way) that they will be striking their faces and their backs?","vec_preview":[0.007499999832361937,0.027899999171495438,-0.01979999989271164,0.03629999980330467,0.03530000150203705,-0.01889999955892563,-0.026799999177455902,-0.052299998700618744]},{"ayah_id":"47:28","surah":47,"ayah":28,"arabic":"ذَٰلِكَ بِأَنَّهُمُ اتَّبَعُوا مَا أَسْخَطَ اللَّهَ وَكَرِهُوا رِضْوَانَهُ فَأَحْبَطَ أَعْمَالَهُمْ","english":"That is because they followed that (path) which displeases Allah and disliked His good pleasure; so He made (all) their actions null and void.","vec_preview":[-0.016300000250339508,0.012500000186264515,-0.03290000185370445,-0.0026000000070780516,0.009200000204145908,-0.029899999499320984,-0.03269999846816063,-0.039400000125169754]},{"ayah_id":"47:29","surah":47,"ayah":29,"arabic":"أَمْ حَسِبَ الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ أَن لَّن يُخْرِجَ اللَّهُ أَضْغَانَهُمْ","english":"Do those who have the disease (of hypocrisy) in their hearts think that Allah will never make known their malice and hostilities?","vec_preview":[-0.010200000368058681,0.011699999682605267,-0.012600000016391277,-0.0012000000569969416,0.0348999984562397,-0.03819999843835831,-0.03200000151991844,-0.03530000150203705]},{"ayah_id":"47:30","surah":47,"ayah":30,"arabic":"وَلَوْ نَشَاءُ لَأَرَيْنَاكَهُمْ فَلَعَرَفْتَهُم بِسِيمَاهُمْ ۚ وَلَتَعْرِفَنَّهُمْ فِي لَحْنِ الْقَوْلِ ۚ وَاللَّهُ يَعْلَمُ أَعْمَالَكُمْ","english":"And if We will, We can surely show these (hypocrites) to you (in such a manner) that you may recognize them by their facial expressions and (likewise) you may recognize them by their conversation style and Allah knows (best) all your actions.","vec_preview":[-0.012400000356137753,0.026200000196695328,-0.02759999968111515,0.02370000071823597,0.014800000004470348,-0.03840000182390213,-0.01119999960064888,-0.05130000039935112]},{"ayah_id":"47:31","surah":47,"ayah":31,"arabic":"وَلَنَبْلُوَنَّكُمْ حَتَّىٰ نَعْلَمَ الْمُجَاهِدِينَ مِنكُمْ وَالصَّابِرِينَ وَنَبْلُوَ أَخْبَارَكُمْ","english":"And We shall certainly try you till We bring to light those of you who strive hard and fight (firm-footed) and who observe patience and expose your (secret) news (of hypocritical cowardice) as well.","vec_preview":[0.0052999998442828655,0.023099999874830246,-0.031700000166893005,0.003800000064074993,0.03220000118017197,-0.02290000021457672,-0.01730000041425228,-0.045899998396635056]},{"ayah_id":"47:32","surah":47,"ayah":32,"arabic":"إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَن سَبِيلِ اللَّهِ وَشَاقُّوا الرَّسُولَ مِن بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَىٰ لَن يَضُرُّوا اللَّهَ شَيْئًا وَسَيُحْبِطُ أَعْمَالَهُمْ","english":"Indeed, those who disbelieved and hindered (the people) from the way of Allah and opposed the Messenger (blessings and peace be upon him), (and chose the path of breaking away from him,) after the guidance (i.e., the gnosis of the veneration of the Holy Messenger [blessings and peace be upon him]) had become clear to them, they would not be able to harm Allah anyway (i.e., would not be able to decrease the incomparable superiority and pre-eminence of the Messenger* [blessings and peace be upon him]). Allah will wreck (all) their works (due to their opposition to the Holy Messenger [blessings and peace be upon him]).","vec_preview":[-0.0015999999595806003,0.0010000000474974513,-0.04270000010728836,-0.002400000113993883,0.012299999594688416,-0.03590000048279762,-0.013100000098347664,-0.039900001138448715]},{"ayah_id":"47:33","surah":47,"ayah":33,"arabic":"۞ يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَلَا تُبْطِلُوا أَعْمَالَكُمْ","english":"O believers! Obey Allah and obey the Messenger (blessings and peace be upon him) and do not ruin your works.","vec_preview":[0.008500000461935997,-0.005499999970197678,-0.040300000458955765,-0.009800000116229057,0.03139999881386757,-0.0414000004529953,-0.023000000044703484,-0.04859999939799309]},{"ayah_id":"47:34","surah":47,"ayah":34,"arabic":"إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَن سَبِيلِ اللَّهِ ثُمَّ مَاتُوا وَهُمْ كُفَّارٌ فَلَن يَغْفِرَ اللَّهُ لَهُمْ","english":"Indeed, those who disbelieved and hindered (the people) from the way of Allah and then died as disbelievers, Allah will never forgive them.","vec_preview":[0.007300000172108412,0.004000000189989805,-0.032499998807907104,-0.007699999958276749,0.021199999377131462,-0.03629999980330467,-0.023000000044703484,-0.03720000013709068]},{"ayah_id":"47:35","surah":47,"ayah":35,"arabic":"فَلَا تَهِنُوا وَتَدْعُوا إِلَى السَّلْمِ وَأَنتُمُ الْأَعْلَوْنَ وَاللَّهُ مَعَكُمْ وَلَن يَتِرَكُمْ أَعْمَالَكُمْ","english":"(O believers!) Do not lose heart and do not ask (the warring disbelievers) for peace (lest it should suggest your weakness). And it is you who will have the upper hand. And Allah is with you, and He will never reduce (the reward of) your actions.","vec_preview":[-0.0027000000700354576,-0.004999999888241291,-0.047600001096725464,-0.003100000089034438,0.03669999912381172,-0.04430000111460686,-0.01140000019222498,-0.045499999076128006]},{"ayah_id":"47:36","surah":47,"ayah":36,"arabic":"إِنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ ۚ وَإِن تُؤْمِنُوا وَتَتَّقُوا يُؤْتِكُمْ أُجُورَكُمْ وَلَا يَسْأَلْكُمْ أَمْوَالَكُمْ","english":"Doubtlessly, the life of the world is nothing but merely a sport and pastime. And if you believe and adopt Godwariness, He will pay you the recompense (of your deeds in full), and will not require of you your wealth.","vec_preview":[0.019700000062584877,0.01940000057220459,-0.032999999821186066,-0.004699999932199717,0.014800000004470348,-0.039000000804662704,-0.012299999594688416,-0.04820000007748604]},{"ayah_id":"47:37","surah":47,"ayah":37,"arabic":"إِن يَسْأَلْكُمُوهَا فَيُحْفِكُمْ تَبْخَلُوا وَيُخْرِجْ أَضْغَانَكُمْ","english":"If He asks you for this wealth and puts you under scarcity for that, then you will feel constrained (at heart and) become miserly. And in this way, He will expose your (inner) rust (which results from worldly pursuits).","vec_preview":[0.007899999618530273,0.023900000378489494,-0.02889999933540821,0.030700000002980232,0.023399999365210533,-0.025299999862909317,-0.01269999984651804,-0.04919999837875366]},{"ayah_id":"47:38","surah":47,"ayah":38,"arabic":"هَا أَنتُمْ هَـٰؤُلَاءِ تُدْعَوْنَ لِتُنفِقُوا فِي سَبِيلِ اللَّهِ فَمِنكُم مَّن يَبْخَلُ ۖ وَمَن يَبْخَلْ فَإِنَّمَا يَبْخَلُ عَن نَّفْسِهِ ۚ وَاللَّهُ الْغَنِيُّ وَأَنتُمُ الْفُقَرَاءُ ۚ وَإِن تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُونُوا أَمْثَالَكُم","english":"Remember! You are those who are called to spend in the way of Allah. Then there are some of you who act miserly. And whoever acts miserly does it only against himself. And Allah is Independent and you (all) are dependent. And if you turn away from the command of Allah, He will replace you with another people who will not be like you.","vec_preview":[0.016599999740719795,0.021400000900030136,-0.01810000091791153,-0.008799999952316284,0.03759999945759773,-0.050700001418590546,-0.003700000001117587,-0.04500000178813934]}]