[{"ayah_id":"61:1","surah":61,"ayah":1,"arabic":"سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ","english":"Whatever is in the heavens and whatever is in the earth (all) glorify Allah. And He is the Lord of Honour and Dominance, Most Wise.","vec_preview":[0.00839999970048666,0.027899999171495438,-0.032499998807907104,0.005200000014156103,0.01209999993443489,-0.03280000016093254,-0.0008999999845400453,-0.021700000390410423]},{"ayah_id":"61:2","surah":61,"ayah":2,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ","english":"O believers! Why do you say what you do not do?","vec_preview":[0.0024999999441206455,0.008999999612569809,-0.0340999998152256,-0.019899999722838402,0.0414000004529953,-0.0333000011742115,-0.03830000013113022,-0.04769999906420708]},{"ayah_id":"61:3","surah":61,"ayah":3,"arabic":"كَبُرَ مَقْتًا عِندَ اللَّهِ أَن تَقُولُوا مَا لَا تَفْعَلُونَ","english":"It is most hateful in the sight of Allah that you should say what you do not do.","vec_preview":[-0.025699999183416367,-0.0010999999940395355,-0.0203000009059906,-0.003000000026077032,0.039900001138448715,-0.021800000220537186,-0.018699999898672104,-0.04989999905228615]},{"ayah_id":"61:4","surah":61,"ayah":4,"arabic":"إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُم بُنْيَانٌ مَّرْصُوصٌ","english":"Assuredly, Allah loves those who fight in the way of Allah (to eliminate tyranny and terrorism and restore peace and human dignity, so) organized in ranks as if they were a wall cemented with molten lead.","vec_preview":[-0.028300000354647636,-0.003000000026077032,-0.029500000178813934,-0.0052999998442828655,0.0430000014603138,-0.043699998408555984,-0.032499998807907104,-0.02759999968111515]},{"ayah_id":"61:5","surah":61,"ayah":5,"arabic":"وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ لِمَ تُؤْذُونَنِي وَقَد تَّعْلَمُونَ أَنِّي رَسُولُ اللَّهِ إِلَيْكُمْ ۖ فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ","english":"And, (O Beloved, recall) when Musa (Moses) said to his people: ‘O my people, why do you offend me whilst you know that I am (a Messenger) sent to you by Allah?’ So when they continued deviating, then Allah made their hearts deviate. And Allah does not guide the defiant.","vec_preview":[0.010099999606609344,-0.0024999999441206455,-0.019500000402331352,-0.011900000274181366,0.02710000053048134,-0.041600000113248825,-0.04619999974966049,-0.03370000049471855]},{"ayah_id":"61:6","surah":61,"ayah":6,"arabic":"وَإِذْ قَالَ عِيسَى ابْنُ مَرْيَمَ يَا بَنِي إِسْرَائِيلَ إِنِّي رَسُولُ اللَّهِ إِلَيْكُم مُّصَدِّقًا لِّمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَمُبَشِّرًا بِرَسُولٍ يَأْتِي مِن بَعْدِي اسْمُهُ أَحْمَدُ ۖ فَلَمَّا جَاءَهُم بِالْبَيِّنَاتِ قَالُوا هَـٰذَا سِحْرٌ مُّبِينٌ","english":"(And also recall) when ‘Isa, the son of Maryam (Jesus, the son of Mary) said: ‘O Children of Israel, indeed I am (a Messenger) sent to you by Allah, confirming the Torah, the Book which came before me, and bearing the good news of (the pleasant arrival) of (the Esteemed) Messenger (blessings and peace be upon him) who will come after me, whose name is Ahmad (now in the heavens).’ But when he (the Last of the Messengers) came to them with clear signs, they said: ‘This is open magic.’","vec_preview":[0.017000000923871994,0.011500000022351742,-0.02630000002682209,0.012900000438094139,0.01209999993443489,-0.03460000082850456,-0.01080000028014183,-0.030500000342726707]},{"ayah_id":"61:7","surah":61,"ayah":7,"arabic":"وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ الْكَذِبَ وَهُوَ يُدْعَىٰ إِلَى الْإِسْلَامِ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","english":"And who can be a greater wrongdoer than he who invents a lie against Allah whilst he is being invited towards Islam? And Allah does not guide the wrongdoers.","vec_preview":[-0.012299999594688416,-0.0027000000700354576,-0.0333000011742115,-0.00019999999494757503,0.02500000037252903,-0.041200000792741776,-0.04170000180602074,-0.032499998807907104]},{"ayah_id":"61:8","surah":61,"ayah":8,"arabic":"يُرِيدُونَ لِيُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَاللَّهُ مُتِمُّ نُورِهِ وَلَوْ كَرِهَ الْكَافِرُونَ","english":"These (deniers of the truth) desire to put out the Light of Allah by (blowing) with their mouths, whereas Allah will take His Light to perfection, even though the disbelievers may dislike it intensely.","vec_preview":[-0.03530000150203705,0.02459999918937683,-0.031700000166893005,0.0032999999821186066,0.019500000402331352,-0.054499998688697815,-0.02239999920129776,-0.03420000150799751]},{"ayah_id":"61:9","surah":61,"ayah":9,"arabic":"هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ","english":"He is the One Who has sent His Messenger with guidance and the Din (Religion) of truth so that He may make it dominate and prevail over all other religions, even though the idolaters may hate it much.","vec_preview":[0.010099999606609344,0.010999999940395355,-0.03680000081658363,-0.0024999999441206455,-0.011599999852478504,-0.027899999171495438,-0.026100000366568565,-0.03999999910593033]},{"ayah_id":"61:10","surah":61,"ayah":10,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا هَلْ أَدُلُّكُمْ عَلَىٰ تِجَارَةٍ تُنجِيكُم مِّنْ عَذَابٍ أَلِيمٍ","english":"O believers! Shall I advise you a trade which will save you from a painful torment?","vec_preview":[0.032499998807907104,0.021700000390410423,-0.03020000085234642,-9.999999747378752e-05,0.04470000043511391,-0.03440000116825104,-0.015399999916553497,-0.044199999421834946]},{"ayah_id":"61:11","surah":61,"ayah":11,"arabic":"تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِكُمْ وَأَنفُسِكُمْ ۚ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ","english":"(It is that) you have (perfect) belief in Allah and His Messenger (blessings and peace be upon him) and strive hard for the cause of Allah with your human and material resources. That is better for you if you know.","vec_preview":[0.012199999764561653,0.010099999606609344,-0.032099999487400055,-0.0034000000450760126,0.029200000688433647,-0.04430000111460686,-0.0008999999845400453,-0.05220000073313713]},{"ayah_id":"61:12","surah":61,"ayah":12,"arabic":"يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُدْخِلْكُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ","english":"He will forgive your sins and will admit you into Gardens with streams flowing under them, and (will make you reside) in excellent dwellings in the Gardens of Eden (i.e., Gardens of Eternity). That is indeed a great success.","vec_preview":[0.04769999906420708,0.02280000038444996,-0.03700000047683716,-0.001500000013038516,0.027899999171495438,-0.03460000082850456,-0.0010999999940395355,-0.04340000078082085]},{"ayah_id":"61:13","surah":61,"ayah":13,"arabic":"وَأُخْرَىٰ تُحِبُّونَهَا ۖ نَصْرٌ مِّنَ اللَّهِ وَفَتْحٌ قَرِيبٌ ۗ وَبَشِّرِ الْمُؤْمِنِينَ","english":"And, (besides this favour in the Hereafter, He will grant you) another (worldly blessing too) which you earnestly desire: (that is) help from Allah and a near victory, and, (O Esteemed Prophet,) give this good news to the believers. (This came about in the form of Meccan Victory and the conquests in Persia and Rome.)","vec_preview":[-0.010700000450015068,0.02590000070631504,-0.029100000858306885,0.005200000014156103,0.025800000876188278,-0.042399998754262924,-0.01489999983459711,-0.030400000512599945]},{"ayah_id":"61:14","surah":61,"ayah":14,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا أَنصَارَ اللَّهِ كَمَا قَالَ عِيسَى ابْنُ مَرْيَمَ لِلْحَوَارِيِّينَ مَنْ أَنصَارِي إِلَى اللَّهِ ۖ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنصَارُ اللَّهِ ۖ فَآمَنَت طَّائِفَةٌ مِّن بَنِي إِسْرَائِيلَ وَكَفَرَت طَّائِفَةٌ ۖ فَأَيَّدْنَا الَّذِينَ آمَنُوا عَلَىٰ عَدُوِّهِمْ فَأَصْبَحُوا ظَاهِرِينَ","english":"O believers! Be helpers of Allah as ‘Isa, the son of Maryam (Jesus, the son of Mary) said to (his) disciples: ‘Who are my helpers towards (the path of) Allah?’ The disciples said: ‘We are Allah’s helpers.’ So a party of the Children of Israel believed and a party disbelieved. So We helped the believers against their enemies and they gained the upper hand.","vec_preview":[0.0019000000320374966,0.013100000098347664,-0.015200000256299973,0.0017999999690800905,0.03400000184774399,-0.05350000038743019,-0.01889999955892563,-0.026499999687075615]}]