[{"ayah_id":"24:1","surah":24,"ayah":1,"arabic":"سُورَةٌ أَنزَلْنَاهَا وَفَرَضْنَاهَا وَأَنزَلْنَا فِيهَا آيَاتٍ بَيِّنَاتٍ لَّعَلَّكُمْ تَذَكَّرُونَ","english":"This is a (great) Sura (chapter) which We have revealed and We have made its (commandments) obligatory. And We have sent down in it clear Revelations so that you may take direction and guidance.","vec_preview":[0.003000000026077032,0.00430000014603138,-0.023900000378489494,-0.0008999999845400453,0.01489999983459711,-0.03819999843835831,-0.015300000086426735,-0.05299999937415123]},{"ayah_id":"24:2","surah":24,"ayah":2,"arabic":"الزَّانِيَةُ وَالزَّانِي فَاجْلِدُوا كُلَّ وَاحِدٍ مِّنْهُمَا مِائَةَ جَلْدَةٍ ۖ وَلَا تَأْخُذْكُم بِهِمَا رَأْفَةٌ فِي دِينِ اللَّهِ إِن كُنتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۖ وَلْيَشْهَدْ عَذَابَهُمَا طَائِفَةٌ مِّنَ الْمُؤْمِنِينَ","english":"Whip a hundred lashes each, the (unmarried) adulteress and the adulterer (on validation of adultery in accordance with the conditions of the statutory [hadd] punishment. If married, then both are to be stoned to death). And you should not feel even the slightest pity in Allah’s Din (Religion) for either of them (in executing the command), if you have faith in Allah and the Last Day. And a (sizeable) party of Muslims should be present on (the occasion of) award of punishment to both of them.","vec_preview":[0.012000000104308128,0.02500000037252903,-0.0284000001847744,-0.013299999758601189,0.042100001126527786,-0.03689999878406525,-0.008799999952316284,-0.03869999945163727]},{"ayah_id":"24:3","surah":24,"ayah":3,"arabic":"الزَّانِي لَا يَنكِحُ إِلَّا زَانِيَةً أَوْ مُشْرِكَةً وَالزَّانِيَةُ لَا يَنكِحُهَا إِلَّا زَانٍ أَوْ مُشْرِكٌ ۚ وَحُرِّمَ ذَٰلِكَ عَلَى الْمُؤْمِنِينَ","english":"An adulterer does not (like to) marry (a chaste and virtuous woman) but only an adulteress or a polytheist, and no (pious man likes to) marry an adulteress (too) but only an adulterer or a polytheist. And this act (i.e., adultery) has been forbidden to the Muslims.","vec_preview":[0.012400000356137753,0.030799999833106995,-0.025200000032782555,0.01769999973475933,0.029200000688433647,-0.037300001829862595,-0.014000000432133675,-0.04470000043511391]},{"ayah_id":"24:4","surah":24,"ayah":4,"arabic":"وَالَّذِينَ يَرْمُونَ الْمُحْصَنَاتِ ثُمَّ لَمْ يَأْتُوا بِأَرْبَعَةِ شُهَدَاءَ فَاجْلِدُوهُمْ ثَمَانِينَ جَلْدَةً وَلَا تَقْبَلُوا لَهُمْ شَهَادَةً أَبَدًا ۚ وَأُولَـٰئِكَ هُمُ الْفَاسِقُونَ","english":"And those who accuse chaste women (of adultery), then fail to produce four witnesses, whip them eighty lashes (as qadhaf—the punishment for false accusation of adultery) and never accept their evidence. And it is they who are the evildoers,","vec_preview":[0.004100000020116568,0.02239999920129776,-0.03319999948143959,-0.010700000450015068,0.04820000007748604,-0.05570000037550926,-0.017500000074505806,-0.04089999943971634]},{"ayah_id":"24:5","surah":24,"ayah":5,"arabic":"إِلَّا الَّذِينَ تَابُوا مِن بَعْدِ ذَٰلِكَ وَأَصْلَحُوا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ","english":"Except for those who repent after this (false blaming) and mend their ways. Then Allah is verily Most Forgiving, Ever-Merciful. (They will not be counted amongst the disobedient, but this will not exempt them from hadd al-qadhaf [the penalty for false accusation of adultery].)","vec_preview":[0.010400000028312206,0.01209999993443489,-0.0210999995470047,-0.013199999928474426,0.025499999523162842,-0.04659999907016754,-0.03220000118017197,-0.037300001829862595]},{"ayah_id":"24:6","surah":24,"ayah":6,"arabic":"وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ وَلَمْ يَكُن لَّهُمْ شُهَدَاءُ إِلَّا أَنفُسُهُمْ فَشَهَادَةُ أَحَدِهِمْ أَرْبَعُ شَهَادَاتٍ بِاللَّهِ ۙ إِنَّهُ لَمِنَ الصَّادِقِينَ","english":"And those who accuse their wives (of adultery) and have no witnesses except themselves, the testimony of such a person is to swear (himself) four times by Allah that he is truthful (in his accusation),","vec_preview":[0.006200000178068876,0.006500000134110451,-0.023800000548362732,-0.009200000204145908,0.049800001084804535,-0.042399998754262924,-0.030899999663233757,-0.031300000846385956]},{"ayah_id":"24:7","surah":24,"ayah":7,"arabic":"وَالْخَامِسَةُ أَنَّ لَعْنَتَ اللَّهِ عَلَيْهِ إِن كَانَ مِنَ الْكَاذِبِينَ","english":"And the fifth time (to say) that Allah’s curse be upon him if he is a liar.","vec_preview":[-0.004800000227987766,0.00559999980032444,-0.018300000578165054,-0.004999999888241291,0.04230000078678131,-0.041099999099969864,-0.03889999911189079,-0.05270000174641609]},{"ayah_id":"24:8","surah":24,"ayah":8,"arabic":"وَيَدْرَأُ عَنْهَا الْعَذَابَ أَن تَشْهَدَ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ ۙ إِنَّهُ لَمِنَ الْكَاذِبِينَ","english":"And (similarly) this can avert punishment from that (woman too) if she (herself) gives evidence, swearing four times by Allah that he (the husband) is a liar (in accusing her),","vec_preview":[0.008500000461935997,-0.007600000128149986,-0.017899999395012856,-0.0015999999595806003,0.050599999725818634,-0.03689999878406525,-0.022199999541044235,-0.031599998474121094]},{"ayah_id":"24:9","surah":24,"ayah":9,"arabic":"وَالْخَامِسَةَ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِن كَانَ مِنَ الصَّادِقِينَ","english":"And the fifth time (to say) that Allah’s wrath be upon her if he (the husband) is truthful.","vec_preview":[-0.014100000262260437,0.013899999670684338,-0.008700000122189522,-0.005499999970197678,0.033900000154972076,-0.027400000020861626,-0.02710000053048134,-0.056299999356269836]},{"ayah_id":"24:10","surah":24,"ayah":10,"arabic":"وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ وَأَنَّ اللَّهَ تَوَّابٌ حَكِيمٌ","english":"And had there not been Allah’s grace and mercy upon you, (then you would have been more perturbed under such circumstances) and Allah is surely Most Relenting, All-Wise.","vec_preview":[0.0005000000237487257,0.022099999710917473,-0.02800000086426735,0.010099999606609344,0.032499998807907104,-0.03880000114440918,-0.026900000870227814,-0.02759999968111515]},{"ayah_id":"24:11","surah":24,"ayah":11,"arabic":"إِنَّ الَّذِينَ جَاءُوا بِالْإِفْكِ عُصْبَةٌ مِّنكُمْ ۚ لَا تَحْسَبُوهُ شَرًّا لَّكُم ۖ بَلْ هُوَ خَيْرٌ لَّكُمْ ۚ لِكُلِّ امْرِئٍ مِّنْهُم مَّا اكْتَسَبَ مِنَ الْإِثْمِ ۚ وَالَّذِي تَوَلَّىٰ كِبْرَهُ مِنْهُمْ لَهُ عَذَابٌ عَظِيمٌ","english":"Surely those who fabricated the accusation (against ‘A’isha the truthful, the pure, the chaste—may Allah be well pleased with her) were (also) a party from amongst you. Do not consider this (slander account) as a bad thing for you. It has rather (turned out to be) good for you.* Every one of them has a share in the sin as much as he has earned it, but whoever has had a major share in this (false accusation), for him is a terrible torment.","vec_preview":[0.016699999570846558,0.03180000185966492,-0.045499999076128006,0.0031999999191612005,0.038600001484155655,-0.045499999076128006,-0.015399999916553497,-0.03909999877214432]},{"ayah_id":"24:12","surah":24,"ayah":12,"arabic":"لَّوْلَا إِذْ سَمِعْتُمُوهُ ظَنَّ الْمُؤْمِنُونَ وَالْمُؤْمِنَاتُ بِأَنفُسِهِمْ خَيْرًا وَقَالُوا هَـٰذَا إِفْكٌ مُّبِينٌ","english":"Why did it not happen that when you heard of it (the slander), the believers, both men and women, would think good of their own people and say: ‘This is obviously a fabricated accusation (based on falsehood)’?","vec_preview":[-0.008700000122189522,0.021299999207258224,-0.05339999869465828,0.00559999980032444,0.02590000070631504,-0.05040000006556511,-0.03869999945163727,-0.030400000512599945]},{"ayah_id":"24:13","surah":24,"ayah":13,"arabic":"لَّوْلَا جَاءُوا عَلَيْهِ بِأَرْبَعَةِ شُهَدَاءَ ۚ فَإِذْ لَمْ يَأْتُوا بِالشُّهَدَاءِ فَأُولَـٰئِكَ عِندَ اللَّهِ هُمُ الْكَاذِبُونَ","english":"Why did these (slanderers) not produce four witnesses to this (turmoil)? Since they could not bring forth witnesses, it is certainly they who are liars in the sight of Allah.","vec_preview":[-0.010099999606609344,0.016599999740719795,-0.01679999940097332,0.00019999999494757503,0.040300000458955765,-0.04149999842047691,-0.034299999475479126,-0.031599998474121094]},{"ayah_id":"24:14","surah":24,"ayah":14,"arabic":"وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ فِي الدُّنْيَا وَالْآخِرَةِ لَمَسَّكُمْ فِي مَا أَفَضْتُمْ فِيهِ عَذَابٌ عَظِيمٌ","english":"And had there not been Allah’s grace upon you and His mercy in this world and in the Hereafter, severe torment would have afflicted you for promoting that (slander) into which you rushed headlong.","vec_preview":[0.018699999898672104,0.027499999850988388,-0.01860000006854534,-0.0066999997943639755,0.022199999541044235,-0.054099999368190765,-0.004900000058114529,-0.025699999183416367]},{"ayah_id":"24:15","surah":24,"ayah":15,"arabic":"إِذْ تَلَقَّوْنَهُ بِأَلْسِنَتِكُمْ وَتَقُولُونَ بِأَفْوَاهِكُم مَّا لَيْسَ لَكُم بِهِ عِلْمٌ وَتَحْسَبُونَهُ هَيِّنًا وَهُوَ عِندَ اللَّهِ عَظِيمٌ","english":"When (hearing this matter from one another) you brought it on your tongues, and uttered with your mouths something about which you (yourselves) had no knowledge, and you took (the propagation of) this matter as inconsiderable, whereas in the presence of Allah it was a grave (offence underway).","vec_preview":[-0.00800000037997961,0.017999999225139618,-0.017999999225139618,-0.002099999925121665,0.03830000013113022,-0.0284000001847744,-0.004999999888241291,-0.03660000115633011]},{"ayah_id":"24:16","surah":24,"ayah":16,"arabic":"وَلَوْلَا إِذْ سَمِعْتُمُوهُ قُلْتُم مَّا يَكُونُ لَنَا أَن نَّتَكَلَّمَ بِهَـٰذَا سُبْحَانَكَ هَـٰذَا بُهْتَانٌ عَظِيمٌ","english":"And when you heard of this (heinous charge), why did you not declare (at the same moment): ‘It is not (at all justified) for us to talk about it’? (Rather you should have said: ‘O Allah,) Holy are You (High above making such a woman the beloved wife of Your Beloved and Esteemed Messenger [blessings and peace be upon him]). This is a grave charge.’","vec_preview":[-0.0007999999797903001,0.008299999870359898,-0.02370000071823597,0.0007999999797903001,0.03180000185966492,-0.03720000013709068,-0.036400001496076584,-0.03869999945163727]},{"ayah_id":"24:17","surah":24,"ayah":17,"arabic":"يَعِظُكُمُ اللَّهُ أَن تَعُودُوا لِمِثْلِهِ أَبَدًا إِن كُنتُم مُّؤْمِنِينَ","english":"Allah admonishes you to never repeat such a thing (in your lifetime) if you are believers.","vec_preview":[-0.010700000450015068,-0.008700000122189522,-0.035599999129772186,-0.010700000450015068,0.031099999323487282,-0.03849999979138374,-0.026599999517202377,-0.04729999974370003]},{"ayah_id":"24:18","surah":24,"ayah":18,"arabic":"وَيُبَيِّنُ اللَّهُ لَكُمُ الْآيَاتِ ۚ وَاللَّهُ عَلِيمٌ حَكِيمٌ","english":"And Allah explains to you the Revelations with utmost clarity. And Allah is All-Knowing, All-Wise.","vec_preview":[0.009700000286102295,0.022600000724196434,-0.02759999968111515,0.009100000374019146,0.03830000013113022,-0.026100000366568565,-0.023600000888109207,-0.03519999980926514]},{"ayah_id":"24:19","surah":24,"ayah":19,"arabic":"إِنَّ الَّذِينَ يُحِبُّونَ أَن تَشِيعَ الْفَاحِشَةُ فِي الَّذِينَ آمَنُوا لَهُمْ عَذَابٌ أَلِيمٌ فِي الدُّنْيَا وَالْآخِرَةِ ۚ وَاللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ","english":"Indeed, those who like that lewdness should spread amongst the Muslims, for them is an agonizing punishment in this world and in the Hereafter. And Allah knows (the intentions of such people) and you do not know.","vec_preview":[-0.002400000113993883,0.01590000092983246,-0.03840000182390213,0.007699999958276749,0.0340999998152256,-0.05400000140070915,-0.01979999989271164,-0.04500000178813934]},{"ayah_id":"24:20","surah":24,"ayah":20,"arabic":"وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ وَأَنَّ اللَّهَ رَءُوفٌ رَّحِيمٌ","english":"And had there not been Allah’s grace and His mercy upon you (for the sake of the Holy Prophet [blessings and peace be upon him], you too would have been destroyed like the former communities). But Allah is Most Clement, Ever-Merciful.","vec_preview":[0.005799999926239252,0.01860000006854534,-0.024800000712275505,0.00430000014603138,0.03189999982714653,-0.045499999076128006,-0.026200000196695328,-0.02930000051856041]},{"ayah_id":"24:21","surah":24,"ayah":21,"arabic":"۞ يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ ۚ وَمَن يَتَّبِعْ خُطُوَاتِ الشَّيْطَانِ فَإِنَّهُ يَأْمُرُ بِالْفَحْشَاءِ وَالْمُنكَرِ ۚ وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ مَا زَكَىٰ مِنكُم مِّنْ أَحَدٍ أَبَدًا وَلَـٰكِنَّ اللَّهَ يُزَكِّي مَن يَشَاءُ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ","english":"O believers! Do not follow the footsteps of Satan, and whoever follows the footsteps of Satan, then he (Satan) certainly commands to practise (and promotes) immorality and sinful deeds. And if there had not been Allah’s grace and His mercy upon you, then none of you would ever have been pure (of the stain of the sin of slander). But Allah purifies whom He wills and Allah is All-Hearing, All-Knowing.","vec_preview":[0.020099999383091927,0.014399999752640724,-0.031599998474121094,-9.999999747378752e-05,0.03099999949336052,-0.04270000010728836,-0.024000000208616257,-0.04600000008940697]},{"ayah_id":"24:22","surah":24,"ayah":22,"arabic":"وَلَا يَأْتَلِ أُولُو الْفَضْلِ مِنكُمْ وَالسَّعَةِ أَن يُؤْتُوا أُولِي الْقُرْبَىٰ وَالْمَسَاكِينَ وَالْمُهَاجِرِينَ فِي سَبِيلِ اللَّهِ ۖ وَلْيَعْفُوا وَلْيَصْفَحُوا ۗ أَلَا تُحِبُّونَ أَن يَغْفِرَ اللَّهُ لَكُمْ ۗ وَاللَّهُ غَفُورٌ رَّحِيمٌ","english":"And (now) those of you who are exalted (by way of the Din [Religion]) and are affluent (worldwise) must not swear that they will not provide (financial help) to the relatives, the needy and the Emigrants (who were involved in this offence of false accusation). They should forgive (their misconduct) and overlook (their mistake). Do you not like that Allah should forgive you? And Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.01360000018030405,0.020899999886751175,-0.03519999980926514,-0.003100000089034438,0.024700000882148743,-0.044199999421834946,-0.005100000184029341,-0.04729999974370003]},{"ayah_id":"24:23","surah":24,"ayah":23,"arabic":"إِنَّ الَّذِينَ يَرْمُونَ الْمُحْصَنَاتِ الْغَافِلَاتِ الْمُؤْمِنَاتِ لُعِنُوا فِي الدُّنْيَا وَالْآخِرَةِ وَلَهُمْ عَذَابٌ عَظِيمٌ","english":"Verily, those who falsely accuse chaste, believing women who are unaware of, and unacquainted (with, even the very idea of indecency and evil) are cursed in this world and in the Hereafter. And for them is woeful punishment,","vec_preview":[0.021800000220537186,0.028300000354647636,-0.03350000083446503,0.009200000204145908,0.04470000043511391,-0.05169999971985817,-0.008899999782443047,-0.040800001472234726]},{"ayah_id":"24:24","surah":24,"ayah":24,"arabic":"يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُم بِمَا كَانُوا يَعْمَلُونَ","english":"On the Day when their (own) tongues and their hands and their feet will bear witness against them for whatever they used to do,","vec_preview":[-0.013799999840557575,0.02889999933540821,-0.03700000047683716,-0.0003000000142492354,0.0357000008225441,-0.020500000566244125,-0.0013000000035390258,-0.03929999843239784]},{"ayah_id":"24:25","surah":24,"ayah":25,"arabic":"يَوْمَئِذٍ يُوَفِّيهِمُ اللَّهُ دِينَهُمُ الْحَقَّ وَيَعْلَمُونَ أَنَّ اللَّهَ هُوَ الْحَقُّ الْمُبِينُ","english":"On that Day, Allah will pay them full recompense that they truly deserve (for their deeds). And they will come to know that Allah is (Himself) the truth (and also) the Revealer (of the truth).","vec_preview":[-0.023900000378489494,0.028300000354647636,-0.029500000178813934,-0.002899999963119626,0.012799999676644802,-0.021900000050663948,-0.014499999582767487,-0.04320000112056732]},{"ayah_id":"24:26","surah":24,"ayah":26,"arabic":"الْخَبِيثَاتُ لِلْخَبِيثِينَ وَالْخَبِيثُونَ لِلْخَبِيثَاتِ ۖ وَالطَّيِّبَاتُ لِلطَّيِّبِينَ وَالطَّيِّبُونَ لِلطَّيِّبَاتِ ۚ أُولَـٰئِكَ مُبَرَّءُونَ مِمَّا يَقُولُونَ ۖ لَهُم مَّغْفِرَةٌ وَرِزْقٌ كَرِيمٌ","english":"Unclean women are (particular) for unclean men, while unclean men are meant for unclean women. And, (likewise,) clean and chaste women are (specific) to clean and pious men, whilst clean and pious men are exclusively for clean and chaste women. (So keeping in view the holiness, sanctity and purity of the Holy Prophet, you yourselves could imagine how pure, wholesome and chaste a wife Allah would have raised for him.) These (pure, innocent and pious people) are totally free from these (slanders), which these (foul-mouthed) people are levelling. Forgiveness and bestowal of honour and dignity have been (destined) for them. (Why do you ruin your life after death and earn disgrace and humiliation by denigrating his glory?)","vec_preview":[0.006200000178068876,0.019300000742077827,-0.05139999836683273,0.020400000736117363,0.033900000154972076,-0.031199999153614044,-0.019099999219179153,-0.0502999983727932]},{"ayah_id":"24:27","surah":24,"ayah":27,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتًا غَيْرَ بُيُوتِكُمْ حَتَّىٰ تَسْتَأْنِسُوا وَتُسَلِّمُوا عَلَىٰ أَهْلِهَا ۚ ذَٰلِكُمْ خَيْرٌ لَّكُمْ لَعَلَّكُمْ تَذَكَّرُونَ","english":"O believers! Do not enter houses other than your own until you obtain their permission. And greet their residents (immediately after you enter). This (advice) is better for you so that you may contemplate (its rationale).","vec_preview":[0.018799999728798866,0.007799999788403511,-0.04399999976158142,-0.005499999970197678,0.03680000081658363,-0.04500000178813934,-0.012299999594688416,-0.05660000070929527]},{"ayah_id":"24:28","surah":24,"ayah":28,"arabic":"فَإِن لَّمْ تَجِدُوا فِيهَا أَحَدًا فَلَا تَدْخُلُوهَا حَتَّىٰ يُؤْذَنَ لَكُمْ ۖ وَإِن قِيلَ لَكُمُ ارْجِعُوا فَارْجِعُوا ۖ هُوَ أَزْكَىٰ لَكُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ عَلِيمٌ","english":"Then, if you do not find anyone in these (houses), do not enter them until you are granted permission (for that). And if it is said to you: ‘Go back,’ then do go back. That is purer for you, and Allah is Well Aware of what you do.","vec_preview":[0.006599999964237213,0.011099999770522118,-0.04129999876022339,0.004000000189989805,0.04019999876618385,-0.03759999945759773,-0.002899999963119626,-0.05400000140070915]},{"ayah_id":"24:29","surah":24,"ayah":29,"arabic":"لَّيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَدْخُلُوا بُيُوتًا غَيْرَ مَسْكُونَةٍ فِيهَا مَتَاعٌ لَّكُمْ ۚ وَاللَّهُ يَعْلَمُ مَا تُبْدُونَ وَمَا تَكْتُمُونَ","english":"There is no sin on you if you enter (without permission) those houses (or buildings) which are not permanent residences (such as hotels, road-houses and inns). You have the right to get benefit therein. And Allah knows (all) that you disclose and that you conceal.","vec_preview":[-0.013899999670684338,0.00800000037997961,-0.028300000354647636,-0.0013000000035390258,0.02319999970495701,-0.033399999141693115,0.00559999980032444,-0.046799998730421066]},{"ayah_id":"24:30","surah":24,"ayah":30,"arabic":"قُل لِّلْمُؤْمِنِينَ يَغُضُّوا مِنْ أَبْصَارِهِمْ وَيَحْفَظُوا فُرُوجَهُمْ ۚ ذَٰلِكَ أَزْكَىٰ لَهُمْ ۗ إِنَّ اللَّهَ خَبِيرٌ بِمَا يَصْنَعُونَ","english":"Direct the believing men to keep their eyes always lowered and guard their private parts. That is purer for them. Surely, Allah is Well Aware of the (works) which they are busy doing.","vec_preview":[-0.006800000090152025,0.016499999910593033,-0.023900000378489494,-0.003599999938160181,0.06530000269412994,-0.02329999953508377,-0.012900000438094139,-0.04190000146627426]},{"ayah_id":"24:31","surah":24,"ayah":31,"arabic":"وَقُل لِّلْمُؤْمِنَاتِ يَغْضُضْنَ مِنْ أَبْصَارِهِنَّ وَيَحْفَظْنَ فُرُوجَهُنَّ وَلَا يُبْدِينَ زِينَتَهُنَّ إِلَّا مَا ظَهَرَ مِنْهَا ۖ وَلْيَضْرِبْنَ بِخُمُرِهِنَّ عَلَىٰ جُيُوبِهِنَّ ۖ وَلَا يُبْدِينَ زِينَتَهُنَّ إِلَّا لِبُعُولَتِهِنَّ أَوْ آبَائِهِنَّ أَوْ آبَاءِ بُعُولَتِهِنَّ أَوْ أَبْنَائِهِنَّ أَوْ أَبْنَاءِ بُعُولَتِهِنَّ أَوْ إِخْوَانِهِنَّ أَوْ بَنِي إِخْوَانِهِنَّ أَوْ بَنِي أَخَوَاتِهِنَّ أَوْ نِسَائِهِنَّ أَوْ مَا مَلَكَتْ أَيْمَانُهُنَّ أَوِ التَّابِعِينَ غَيْرِ أُولِي الْإِرْبَةِ مِنَ الرِّجَالِ أَوِ الطِّفْلِ الَّذِينَ لَمْ يَظْهَرُوا عَلَىٰ عَوْرَاتِ النِّسَاءِ ۖ وَلَا يَضْرِبْنَ بِأَرْجُلِهِنَّ لِيُعْلَمَ مَا يُخْفِينَ مِن زِينَتِهِنَّ ۚ وَتُوبُوا إِلَى اللَّهِ جَمِيعًا أَيُّهَ الْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ","english":"And direct the believing women that they (too) must keep their eyes lowered and guard their chastity, and must not show off their adornments and beautification except that (part of it) which becomes visible itself. And they must keep their veils (and head-coverings) drawn over their chests (too), and must not display their adornments (to anyone) except their husbands, or their fathers or the fathers of their husbands, or their sons or the sons of their husbands, or their brothers or the sons of their brothers or the sons of their sisters, or (the women of) their (own faith, the Muslim) women or their female slaves or such male servants as are free from any lust and sexual urge, or the children who (being minor) have (yet) no sense of women’s private parts. (They too are exceptions.) Nor must they (whilst walking) strike their feet (on the ground in such a manner that ornaments jingle and) thus get revealed and known what they are keeping hidden (under the command of Shariah). And turn to Allah, all of you, in repentance, O believers, so that you may prosper (by implementing these commandments).","vec_preview":[0.014600000344216824,0.01730000041425228,-0.0272000003606081,-0.0007999999797903001,0.05640000104904175,-0.03790000081062317,-0.021700000390410423,-0.05079999938607216]},{"ayah_id":"24:32","surah":24,"ayah":32,"arabic":"وَأَنكِحُوا الْأَيَامَىٰ مِنكُمْ وَالصَّالِحِينَ مِنْ عِبَادِكُمْ وَإِمَائِكُمْ ۚ إِن يَكُونُوا فُقَرَاءَ يُغْنِهِمُ اللَّهُ مِن فَضْلِهِ ۗ وَاللَّهُ وَاسِعٌ عَلِيمٌ","english":"And marry those of your men and women who are leading an unmarried life (despite reaching the age of marriage), and also (marry) those of your male and female slaves who are capable. If they are poor, Allah will make them rich out of His bounty and Allah is Most Infinite, All-Knowing.","vec_preview":[0.008200000040233135,0.03180000185966492,-0.031700000166893005,-0.001500000013038516,0.028699999675154686,-0.04569999873638153,-0.011699999682605267,-0.04019999876618385]},{"ayah_id":"24:33","surah":24,"ayah":33,"arabic":"وَلْيَسْتَعْفِفِ الَّذِينَ لَا يَجِدُونَ نِكَاحًا حَتَّىٰ يُغْنِيَهُمُ اللَّهُ مِن فَضْلِهِ ۗ وَالَّذِينَ يَبْتَغُونَ الْكِتَابَ مِمَّا مَلَكَتْ أَيْمَانُكُمْ فَكَاتِبُوهُمْ إِنْ عَلِمْتُمْ فِيهِمْ خَيْرًا ۖ وَآتُوهُم مِّن مَّالِ اللَّهِ الَّذِي آتَاكُمْ ۚ وَلَا تُكْرِهُوا فَتَيَاتِكُمْ عَلَى الْبِغَاءِ إِنْ أَرَدْنَ تَحَصُّنًا لِّتَبْتَغُوا عَرَضَ الْحَيَاةِ الدُّنْيَا ۚ وَمَن يُكْرِههُّنَّ فَإِنَّ اللَّهَ مِن بَعْدِ إِكْرَاهِهِنَّ غَفُورٌ رَّحِيمٌ","english":"And those who cannot afford marriage (for lack of financial means) should adopt chastity until Allah enriches them out of His bounty. And from amongst (the male and female slaves) under your control, those who seek to write out a deed (of manumission—freedom through earning and paying,) write it for them, and free them (under the given condition) if you see any good in them. Pay them (also yourselves) out of that wealth which Allah has given you (to help them get freedom). And do not force your maids into prostitution to obtain benefit of the worldly life if they desire to keep themselves chaste (or wish to safeguard their chastity through marriage). And whoever will compel them, then (even) after they are compelled, Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.0044999998062849045,0.023600000888109207,-0.032999999821186066,-0.003100000089034438,0.019600000232458115,-0.03180000185966492,-0.018699999898672104,-0.061500001698732376]},{"ayah_id":"24:34","surah":24,"ayah":34,"arabic":"وَلَقَدْ أَنزَلْنَا إِلَيْكُمْ آيَاتٍ مُّبَيِّنَاتٍ وَمَثَلًا مِّنَ الَّذِينَ خَلَوْا مِن قَبْلِكُمْ وَمَوْعِظَةً لِّلْمُتَّقِينَ","english":"And surely, We have sent down to you evident and enlightening Revelations and some examples of those who have passed away before you (i.e., like ‘A’isha’s story, the story of Maryam [Mary] and the story of Yusuf [Joseph]). And (this) is for the direction and guidance of the Godfearing.","vec_preview":[0.019300000742077827,-0.0013000000035390258,-0.02319999970495701,-0.01080000028014183,0.03290000185370445,-0.03830000013113022,-0.010300000198185444,-0.04800000041723251]},{"ayah_id":"24:35","surah":24,"ayah":35,"arabic":"۞ اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ ۚ مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ ۖ الْمِصْبَاحُ فِي زُجَاجَةٍ ۖ الزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ يُوقَدُ مِن شَجَرَةٍ مُّبَارَكَةٍ زَيْتُونَةٍ لَّا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ يَكَادُ زَيْتُهَا يُضِيءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ ۚ نُّورٌ عَلَىٰ نُورٍ ۗ يَهْدِي اللَّهُ لِنُورِهِ مَن يَشَاءُ ۚ وَيَضْرِبُ اللَّهُ الْأَمْثَالَ لِلنَّاسِ ۗ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ","english":"Allah is the Light of the heavens and the earth. The likeness of His Light (which is glowing in the world in the form of Muhammad’s Light [blessings and peace be upon him]) is as a niche-like (sacred breast) wherein is glowing the lamp (of Prophethood), the lamp contained in a crystal globe (the radiant heart of the Prophet Muhammad [blessings and peace be upon him]). This globe is (as dazzlingly bright owing to reflection of Allah’s Light) as a glittering star. (This lamp of Prophethood) is lit with the sacred olive tree (i.e., either due to the blissful communication of divine Revelation from the Realm of divinity, or owing to the blissful genealogical tree of the Prophets and the Messengers). It is neither (merely) eastern nor western (rather universal and cosmic in its generously infinite luminosity. The likeness of this lamp of Prophethood is as if) its oil (i.e., Light, due to its genuine and inherent potential capability) is glowing, though no fire (or the radiation of celestial miracles and divine Revelation) has even touched it yet. (So it) is Light upon Light (i.e., the Light of Prophethood upon the Light of the Holy Essence, denoting a Self-Embodying double Light). Allah takes to (the gnosis of) His Light whom He wills. And Allah explains similitudes for (the guidance of) people and Allah is Well Aware of everything.","vec_preview":[0.003700000001117587,0.030500000342726707,-0.009700000286102295,-0.005400000140070915,0.002899999963119626,-0.04019999876618385,-0.01720000058412552,-0.04259999841451645]},{"ayah_id":"24:36","surah":24,"ayah":36,"arabic":"فِي بُيُوتٍ أَذِنَ اللَّهُ أَن تُرْفَعَ وَيُذْكَرَ فِيهَا اسْمُهُ يُسَبِّحُ لَهُ فِيهَا بِالْغُدُوِّ وَالْآصَالِ","english":"(This Light of Allah illumines) such houses (mosques and centres) as Allah has ordained to exalt (i.e., enhance their esteem and honour) and remember His Name therein. (These are the houses) in which (Allah’s servants) glorify Him morning and evening.","vec_preview":[-0.000699999975040555,0.014800000004470348,-0.027799999341368675,0.002400000113993883,0.025699999183416367,-0.008500000461935997,-0.002199999988079071,-0.041200000792741776]},{"ayah_id":"24:37","surah":24,"ayah":37,"arabic":"رِجَالٌ لَّا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَن ذِكْرِ اللَّهِ وَإِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ ۙ يَخَافُونَ يَوْمًا تَتَقَلَّبُ فِيهِ الْقُلُوبُ وَالْأَبْصَارُ","english":"(Blessed with this Light) are those servants of (Allah) whom neither trade nor sale diverts from the remembrance of Allah and from establishing Prayer and paying Zakat (the Alms-due. Even whilst performing their worldly duties) they keep fearing the Day when hearts and eyes will (all) overturn (with terror),","vec_preview":[0.00930000003427267,0.02070000022649765,-0.028999999165534973,0.008500000461935997,0.04179999977350235,-0.011300000362098217,-0.020999999716877937,-0.033900000154972076]},{"ayah_id":"24:38","surah":24,"ayah":38,"arabic":"لِيَجْزِيَهُمُ اللَّهُ أَحْسَنَ مَا عَمِلُوا وَيَزِيدَهُم مِّن فَضْلِهِ ۗ وَاللَّهُ يَرْزُقُ مَن يَشَاءُ بِغَيْرِ حِسَابٍ","english":"So that Allah gives them the best reward for the (good) deeds they have done, and bestows upon them (still) more out of His bounty. And Allah blesses with sustenance (and provisions) without measure whom He wills.","vec_preview":[-0.01119999960064888,0.014299999922513962,-0.030500000342726707,-0.0005000000237487257,0.019999999552965164,-0.028599999845027924,-0.02319999970495701,-0.031300000846385956]},{"ayah_id":"24:39","surah":24,"ayah":39,"arabic":"وَالَّذِينَ كَفَرُوا أَعْمَالُهُمْ كَسَرَابٍ بِقِيعَةٍ يَحْسَبُهُ الظَّمْآنُ مَاءً حَتَّىٰ إِذَا جَاءَهُ لَمْ يَجِدْهُ شَيْئًا وَوَجَدَ اللَّهَ عِندَهُ فَوَفَّاهُ حِسَابَهُ ۗ وَاللَّهُ سَرِيعُ الْحِسَابِ","english":"And the deeds of the disbelievers are like a mirage in a vast barren field which the thirsty one deems to be water, until when he gets near it he finds it to be nothing. (Likewise, in the Hereafter) he will find Allah near him, but Allah fully paid him back (in the world). And Allah is Swift in taking account.","vec_preview":[-0.005900000222027302,0.024700000882148743,-0.04410000145435333,0.0010000000474974513,0.015200000256299973,-0.03519999980926514,-0.02199999988079071,-0.027799999341368675]},{"ayah_id":"24:40","surah":24,"ayah":40,"arabic":"أَوْ كَظُلُمَاتٍ فِي بَحْرٍ لُّجِّيٍّ يَغْشَاهُ مَوْجٌ مِّن فَوْقِهِ مَوْجٌ مِّن فَوْقِهِ سَحَابٌ ۚ ظُلُمَاتٌ بَعْضُهَا فَوْقَ بَعْضٍ إِذَا أَخْرَجَ يَدَهُ لَمْ يَكَدْ يَرَاهَا ۗ وَمَن لَّمْ يَجْعَلِ اللَّهُ لَهُ نُورًا فَمَا لَهُ مِن نُّورٍ","english":"Or (the disbelievers’ deeds are like) the darkness in a deep sea covered by a wave, rolled upon (yet) by another wave and above that are clouds. (This) darkness is (in layers) one over another. When (a person drowning into such a sea) stretches his hand out, no one can see it. And he for whom Allah has not formed any light (of guidance), for him there is no light (anywhere).","vec_preview":[-0.015399999916553497,0.019700000062584877,-0.014800000004470348,-0.014499999582767487,0.00800000037997961,-0.05490000173449516,-0.029899999499320984,-0.042100001126527786]},{"ayah_id":"24:41","surah":24,"ayah":41,"arabic":"أَلَمْ تَرَ أَنَّ اللَّهَ يُسَبِّحُ لَهُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ وَالطَّيْرُ صَافَّاتٍ ۖ كُلٌّ قَدْ عَلِمَ صَلَاتَهُ وَتَسْبِيحَهُ ۗ وَاللَّهُ عَلِيمٌ بِمَا يَفْعَلُونَ","english":"Have you not seen that (all) who are in the heavens and the earth glorify Allah alone, and the birds (too in the air around) with wings outspread (do celebrate His praise)? Each one knows his own mode of prayer and praise (before the presence of Allah). And Allah is Well Aware of the deeds they accomplish.","vec_preview":[0.021400000900030136,0.023900000378489494,-0.024399999529123306,0.004999999888241291,0.013399999588727951,-0.04089999943971634,-0.0003000000142492354,-0.03359999880194664]},{"ayah_id":"24:42","surah":24,"ayah":42,"arabic":"وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ وَإِلَى اللَّهِ الْمَصِيرُ","english":"And to Allah alone belongs the sovereignty of all the heavens and the earth and to Him will all return.","vec_preview":[0.005799999926239252,0.0027000000700354576,-0.03220000118017197,0.01140000019222498,0.0017000000225380063,-0.024299999698996544,-0.005200000014156103,-0.03530000150203705]},{"ayah_id":"24:43","surah":24,"ayah":43,"arabic":"أَلَمْ تَرَ أَنَّ اللَّهَ يُزْجِي سَحَابًا ثُمَّ يُؤَلِّفُ بَيْنَهُ ثُمَّ يَجْعَلُهُ رُكَامًا فَتَرَى الْوَدْقَ يَخْرُجُ مِنْ خِلَالِهِ وَيُنَزِّلُ مِنَ السَّمَاءِ مِن جِبَالٍ فِيهَا مِن بَرَدٍ فَيُصِيبُ بِهِ مَن يَشَاءُ وَيَصْرِفُهُ عَن مَّن يَشَاءُ ۖ يَكَادُ سَنَا بَرْقِهِ يَذْهَبُ بِالْأَبْصَارِ","english":"Have you not seen that Allah is the One Who drives the cloud (first) gently, then joins its (various pieces) together, and then forms them into layers upon layers? Then you see that from spaces between them rain issues forth and falls down. And He sends down hail from the clouds (looking) like snow-covered mountains in the same sky (i.e., atmosphere). And then He throws it down upon whom He wills and turns it away from whom He likes. (Moreover, He creates lightning from the same clouds.) It seems as if the flash of the lightning (of clouds) would (dazzle their eyes and) snatch their sight away.","vec_preview":[0.017000000923871994,0.026200000196695328,-0.017100000753998756,0.003800000064074993,0.026599999517202377,-0.020899999886751175,-0.012400000356137753,-0.02879999950528145]},{"ayah_id":"24:44","surah":24,"ayah":44,"arabic":"يُقَلِّبُ اللَّهُ اللَّيْلَ وَالنَّهَارَ ۚ إِنَّ فِي ذَٰلِكَ لَعِبْرَةً لِّأُولِي الْأَبْصَارِ","english":"(And) Allah turns about the night and the day (over each other). Surely, there is (great) guidance in it for those who have reason and insight.","vec_preview":[-0.0024999999441206455,0.0013000000035390258,-0.01269999984651804,0.006800000090152025,0.024800000712275505,-0.023600000888109207,-0.0035000001080334187,-0.05829999968409538]},{"ayah_id":"24:45","surah":24,"ayah":45,"arabic":"وَاللَّهُ خَلَقَ كُلَّ دَابَّةٍ مِّن مَّاءٍ ۖ فَمِنْهُم مَّن يَمْشِي عَلَىٰ بَطْنِهِ وَمِنْهُم مَّن يَمْشِي عَلَىٰ رِجْلَيْنِ وَمِنْهُم مَّن يَمْشِي عَلَىٰ أَرْبَعٍ ۚ يَخْلُقُ اللَّهُ مَا يَشَاءُ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","english":"And Allah has originated (the chemical genesis of) every moving creature from water. So, some of them creep on their bellies, some walk on two feet and some others on four. Allah creates what He wills. Surely, Allah has absolute power over everything.","vec_preview":[0.01119999960064888,0.027799999341368675,-0.031199999153614044,-0.00019999999494757503,0.027400000020861626,-0.02979999966919422,-0.02280000038444996,-0.03290000185370445]},{"ayah_id":"24:46","surah":24,"ayah":46,"arabic":"لَّقَدْ أَنزَلْنَا آيَاتٍ مُّبَيِّنَاتٍ ۚ وَاللَّهُ يَهْدِي مَن يَشَاءُ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ","english":"We have indeed sent down clear and enlightening Revelations (through which) Allah guides whom He wills to the straight path.","vec_preview":[-0.005400000140070915,0.007899999618530273,-0.012400000356137753,0.005900000222027302,0.014800000004470348,-0.030700000002980232,-0.01759999990463257,-0.01640000008046627]},{"ayah_id":"24:47","surah":24,"ayah":47,"arabic":"وَيَقُولُونَ آمَنَّا بِاللَّهِ وَبِالرَّسُولِ وَأَطَعْنَا ثُمَّ يَتَوَلَّىٰ فَرِيقٌ مِّنْهُم مِّن بَعْدِ ذَٰلِكَ ۚ وَمَا أُولَـٰئِكَ بِالْمُؤْمِنِينَ","english":"And they say: ‘We have believed in Allah and the Messenger and we obey.’ Then, after (saying) this, a group of them turn away (from their affirmation). And (in fact) these people are not (at all) believers.","vec_preview":[0.01489999983459711,-0.0007999999797903001,-0.040699999779462814,-0.015699999406933784,0.04989999905228615,-0.021199999377131462,-0.00930000003427267,-0.05180000141263008]},{"ayah_id":"24:48","surah":24,"ayah":48,"arabic":"وَإِذَا دُعُوا إِلَى اللَّهِ وَرَسُولِهِ لِيَحْكُمَ بَيْنَهُمْ إِذَا فَرِيقٌ مِّنْهُم مُّعْرِضُونَ","english":"And when they are called to Allah and His Messenger (blessings and peace be upon him) that he may judge between them, a party of them turn away (from appearing before the Messenger [blessings and peace be upon him]).","vec_preview":[-0.0020000000949949026,-0.0008999999845400453,-0.02800000086426735,0.0019000000320374966,0.019300000742077827,-0.026900000870227814,-0.015300000086426735,-0.03909999877214432]},{"ayah_id":"24:49","surah":24,"ayah":49,"arabic":"وَإِن يَكُن لَّهُمُ الْحَقُّ يَأْتُوا إِلَيْهِ مُذْعِنِينَ","english":"And had they been in the right, they would have come fast to him (the Messenger [blessings and peace be upon him]) most submissively.","vec_preview":[-0.00430000014603138,0.025299999862909317,-0.02500000037252903,-0.007699999958276749,0.028300000354647636,-0.008799999952316284,-0.030700000002980232,-0.040300000458955765]},{"ayah_id":"24:50","surah":24,"ayah":50,"arabic":"أَفِي قُلُوبِهِم مَّرَضٌ أَمِ ارْتَابُوا أَمْ يَخَافُونَ أَن يَحِيفَ اللَّهُ عَلَيْهِمْ وَرَسُولُهُ ۚ بَلْ أُولَـٰئِكَ هُمُ الظَّالِمُونَ","english":"Is there a disease (of hypocrisy) in their hearts? Or do they doubt (the majesty and glory of the Messenger)? Or do they fear that Allah and His Messenger (blessings and peace be upon him) will do them wrong? (Nay,) they themselves are the wrongdoers.","vec_preview":[0.004600000102072954,0.012600000016391277,-0.028200000524520874,0.006300000008195639,0.03319999948143959,-0.053700000047683716,-0.02539999969303608,-0.03779999911785126]},{"ayah_id":"24:51","surah":24,"ayah":51,"arabic":"إِنَّمَا كَانَ قَوْلَ الْمُؤْمِنِينَ إِذَا دُعُوا إِلَى اللَّهِ وَرَسُولِهِ لِيَحْكُمَ بَيْنَهُمْ أَن يَقُولُوا سَمِعْنَا وَأَطَعْنَا ۚ وَأُولَـٰئِكَ هُمُ الْمُفْلِحُونَ","english":"The only saying of the believers, when they are called to Allah and His Messenger (blessings and peace be upon him) in order that he may judge between them, is that they say: ‘We have heard and we (totally) submit to obey.’ It is they who will prosper.","vec_preview":[-0.0005000000237487257,0.017400000244379044,-0.0414000004529953,0.009600000455975533,0.022600000724196434,-0.05869999900460243,-0.012500000186264515,-0.03739999979734421]},{"ayah_id":"24:52","surah":24,"ayah":52,"arabic":"وَمَن يُطِعِ اللَّهَ وَرَسُولَهُ وَيَخْشَ اللَّهَ وَيَتَّقْهِ فَأُولَـٰئِكَ هُمُ الْفَائِزُونَ","english":"And whoever obeys Allah and His Messenger (blessings and peace be upon him) and fears Allah and adopts Godwariness for Him, it is they who will achieve their goal.","vec_preview":[0.004800000227987766,0.007199999876320362,-0.035100001841783524,0.024900000542402267,0.023800000548362732,-0.04600000008940697,-0.011699999682605267,-0.03460000082850456]},{"ayah_id":"24:53","surah":24,"ayah":53,"arabic":"۞ وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لَئِنْ أَمَرْتَهُمْ لَيَخْرُجُنَّ ۖ قُل لَّا تُقْسِمُوا ۖ طَاعَةٌ مَّعْرُوفَةٌ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ","english":"And they swear most strongly (and solemnly) by Allah that if you order them, they will certainly set out (for jihad [the sacred struggle for the establishment of peace and human rights]). Say: ‘Do not swear. It is obedience that is (required) as per law. Allah is certainly Well Aware of the deeds you do.’","vec_preview":[-0.01730000041425228,0.0044999998062849045,-0.025699999183416367,-0.009999999776482582,0.05260000005364418,-0.026000000536441803,-0.014999999664723873,-0.0568000003695488]},{"ayah_id":"24:54","surah":24,"ayah":54,"arabic":"قُلْ أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ ۖ فَإِن تَوَلَّوْا فَإِنَّمَا عَلَيْهِ مَا حُمِّلَ وَعَلَيْكُم مَّا حُمِّلْتُمْ ۖ وَإِن تُطِيعُوهُ تَهْتَدُوا ۚ وَمَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ الْمُبِينُ","english":"Say: ‘Obey Allah and His Messenger (blessings and peace be upon him), but if you turn away (from obedience), then (beware that) the Messenger (blessings and peace be upon him) is simply responsible for the duty he is charged with, and you are responsible for what you are charged with. And if you obey him, you will be guided. And nothing is (obligatory) for the Messenger (blessings and peace be upon him) but to convey (the commands) clearly.’","vec_preview":[0.016100000590085983,0.019899999722838402,-0.027400000020861626,0.002199999988079071,0.02449999935925007,-0.043299999088048935,-0.013000000268220901,-0.05220000073313713]},{"ayah_id":"24:55","surah":24,"ayah":55,"arabic":"وَعَدَ اللَّهُ الَّذِينَ آمَنُوا مِنكُمْ وَعَمِلُوا الصَّالِحَاتِ لَيَسْتَخْلِفَنَّهُمْ فِي الْأَرْضِ كَمَا اسْتَخْلَفَ الَّذِينَ مِن قَبْلِهِمْ وَلَيُمَكِّنَنَّ لَهُمْ دِينَهُمُ الَّذِي ارْتَضَىٰ لَهُمْ وَلَيُبَدِّلَنَّهُم مِّن بَعْدِ خَوْفِهِمْ أَمْنًا ۚ يَعْبُدُونَنِي لَا يُشْرِكُونَ بِي شَيْئًا ۚ وَمَن كَفَرَ بَعْدَ ذَٰلِكَ فَأُولَـٰئِكَ هُمُ الْفَاسِقُونَ","english":"To those of you who believe and keep doing pious deeds Allah has given the promise (whose fulfilment and implementation is obligatory for the Umma [Community]): He will surely bestow upon them khilafa (the trust of right to rule) as He granted (the right to) rule to those who were before them. And (through dominance and rule) He will strengthen and stabilize their Din (Religion) for them which He has liked for them, and (by this strength and rule) He will for sure change their former state of fear (which was due to their political, economic and social handicap) to that of peace and security. They will worship Me (fearlessly and) will not associate any partner with Me (i.e., will follow and obey only My command and system). And after this, whoever adopts ingratitude (i.e., aversion to, and denial of, My commands) it is they who will be defiant (and disobedient).","vec_preview":[0.001500000013038516,0.024700000882148743,-0.04259999841451645,-0.021400000900030136,0.03720000013709068,-0.047600001096725464,-0.03460000082850456,-0.038600001484155655]},{"ayah_id":"24:56","surah":24,"ayah":56,"arabic":"وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَطِيعُوا الرَّسُولَ لَعَلَّكُمْ تُرْحَمُونَ","english":"And establish (the system of) prayers and (ensure) the payment of Zakat (the Alms-due) and accomplish (absolute) obedience to the Messenger (blessings and peace be upon him) so that you may be granted mercy (i.e., the blessings of sovereign rule, stability, peace and security may endure and continue).","vec_preview":[0.023399999365210533,0.01810000091791153,-0.034699998795986176,-0.000699999975040555,0.022099999710917473,-0.018300000578165054,-0.010499999858438969,-0.04899999871850014]},{"ayah_id":"24:57","surah":24,"ayah":57,"arabic":"لَا تَحْسَبَنَّ الَّذِينَ كَفَرُوا مُعْجِزِينَ فِي الْأَرْضِ ۚ وَمَأْوَاهُمُ النَّارُ ۖ وَلَبِئْسَ الْمَصِيرُ","english":"And let it not occur to you at all that those who disbelieve and are ungrateful will make (Allah) powerless (to destroy them) in the earth. And Hell is their abode and the worst is that abode.","vec_preview":[0.00019999999494757503,0.01140000019222498,-0.05249999836087227,-0.010300000198185444,0.03739999979734421,-0.03519999980926514,-0.0203000009059906,-0.033900000154972076]},{"ayah_id":"24:58","surah":24,"ayah":58,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لِيَسْتَأْذِنكُمُ الَّذِينَ مَلَكَتْ أَيْمَانُكُمْ وَالَّذِينَ لَمْ يَبْلُغُوا الْحُلُمَ مِنكُمْ ثَلَاثَ مَرَّاتٍ ۚ مِّن قَبْلِ صَلَاةِ الْفَجْرِ وَحِينَ تَضَعُونَ ثِيَابَكُم مِّنَ الظَّهِيرَةِ وَمِن بَعْدِ صَلَاةِ الْعِشَاءِ ۚ ثَلَاثُ عَوْرَاتٍ لَّكُمْ ۚ لَيْسَ عَلَيْكُمْ وَلَا عَلَيْهِمْ جُنَاحٌ بَعْدَهُنَّ ۚ طَوَّافُونَ عَلَيْكُم بَعْضُكُمْ عَلَىٰ بَعْضٍ ۚ كَذَٰلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الْآيَاتِ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","english":"O believers! Your (male and female) slaves and your children who have not yet attained puberty must seek your permission (to come to you) on three occasions: (first) before the Fajr (Dawn) Prayer, (second) when you put off your clothes at noon (for rest), and (third) after the ‘Isha’ (Night) Prayer (when you go to bed for sleep. These are) the three (times) of privacy for you. Other than these (times), there is no sin on you or them (because during remaining hours they) keep coming and going frequently where you are from one to the other. That is how Allah makes the Revelations clear for you, and Allah is All-Knowing, All-Wise.","vec_preview":[0.009700000286102295,0.010900000110268593,-0.0203000009059906,-0.011599999852478504,0.049800001084804535,-0.03750000149011612,-0.03139999881386757,-0.04600000008940697]},{"ayah_id":"24:59","surah":24,"ayah":59,"arabic":"وَإِذَا بَلَغَ الْأَطْفَالُ مِنكُمُ الْحُلُمَ فَلْيَسْتَأْذِنُوا كَمَا اسْتَأْذَنَ الَّذِينَ مِن قَبْلِهِمْ ۚ كَذَٰلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","english":"And when the children from amongst you reach puberty, they must also seek your permission (to come to you) as (other elders) have been doing before them. That is how Allah makes His commands clear for you. And Allah is All-Knowing, All-Wise.","vec_preview":[0.002199999988079071,0.0031999999191612005,-0.019899999722838402,0.014100000262260437,0.01810000091791153,-0.0414000004529953,-0.01510000042617321,-0.04439999908208847]},{"ayah_id":"24:60","surah":24,"ayah":60,"arabic":"وَالْقَوَاعِدُ مِنَ النِّسَاءِ اللَّاتِي لَا يَرْجُونَ نِكَاحًا فَلَيْسَ عَلَيْهِنَّ جُنَاحٌ أَن يَضَعْنَ ثِيَابَهُنَّ غَيْرَ مُتَبَرِّجَاتٍ بِزِينَةٍ ۖ وَأَن يَسْتَعْفِفْنَ خَيْرٌ لَّهُنَّ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ","english":"And there is no sin on those elderly house-confined women who have no desire (now) for marriage if they lay aside their garments (i.e., additional outer coverings), provided they (too) do not show their adornment. And if they are (more) committed to self-restraint (i.e., do not remove additional outer coverings as well), that is better for them. And Allah is All-Hearing, All-Knowing.","vec_preview":[0.001500000013038516,0.013500000350177288,-0.031700000166893005,-0.008200000040233135,0.0333000011742115,-0.039500001817941666,-0.011599999852478504,-0.04560000076889992]},{"ayah_id":"24:61","surah":24,"ayah":61,"arabic":"لَّيْسَ عَلَى الْأَعْمَىٰ حَرَجٌ وَلَا عَلَى الْأَعْرَجِ حَرَجٌ وَلَا عَلَى الْمَرِيضِ حَرَجٌ وَلَا عَلَىٰ أَنفُسِكُمْ أَن تَأْكُلُوا مِن بُيُوتِكُمْ أَوْ بُيُوتِ آبَائِكُمْ أَوْ بُيُوتِ أُمَّهَاتِكُمْ أَوْ بُيُوتِ إِخْوَانِكُمْ أَوْ بُيُوتِ أَخَوَاتِكُمْ أَوْ بُيُوتِ أَعْمَامِكُمْ أَوْ بُيُوتِ عَمَّاتِكُمْ أَوْ بُيُوتِ أَخْوَالِكُمْ أَوْ بُيُوتِ خَالَاتِكُمْ أَوْ مَا مَلَكْتُم مَّفَاتِحَهُ أَوْ صَدِيقِكُمْ ۚ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَأْكُلُوا جَمِيعًا أَوْ أَشْتَاتًا ۚ فَإِذَا دَخَلْتُم بُيُوتًا فَسَلِّمُوا عَلَىٰ أَنفُسِكُمْ تَحِيَّةً مِّنْ عِندِ اللَّهِ مُبَارَكَةً طَيِّبَةً ۚ كَذَٰلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الْآيَاتِ لَعَلَّكُمْ تَعْقِلُونَ","english":"There is no restriction on the blind, nor any blame on the lame, nor is there any sin on the sick, nor (any harm) for you if you eat (food) from your own houses or from the houses of your fathers, or the houses of your mothers, or the houses of your brothers, or the houses of your sisters, or the houses of your fathers’ brothers, or the houses of your fathers’ sisters, or the houses of your mothers’ brothers, or the houses of your mothers’ sisters, or the houses whose keys are in your charge (i.e., whose owners have permitted you for any use. Nor is there any harm to eat food) from your friends’ houses. There is no sin on you whether you all eat together or separately. Then, when you enter the houses, greet (the members of) your (family) with the greeting of peace and security. (This) is a blissful and pure greeting from Allah. Thus Allah makes clear His Verses for you so that you may understand (the commands of the Shariah and the manners of life).","vec_preview":[0.015300000086426735,0.02280000038444996,-0.03629999980330467,0.00570000009611249,0.03750000149011612,-0.017799999564886093,-0.021400000900030136,-0.04500000178813934]},{"ayah_id":"24:62","surah":24,"ayah":62,"arabic":"إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ وَإِذَا كَانُوا مَعَهُ عَلَىٰ أَمْرٍ جَامِعٍ لَّمْ يَذْهَبُوا حَتَّىٰ يَسْتَأْذِنُوهُ ۚ إِنَّ الَّذِينَ يَسْتَأْذِنُونَكَ أُولَـٰئِكَ الَّذِينَ يُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ ۚ فَإِذَا اسْتَأْذَنُوكَ لِبَعْضِ شَأْنِهِمْ فَأْذَن لِّمَن شِئْتَ مِنْهُمْ وَاسْتَغْفِرْ لَهُمُ اللَّهَ ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ","english":"The believers are only those who have believed in Allah and His Messenger (blessings and peace be upon him), and when they are with you for some (collective) issue which brings (the people) together, then they should not go away from there (i.e., they should participate whole-heartedly to work for collective coherence and unity amongst the Umma [Community]) until they have obtained permission from you (owing to some special excuse. O Esteemed Prophet,) surely those who seek permission from you (believing your Majesty the Supreme and Ultimate Authority), it is they who are the believers in Allah and His Prophet. So when they seek from you permission (to go) for some affair of theirs, then (you are the Supreme Sovereign Authority). Grant leave whom you please, and ask forgiveness for them from Allah (even on going away from your company by obtaining your permission, lest they should be seized even on that). Surely, Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.0017999999690800905,0.023399999365210533,-0.035100001841783524,0.003700000001117587,0.02850000001490116,-0.04600000008940697,-0.021700000390410423,-0.042100001126527786]},{"ayah_id":"24:63","surah":24,"ayah":63,"arabic":"لَّا تَجْعَلُوا دُعَاءَ الرَّسُولِ بَيْنَكُمْ كَدُعَاءِ بَعْضِكُم بَعْضًا ۚ قَدْ يَعْلَمُ اللَّهُ الَّذِينَ يَتَسَلَّلُونَ مِنكُمْ لِوَاذًا ۚ فَلْيَحْذَرِ الَّذِينَ يُخَالِفُونَ عَنْ أَمْرِهِ أَن تُصِيبَهُمْ فِتْنَةٌ أَوْ يُصِيبَهُمْ عَذَابٌ أَلِيمٌ","english":"(O Muslims!) Do not regard the calling of the Prophet amongst you like your calling of one another. (When calling the Holy Prophet is not like your mutual calling amongst you, then how can the Holy Personality of the Prophet be like yours?) Surely, Allah knows those from amongst you (well) who slip away quietly (from the presence of the Holy Prophet [blessings and peace be upon him]) under the shelter of one another. So let those who go against the Messenger’s command (of veneration and devotion) feel afraid lest some trial should overtake them (here in the world) or a painful torment seize them in the Hereafter.","vec_preview":[0.007199999876320362,0.03750000149011612,-0.03739999979734421,-0.0142000000923872,0.03849999979138374,-0.04910000041127205,-0.01759999990463257,-0.04800000041723251]},{"ayah_id":"24:64","surah":24,"ayah":64,"arabic":"أَلَا إِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ قَدْ يَعْلَمُ مَا أَنتُمْ عَلَيْهِ وَيَوْمَ يُرْجَعُونَ إِلَيْهِ فَيُنَبِّئُهُم بِمَا عَمِلُوا ۗ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ","english":"Beware! To Allah belongs (all) that is in the heavens and in the earth. He certainly knows your state of mind (i.e., state of belief or that of hypocrisy). And on the Day when they will be returned to Him, He will disclose to them what they used to do and Allah knows everything full well.","vec_preview":[0.0008999999845400453,0.008999999612569809,-0.026799999177455902,0.005100000184029341,0.007199999876320362,-0.027699999511241913,0.003800000064074993,-0.044599998742341995]}]