[{"ayah_id":"66:1","surah":66,"ayah":1,"arabic":"يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ۖ تَبْتَغِي مَرْضَاتَ أَزْوَاجِكَ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ","english":"O (Esteemed) Prophet! Why do you forbid yourself (taking honey) which Allah has made lawful for you? (How well) you seek to please your wives! And Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.02419999986886978,0.01360000018030405,-0.026599999517202377,-0.00139999995008111,0.019600000232458115,-0.053300000727176666,-0.02290000021457672,-0.03880000114440918]},{"ayah_id":"66:2","surah":66,"ayah":2,"arabic":"قَدْ فَرَضَ اللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ ۚ وَاللَّهُ مَوْلَاكُمْ ۖ وَهُوَ الْعَلِيمُ الْحَكِيمُ","english":"(O believers!) Indeed, Allah has prescribed for you how to dissolve your oaths (by atonement). And Allah is your Helper and Protector. And He is All-Knowing, Most Wise.","vec_preview":[0.004600000102072954,0.014000000432133675,-0.033799998462200165,0.003599999938160181,0.03420000150799751,-0.03779999911785126,-0.017899999395012856,-0.038100000470876694]},{"ayah_id":"66:3","surah":66,"ayah":3,"arabic":"وَإِذْ أَسَرَّ النَّبِيُّ إِلَىٰ بَعْضِ أَزْوَاجِهِ حَدِيثًا فَلَمَّا نَبَّأَتْ بِهِ وَأَظْهَرَهُ اللَّهُ عَلَيْهِ عَرَّفَ بَعْضَهُ وَأَعْرَضَ عَن بَعْضٍ ۖ فَلَمَّا نَبَّأَهَا بِهِ قَالَتْ مَنْ أَنبَأَكَ هَـٰذَا ۖ قَالَ نَبَّأَنِيَ الْعَلِيمُ الْخَبِيرُ","english":"And when the Prophet (blessings and peace be upon him) secretly disclosed a matter to one of his wives, but when she mentioned it and Allah made it known to the Prophet (blessings and peace be upon him), then the Prophet reminded her of some part of it and overlooked (to inform) the rest of it. Then when the Prophet (blessings and peace be upon him) informed her of it (that she had disclosed that secret), she said: ‘Who has told you of that?’ The Prophet (blessings and peace be upon him) said: ‘The All-Knowing, All-Aware (Lord) has told me.’","vec_preview":[0.0,0.01080000028014183,-0.0272000003606081,0.0012000000569969416,0.026599999517202377,-0.02850000001490116,-0.016899999231100082,-0.042399998754262924]},{"ayah_id":"66:4","surah":66,"ayah":4,"arabic":"إِن تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا ۖ وَإِن تَظَاهَرَا عَلَيْهِ فَإِنَّ اللَّهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ ۖ وَالْمَلَائِكَةُ بَعْدَ ذَٰلِكَ ظَهِيرٌ","english":"If you both turn to Allah in repentance, (that is better for you) because the hearts of both of you have inclined (towards the same), but if you help one another in this matter (that may annoy the Holy Prophet [blessings and peace be upon him]). So surely Allah is the One Who is his Friend and Helper and Jibril (Gabriel) and the most pious believers and after them (all) angels too are (his) helpers.","vec_preview":[0.012600000016391277,0.00419999985024333,-0.026100000366568565,0.011300000362098217,0.042399998754262924,-0.04699999839067459,-0.004600000102072954,-0.03440000116825104]},{"ayah_id":"66:5","surah":66,"ayah":5,"arabic":"عَسَىٰ رَبُّهُ إِن طَلَّقَكُنَّ أَن يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِّنكُنَّ مُسْلِمَاتٍ مُّؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا","english":"If he divorces you, then it may well be that your Lord will give him in your place better wives than yourselves (who) will be obedient, true believers, submissive, penitent, worshippers, given to fasting, (some) formerly married and (some) virgins.","vec_preview":[0.007499999832361937,0.012799999676644802,-0.021400000900030136,-0.003700000001117587,0.013899999670684338,-0.006599999964237213,-0.02710000053048134,-0.03849999979138374]},{"ayah_id":"66:6","surah":66,"ayah":6,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا قُوا أَنفُسَكُمْ وَأَهْلِيكُمْ نَارًا وَقُودُهَا النَّاسُ وَالْحِجَارَةُ عَلَيْهَا مَلَائِكَةٌ غِلَاظٌ شِدَادٌ لَّا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ","english":"O believers! Safeguard yourselves and your families against a Fire whose fuel is men and stones. Appointed over it are strong and stern angels who do not disobey Allah in what He commands them. And they accomplish what they are ordered.","vec_preview":[0.014600000344216824,0.014800000004470348,-0.04580000042915344,-0.0034000000450760126,0.05609999969601631,-0.04899999871850014,-0.02810000069439411,-0.04729999974370003]},{"ayah_id":"66:7","surah":66,"ayah":7,"arabic":"يَا أَيُّهَا الَّذِينَ كَفَرُوا لَا تَعْتَذِرُوا الْيَوْمَ ۖ إِنَّمَا تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ","english":"O disbelievers! Do not make any excuse Today. You will only be paid the reward of what you have been doing.","vec_preview":[0.015799999237060547,0.010400000028312206,-0.0333000011742115,-0.001500000013038516,0.01979999989271164,-0.03180000185966492,-0.02930000051856041,-0.04989999905228615]},{"ayah_id":"66:8","surah":66,"ayah":8,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَّصُوحًا عَسَىٰ رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ يَوْمَ لَا يُخْزِي اللَّهُ النَّبِيَّ وَالَّذِينَ آمَنُوا مَعَهُ ۖ نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ يَقُولُونَ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","english":"O believers! Turn towards Allah’s presence in perfect and most sincere repentance. Your Lord will certainly remove your sins from you, and admit you to the Gardens with streams flowing under them. On the Day when Allah will not slight (His) Prophet (blessings and peace be upon him) and those believers who are in his companionship (visibly or invisibly), their light will be moving fast (brightening) ahead of them and on their right side. They will be submitting: ‘O our Lord, perfect our light for us and forgive us. Surely, You have absolute power over everything.’","vec_preview":[0.013899999670684338,0.01140000019222498,-0.04569999873638153,-0.013399999588727951,0.04399999976158142,-0.05050000175833702,-0.0031999999191612005,-0.055399999022483826]},{"ayah_id":"66:9","surah":66,"ayah":9,"arabic":"يَا أَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ ۚ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمَصِيرُ","english":"O (Esteemed) Prophet! Strive hard against the disbelievers and the hypocrites (who have initiated militancy, aggression, mischief and intrigues against you) and treat them strictly. And their abode is Hell. And what an evil abode that is!","vec_preview":[0.0210999995470047,-0.002400000113993883,-0.029999999329447746,0.014600000344216824,0.020899999886751175,-0.05249999836087227,-0.012000000104308128,-0.03189999982714653]},{"ayah_id":"66:10","surah":66,"ayah":10,"arabic":"ضَرَبَ اللَّهُ مَثَلًا لِّلَّذِينَ كَفَرُوا امْرَأَتَ نُوحٍ وَامْرَأَتَ لُوطٍ ۖ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللَّهِ شَيْئًا وَقِيلَ ادْخُلَا النَّارَ مَعَ الدَّاخِلِينَ","english":"Allah has described for disbelievers the example of Nuh’s (Noah’s) wife (Wahila) and Lut’s (Lot’s) wife (Wa‘ila). They were married to two of Our pious servants. But both of them betrayed them. So they could not help them before (the torment of) Allah, and it was said to them: ‘Both of you (women), enter Hell along with all who enter it.’","vec_preview":[0.0020000000949949026,0.003700000001117587,-0.01549999974668026,0.006399999838322401,0.026799999177455902,-0.05640000104904175,-0.0203000009059906,-0.04809999838471413]},{"ayah_id":"66:11","surah":66,"ayah":11,"arabic":"وَضَرَبَ اللَّهُ مَثَلًا لِّلَّذِينَ آمَنُوا امْرَأَتَ فِرْعَوْنَ إِذْ قَالَتْ رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ وَنَجِّنِي مِن فِرْعَوْنَ وَعَمَلِهِ وَنَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ","english":"And Allah has given for the believers the example of Pharaoh’s wife (Asiya, the daughter of Mazahim) when she submitted: ‘O my Lord, build a house for me in Paradise in Your presence, and deliver me from Pharaoh and his (evil) conduct, and also rescue me from the wrongdoing people.’","vec_preview":[0.00860000029206276,0.004600000102072954,-0.020800000056624413,0.008200000040233135,0.02710000053048134,-0.04540000110864639,-0.01730000041425228,-0.04969999939203262]},{"ayah_id":"66:12","surah":66,"ayah":12,"arabic":"وَمَرْيَمَ ابْنَتَ عِمْرَانَ الَّتِي أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهِ مِن رُّوحِنَا وَصَدَّقَتْ بِكَلِمَاتِ رَبِّهَا وَكُتُبِهِ وَكَانَتْ مِنَ الْقَانِتِينَ","english":"And (the second example is given of) Maryam (Mary), the daughter of ‘Imran, who guarded well her chastity and purity. And We breathed Our Spirit into the sternal opening of (her) shirt. And she confirmed the commandments of her Lord and the (revealed) Books and she was of the obedient.","vec_preview":[0.024000000208616257,0.019200000911951065,-0.0203000009059906,0.016699999570846558,-0.009600000455975533,-0.05380000174045563,-0.009999999776482582,-0.054499998688697815]}]