[{"ayah_id":"9:1","surah":9,"ayah":1,"arabic":"بَرَاءَةٌ مِّنَ اللَّهِ وَرَسُولِهِ إِلَى الَّذِينَ عَاهَدتُّم مِّنَ الْمُشْرِكِينَ","english":"Absolution (i.e., renunciation) is declared from Allah and His Messenger (blessings and peace be upon him) to those polytheists with whom you had made a treaty of peace (but they breached the truce and restored the state of war).","vec_preview":[0.0005000000237487257,0.008200000040233135,-0.02669999934732914,-0.0044999998062849045,0.021900000050663948,-0.04129999876022339,-0.02160000056028366,-0.04430000111460686]},{"ayah_id":"9:2","surah":9,"ayah":2,"arabic":"فَسِيحُوا فِي الْأَرْضِ أَرْبَعَةَ أَشْهُرٍ وَاعْلَمُوا أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ ۙ وَأَنَّ اللَّهَ مُخْزِي الْكَافِرِينَ","english":"So, (O polytheists,) you may move about in the land (for) four months. (You will face war after this term.) And bear in mind that you cannot at all weaken Allah, and surely Allah is the Abaser of the disbelievers.","vec_preview":[-0.0019000000320374966,0.012400000356137753,-0.03359999880194664,0.009600000455975533,0.026499999687075615,-0.05169999971985817,0.001500000013038516,-0.03290000185370445]},{"ayah_id":"9:3","surah":9,"ayah":3,"arabic":"وَأَذَانٌ مِّنَ اللَّهِ وَرَسُولِهِ إِلَى النَّاسِ يَوْمَ الْحَجِّ الْأَكْبَرِ أَنَّ اللَّهَ بَرِيءٌ مِّنَ الْمُشْرِكِينَ ۙ وَرَسُولُهُ ۚ فَإِن تُبْتُمْ فَهُوَ خَيْرٌ لَّكُمْ ۖ وَإِن تَوَلَّيْتُمْ فَاعْلَمُوا أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ ۗ وَبَشِّرِ الَّذِينَ كَفَرُوا بِعَذَابٍ أَلِيمٍ","english":"(These Verses) are a (public) declaration from Allah and His Messenger (blessings and peace be upon him) for all mankind on the day of the Great Pilgrimage that Allah is absolved of all obligations to the polytheists, and His Messenger (blessings and peace be upon him) too (is free from all obligations to them). So, (O polytheists,) if you repent, that is better for you, but if you turn away, then know that you cannot at all make Allah’s strategy ineffective. And, (O Beloved,) warn the disbelievers of a grievous torment,","vec_preview":[0.002199999988079071,0.02979999966919422,-0.029999999329447746,0.00559999980032444,0.030799999833106995,-0.05460000038146973,-0.011300000362098217,-0.04190000146627426]},{"ayah_id":"9:4","surah":9,"ayah":4,"arabic":"إِلَّا الَّذِينَ عَاهَدتُّم مِّنَ الْمُشْرِكِينَ ثُمَّ لَمْ يَنقُصُوكُمْ شَيْئًا وَلَمْ يُظَاهِرُوا عَلَيْكُمْ أَحَدًا فَأَتِمُّوا إِلَيْهِمْ عَهْدَهُمْ إِلَىٰ مُدَّتِهِمْ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ","english":"Except those idolaters with whom you made an agreement, who then did not show any latitude (in executing the treaty) and who did not support (or reinforce) anyone against you. So fulfil the treaty with them till the end of the term. Surely, Allah loves those who fear Him.","vec_preview":[-0.015399999916553497,0.0006000000284984708,-0.03840000182390213,-0.005499999970197678,0.02969999983906746,-0.04580000042915344,-0.01510000042617321,-0.05350000038743019]},{"ayah_id":"9:5","surah":9,"ayah":5,"arabic":"فَإِذَا انسَلَخَ الْأَشْهُرُ الْحُرُمُ فَاقْتُلُوا الْمُشْرِكِينَ حَيْثُ وَجَدتُّمُوهُمْ وَخُذُوهُمْ وَاحْصُرُوهُمْ وَاقْعُدُوا لَهُمْ كُلَّ مَرْصَدٍ ۚ فَإِن تَابُوا وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ فَخَلُّوا سَبِيلَهُمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ","english":"So when the sacred months have passed, then (as declared) kill the idolaters (who have re-initiated war) wherever you find them (during the war), capture them, imprison them and lie in wait for them at every place of ambush (to catch and besiege them). So, if they repent, establish Prayer and start paying Zakat (the Alms-due), then leave their way open. Surely, Allah is Most Forgiving, Ever-Merciful.","vec_preview":[-0.0032999999821186066,0.026599999517202377,-0.04100000113248825,0.021900000050663948,0.016499999910593033,-0.04179999977350235,-0.018300000578165054,-0.04989999905228615]},{"ayah_id":"9:6","surah":9,"ayah":6,"arabic":"وَإِنْ أَحَدٌ مِّنَ الْمُشْرِكِينَ اسْتَجَارَكَ فَأَجِرْهُ حَتَّىٰ يَسْمَعَ كَلَامَ اللَّهِ ثُمَّ أَبْلِغْهُ مَأْمَنَهُ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْلَمُونَ","english":"And if any of the idolaters seeks asylum with you, provide him with protection until he listens to the Words of Allah. Then escort him to his haven. This is because these people do not possess the knowledge (of the truth).","vec_preview":[-0.014800000004470348,0.016200000420212746,-0.03849999979138374,-0.009499999694526196,0.012500000186264515,-0.039900001138448715,-0.017899999395012856,-0.061900001019239426]},{"ayah_id":"9:7","surah":9,"ayah":7,"arabic":"كَيْفَ يَكُونُ لِلْمُشْرِكِينَ عَهْدٌ عِندَ اللَّهِ وَعِندَ رَسُولِهِ إِلَّا الَّذِينَ عَاهَدتُّمْ عِندَ الْمَسْجِدِ الْحَرَامِ ۖ فَمَا اسْتَقَامُوا لَكُمْ فَاسْتَقِيمُوا لَهُمْ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ","english":"(How) can there be a promise for the polytheists with Allah and His Messenger (blessings and peace be upon him) except for those with whom you have made a treaty near the Sacred Mosque (at al-Hudaybiya)? So as long as they remain true to (the treaty with) you, remain true to them. Surely, Allah loves those who fear Him.","vec_preview":[-0.01080000028014183,0.02329999953508377,-0.02449999935925007,0.008200000040233135,0.03579999879002571,-0.039500001817941666,-0.013199999928474426,-0.04859999939799309]},{"ayah_id":"9:8","surah":9,"ayah":8,"arabic":"كَيْفَ وَإِن يَظْهَرُوا عَلَيْكُمْ لَا يَرْقُبُوا فِيكُمْ إِلًّا وَلَا ذِمَّةً ۚ يُرْضُونَكُم بِأَفْوَاهِهِمْ وَتَأْبَىٰ قُلُوبُهُمْ وَأَكْثَرُهُمْ فَاسِقُونَ","english":"How (can one expect from them an honouring of the agreement)? They are in such a state that if they overpower you, they will have regard neither for any tie of kinship with you nor for any covenant. They please you with lip service only, but their hearts deny (all what they say). And most of them are those who break agreements.","vec_preview":[0.009999999776482582,0.022299999371170998,-0.028999999165534973,-0.006000000052154064,0.04390000179409981,-0.041099999099969864,-0.008100000210106373,-0.03709999844431877]},{"ayah_id":"9:9","surah":9,"ayah":9,"arabic":"اشْتَرَوْا بِآيَاتِ اللَّهِ ثَمَنًا قَلِيلًا فَصَدُّوا عَن سَبِيلِهِ ۚ إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَ","english":"They gained a paltry price (in terms of worldly interests) for the Revelations of Allah and then started hindering (people) from His path (of the Din [Religion]). Indeed, it is extremely evil what they keep doing.","vec_preview":[0.002300000051036477,-0.0044999998062849045,-0.03669999912381172,-0.02370000071823597,0.027300000190734863,-0.03370000049471855,-0.0203000009059906,-0.04129999876022339]},{"ayah_id":"9:10","surah":9,"ayah":10,"arabic":"لَا يَرْقُبُونَ فِي مُؤْمِنٍ إِلًّا وَلَا ذِمَّةً ۚ وَأُولَـٰئِكَ هُمُ الْمُعْتَدُونَ","english":"They have no regard for either a tie of kinship or a covenant in respect of a Muslim, and they are the people who have exceeded limits (in disobedience).","vec_preview":[0.0034000000450760126,0.02290000021457672,-0.030400000512599945,0.029100000858306885,0.03550000116229057,-0.04729999974370003,-0.01590000092983246,-0.04479999840259552]},{"ayah_id":"9:11","surah":9,"ayah":11,"arabic":"فَإِن تَابُوا وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ فَإِخْوَانُكُمْ فِي الدِّينِ ۗ وَنُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ","english":"(Even) then if they repent and establish Prayer and pay Zakat (the Alms-due), they are your brothers in Din (Religion). And We elucidate (Our) Revelations in detail for those who possess knowledge and understanding.","vec_preview":[-0.002300000051036477,0.025599999353289604,-0.03759999945759773,-0.0,0.026599999517202377,-0.00989999994635582,-0.012299999594688416,-0.05040000006556511]},{"ayah_id":"9:12","surah":9,"ayah":12,"arabic":"وَإِن نَّكَثُوا أَيْمَانَهُم مِّن بَعْدِ عَهْدِهِمْ وَطَعَنُوا فِي دِينِكُمْ فَقَاتِلُوا أَئِمَّةَ الْكُفْرِ ۙ إِنَّهُمْ لَا أَيْمَانَ لَهُمْ لَعَلَّهُمْ يَنتَهُونَ","english":"And if after making a promise (for peaceful bilateral relations), they break their oaths, (and restore the state of war,) and taunt you with sarcasm in your Din (Religion), then wage (defensive) war against (those) chieftains of disbelief (to eliminate any chance of mischief, violence and revolt). Surely, their oaths are not worth any regard, so that they may desist (from their mischief-mongering).","vec_preview":[-0.0008999999845400453,0.01140000019222498,-0.04270000010728836,0.006300000008195639,0.029600000008940697,-0.044599998742341995,-0.021400000900030136,-0.05339999869465828]},{"ayah_id":"9:13","surah":9,"ayah":13,"arabic":"أَلَا تُقَاتِلُونَ قَوْمًا نَّكَثُوا أَيْمَانَهُمْ وَهَمُّوا بِإِخْرَاجِ الرَّسُولِ وَهُم بَدَءُوكُمْ أَوَّلَ مَرَّةٍ ۚ أَتَخْشَوْنَهُمْ ۚ فَاللَّهُ أَحَقُّ أَن تَخْشَوْهُ إِن كُنتُم مُّؤْمِنِينَ","english":"Will you not fight a people who broke their oaths (violating the peace treaty and restoring the state of war), and decided to banish the Messenger (blessings and peace be upon him) whilst the first time it is they who initiated war against you? Do you fear them? But Allah has more right that you should fear Him, provided you are believers.","vec_preview":[0.002400000113993883,0.0032999999821186066,-0.03629999980330467,-0.0032999999821186066,0.01979999989271164,-0.042500000447034836,-0.01510000042617321,-0.06239999830722809]},{"ayah_id":"9:14","surah":9,"ayah":14,"arabic":"قَاتِلُوهُمْ يُعَذِّبْهُمُ اللَّهُ بِأَيْدِيكُمْ وَيُخْزِهِمْ وَيَنصُرْكُمْ عَلَيْهِمْ وَيَشْفِ صُدُورَ قَوْمٍ مُّؤْمِنِينَ","english":"Fight against them (to establish peace). Allah will torment them at your hands and will humiliate them, and will help you (in your defensive fight) against them, and will heal the breasts of the believers.","vec_preview":[0.0142000000923872,0.028999999165534973,-0.031300000846385956,0.010999999940395355,0.03579999879002571,-0.03689999878406525,-0.030400000512599945,-0.04560000076889992]},{"ayah_id":"9:15","surah":9,"ayah":15,"arabic":"وَيُذْهِبْ غَيْظَ قُلُوبِهِمْ ۗ وَيَتُوبُ اللَّهُ عَلَىٰ مَن يَشَاءُ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","english":"And He will remove the distress and fury in their hearts, and will accept repentance of whom He wills. And Allah is All-Knowing, Most Wise.","vec_preview":[-0.008899999782443047,0.021299999207258224,-0.03180000185966492,0.017799999564886093,0.010599999688565731,-0.016899999231100082,-0.032499998807907104,-0.0340999998152256]},{"ayah_id":"9:16","surah":9,"ayah":16,"arabic":"أَمْ حَسِبْتُمْ أَن تُتْرَكُوا وَلَمَّا يَعْلَمِ اللَّهُ الَّذِينَ جَاهَدُوا مِنكُمْ وَلَمْ يَتَّخِذُوا مِن دُونِ اللَّهِ وَلَا رَسُولِهِ وَلَا الْمُؤْمِنِينَ وَلِيجَةً ۚ وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ","english":"Do you think that you will be spared (without passing through troubles and hardships), whilst Allah has not (yet) made distinctly known those amongst you who have fought in the way of Allah and (who) have not taken anyone as a confidant besides Allah and His Messenger (blessings and peace be upon him) and the believers? And Allah is Well Aware of the deeds that you do.","vec_preview":[-0.002899999963119626,0.007799999788403511,-0.023499999195337296,-0.012799999676644802,0.03319999948143959,-0.041999999433755875,-0.002199999988079071,-0.0502999983727932]},{"ayah_id":"9:17","surah":9,"ayah":17,"arabic":"مَا كَانَ لِلْمُشْرِكِينَ أَن يَعْمُرُوا مَسَاجِدَ اللَّهِ شَاهِدِينَ عَلَىٰ أَنفُسِهِم بِالْكُفْرِ ۚ أُولَـٰئِكَ حَبِطَتْ أَعْمَالُهُمْ وَفِي النَّارِ هُمْ خَالِدُونَ","english":"It is not for the polytheists to maintain and frequent the mosques of Allah, whereas they themselves bear witness to their disbelief. All their deeds have become void and in Hell they shall dwell forever.","vec_preview":[-0.016899999231100082,0.002099999925121665,-0.032600000500679016,0.007400000002235174,0.02969999983906746,-0.04729999974370003,-0.009499999694526196,-0.04639999940991402]},{"ayah_id":"9:18","surah":9,"ayah":18,"arabic":"إِنَّمَا يَعْمُرُ مَسَاجِدَ اللَّهِ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَأَقَامَ الصَّلَاةَ وَآتَى الزَّكَاةَ وَلَمْ يَخْشَ إِلَّا اللَّهَ ۖ فَعَسَىٰ أُولَـٰئِكَ أَن يَكُونُوا مِنَ الْمُهْتَدِينَ","english":"Only he who believes in Allah and the Last Day and establishes Prayer and pays Zakat (the Alms-due) and who fears none but Allah can maintain and frequent the mosques of Allah. So they alone are expected to become the rightly-guided.","vec_preview":[-0.005200000014156103,0.01640000008046627,-0.02810000069439411,0.013000000268220901,0.03530000150203705,-0.027799999341368675,-0.01940000057220459,-0.04280000180006027]},{"ayah_id":"9:19","surah":9,"ayah":19,"arabic":"۞ أَجَعَلْتُمْ سِقَايَةَ الْحَاجِّ وَعِمَارَةَ الْمَسْجِدِ الْحَرَامِ كَمَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَجَاهَدَ فِي سَبِيلِ اللَّهِ ۚ لَا يَسْتَوُونَ عِندَ اللَّهِ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","english":"Do you consider (the mere) serving of drinking water to the pilgrims and the management of populating and maintaining the Sacred Mosque (an act) equal to (the works of) a person who believes in Allah and the Last Day and fights in the cause of Allah? They cannot be equal in the sight of Allah, and Allah does not guide those who do injustice.","vec_preview":[0.006000000052154064,0.018799999728798866,-0.023000000044703484,-0.019999999552965164,0.03620000183582306,-0.03139999881386757,-0.007899999618530273,-0.04320000112056732]},{"ayah_id":"9:20","surah":9,"ayah":20,"arabic":"الَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ بِأَمْوَالِهِمْ وَأَنفُسِهِمْ أَعْظَمُ دَرَجَةً عِندَ اللَّهِ ۚ وَأُولَـٰئِكَ هُمُ الْفَائِزُونَ","english":"Those who have believed and have emigrated and have consistently toiled hard in the cause of Allah with their material and human resources enjoy a very high rank in the presence of Allah, and it is they who have achieved the ultimate goal.","vec_preview":[0.004800000227987766,0.01979999989271164,-0.03220000118017197,-0.008700000122189522,0.03550000116229057,-0.05510000139474869,-0.004399999976158142,-0.03790000081062317]},{"ayah_id":"9:21","surah":9,"ayah":21,"arabic":"يُبَشِّرُهُمْ رَبُّهُم بِرَحْمَةٍ مِّنْهُ وَرِضْوَانٍ وَجَنَّاتٍ لَّهُمْ فِيهَا نَعِيمٌ مُّقِيمٌ","english":"Their Lord gives them glad tidings of mercy from Him and of (His) pleasure and of (those) Gardens for them in which there are eternal delights;","vec_preview":[-0.00019999999494757503,0.032099999487400055,-0.0340999998152256,0.013399999588727951,0.024800000712275505,-0.020600000396370888,-0.010599999688565731,-0.02630000002682209]},{"ayah_id":"9:22","surah":9,"ayah":22,"arabic":"خَالِدِينَ فِيهَا أَبَدًا ۚ إِنَّ اللَّهَ عِندَهُ أَجْرٌ عَظِيمٌ","english":"They will reside therein forever. Surely, with Allah is the mighty reward.","vec_preview":[-0.002400000113993883,-0.004800000227987766,-0.021400000900030136,-0.018699999898672104,0.03519999980926514,-0.029999999329447746,-0.020099999383091927,-0.024000000208616257]},{"ayah_id":"9:23","surah":9,"ayah":23,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا آبَاءَكُمْ وَإِخْوَانَكُمْ أَوْلِيَاءَ إِنِ اسْتَحَبُّوا الْكُفْرَ عَلَى الْإِيمَانِ ۚ وَمَن يَتَوَلَّهُم مِّنكُمْ فَأُولَـٰئِكَ هُمُ الظَّالِمُونَ","english":"O believers! Do not take your fathers (and forefathers) and brothers for friends if they love disbelief more than belief. And whoever of you befriends them, it is they who are the wrongdoers.","vec_preview":[0.008899999782443047,0.006800000090152025,-0.04580000042915344,0.014299999922513962,0.03139999881386757,-0.06260000169277191,-0.029600000008940697,-0.050999999046325684]},{"ayah_id":"9:24","surah":9,"ayah":24,"arabic":"قُلْ إِن كَانَ آبَاؤُكُمْ وَأَبْنَاؤُكُمْ وَإِخْوَانُكُمْ وَأَزْوَاجُكُمْ وَعَشِيرَتُكُمْ وَأَمْوَالٌ اقْتَرَفْتُمُوهَا وَتِجَارَةٌ تَخْشَوْنَ كَسَادَهَا وَمَسَاكِنُ تَرْضَوْنَهَا أَحَبَّ إِلَيْكُم مِّنَ اللَّهِ وَرَسُولِهِ وَجِهَادٍ فِي سَبِيلِهِ فَتَرَبَّصُوا حَتَّىٰ يَأْتِيَ اللَّهُ بِأَمْرِهِ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ","english":"(O Esteemed Messenger!) Say: ‘If your fathers (and forefathers) and your sons (and daughters) and your brothers (and sisters) and your wives and your (other) kith and kin and the riches that you have earned (so hard) and the trade and business that you fear may decline and the homes you are fond of are dearer to you than Allah and His Messenger (blessings and peace be upon him) and struggling in His cause, then wait until Allah brings His command (of torment). And Allah does not guide the disobedient.’","vec_preview":[0.02319999970495701,0.01940000057220459,-0.028300000354647636,0.00570000009611249,0.030899999663233757,-0.05270000174641609,-0.01549999974668026,-0.04639999940991402]},{"ayah_id":"9:25","surah":9,"ayah":25,"arabic":"لَقَدْ نَصَرَكُمُ اللَّهُ فِي مَوَاطِنَ كَثِيرَةٍ ۙ وَيَوْمَ حُنَيْنٍ ۙ إِذْ أَعْجَبَتْكُمْ كَثْرَتُكُمْ فَلَمْ تُغْنِ عَنكُمْ شَيْئًا وَضَاقَتْ عَلَيْكُمُ الْأَرْضُ بِمَا رَحُبَتْ ثُمَّ وَلَّيْتُم مُّدْبِرِينَ","english":"Assuredly, Allah has helped you on a great many occasions, and (in particular) on the day of Hunayn, when the superiority of your (numerical strength) exhilarated you. Then that (numerical superiority) could not prove to you of any avail, and the earth, despite its vast expanse, narrowed for you, and then you turned your backs in retreat.","vec_preview":[0.01590000092983246,0.029200000688433647,-0.026399999856948853,-0.02539999969303608,0.013299999758601189,-0.030700000002980232,-0.007899999618530273,-0.03480000048875809]},{"ayah_id":"9:26","surah":9,"ayah":26,"arabic":"ثُمَّ أَنزَلَ اللَّهُ سَكِينَتَهُ عَلَىٰ رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَنزَلَ جُنُودًا لَّمْ تَرَوْهَا وَعَذَّبَ الَّذِينَ كَفَرُوا ۚ وَذَٰلِكَ جَزَاءُ الْكَافِرِينَ","english":"Allah then sent down His tranquillity (i.e., mercy) upon His Messenger (blessings and peace be upon him) and the believers and sent down (such) armies (of angels) that you could not see. And He tormented those who were engaged in disbelief; and that is the punishment of the disbelievers.","vec_preview":[0.0034000000450760126,0.017400000244379044,-0.03150000050663948,-0.0013000000035390258,0.013799999840557575,-0.04280000180006027,-0.02850000001490116,-0.031199999153614044]},{"ayah_id":"9:27","surah":9,"ayah":27,"arabic":"ثُمَّ يَتُوبُ اللَّهُ مِن بَعْدِ ذَٰلِكَ عَلَىٰ مَن يَشَاءُ ۗ وَاللَّهُ غَفُورٌ رَّحِيمٌ","english":"Then even after this, Allah accepts repentance of the one He wills (i.e., He blesses him with an aptness for Islam and His Merciful Eye). And Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.007000000216066837,0.018799999728798866,-0.025200000032782555,0.006599999964237213,0.006599999964237213,-0.030700000002980232,-0.03739999979734421,-0.035599999129772186]},{"ayah_id":"9:28","surah":9,"ayah":28,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّمَا الْمُشْرِكُونَ نَجَسٌ فَلَا يَقْرَبُوا الْمَسْجِدَ الْحَرَامَ بَعْدَ عَامِهِمْ هَـٰذَا ۚ وَإِنْ خِفْتُمْ عَيْلَةً فَسَوْفَ يُغْنِيكُمُ اللَّهُ مِن فَضْلِهِ إِن شَاءَ ۚ إِنَّ اللَّهَ عَلِيمٌ حَكِيمٌ","english":"O believers! The polytheists are an embodiment of impurity, so let them not come closer to the Sacred Mosque after this year of theirs (i.e., after victory over Mecca in 9 AH). If you fear poverty (due to a decline in your trade), then (do not worry). Allah will soon enrich you from His bounty if He so wills. Surely, Allah is All-Knowing, Most Wise.","vec_preview":[0.0015999999595806003,0.01510000042617321,-0.03590000048279762,0.007000000216066837,0.04320000112056732,-0.047200001776218414,-0.019899999722838402,-0.060600001364946365]},{"ayah_id":"9:29","surah":9,"ayah":29,"arabic":"قَاتِلُوا الَّذِينَ لَا يُؤْمِنُونَ بِاللَّهِ وَلَا بِالْيَوْمِ الْآخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ اللَّهُ وَرَسُولُهُ وَلَا يَدِينُونَ دِينَ الْحَقِّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ حَتَّىٰ يُعْطُوا الْجِزْيَةَ عَن يَدٍ وَهُمْ صَاغِرُونَ","english":"(O Muslims!) Wage (also a defensive) war against those of the People of the Book who (infringed the peace treaty signed with you, and despite being in exile, provided full support to the disbelieving Meccan invaders who imposed the battle of al-Ahzab [the Confederates] on Medina, and have continued every possible conspiracy against you even now). They do not have faith in Allah and the Last Day, and do not consider unlawful the things Allah and His Messenger (blessings and peace be upon him) have declared unlawful, and do not adopt the true Din ([Religion] of Islam) until they give in and surrender (to the command of Islam), and pay the capitation tax with their own hands after having been subdued.","vec_preview":[-0.0010000000474974513,0.026100000366568565,-0.04529999941587448,-0.011300000362098217,0.035100001841783524,-0.038600001484155655,-0.02630000002682209,-0.041999999433755875]},{"ayah_id":"9:30","surah":9,"ayah":30,"arabic":"وَقَالَتِ الْيَهُودُ عُزَيْرٌ ابْنُ اللَّهِ وَقَالَتِ النَّصَارَى الْمَسِيحُ ابْنُ اللَّهِ ۖ ذَٰلِكَ قَوْلُهُم بِأَفْوَاهِهِمْ ۖ يُضَاهِئُونَ قَوْلَ الَّذِينَ كَفَرُوا مِن قَبْلُ ۚ قَاتَلَهُمُ اللَّهُ ۚ أَنَّىٰ يُؤْفَكُونَ","english":"And the Jews said: ‘‘Uzayr (Ezra) is the son of Allah,’ and the Christians said: ‘The Messiah is the son of Allah.’ These are their (absurd) utterances that they voice with their mouths. They (acquire) resemblance with the saying of those who have disbelieved before (them). May Allah ruin them! Where are they wandering distracted?","vec_preview":[0.010099999606609344,0.0142000000923872,-0.017000000923871994,0.01860000006854534,0.0364999994635582,-0.019300000742077827,-0.007400000002235174,-0.0414000004529953]},{"ayah_id":"9:31","surah":9,"ayah":31,"arabic":"اتَّخَذُوا أَحْبَارَهُمْ وَرُهْبَانَهُمْ أَرْبَابًا مِّن دُونِ اللَّهِ وَالْمَسِيحَ ابْنَ مَرْيَمَ وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا إِلَـٰهًا وَاحِدًا ۖ لَّا إِلَـٰهَ إِلَّا هُوَ ۚ سُبْحَانَهُ عَمَّا يُشْرِكُونَ","english":"They took their priests and monks for lords besides Allah and (also) the Messiah, the son of Maryam (Mary), whilst in truth they had not been given (any) command except to worship (only) the One God besides Whom there is no God. Holy is He, far above those that they associate with Him as partners.","vec_preview":[0.010900000110268593,0.02449999935925007,-0.024900000542402267,0.014000000432133675,0.014800000004470348,-0.053199999034404755,-0.0071000000461936,-0.03370000049471855]},{"ayah_id":"9:32","surah":9,"ayah":32,"arabic":"يُرِيدُونَ أَن يُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَيَأْبَى اللَّهُ إِلَّا أَن يُتِمَّ نُورَهُ وَلَوْ كَرِهَ الْكَافِرُونَ","english":"They desire to extinguish the Light of Allah by blowing through their mouths. And Allah rejects (it) but (wills) to manifest His Light to its fullness, even though the disbelievers dislike (it).","vec_preview":[-0.03480000048875809,0.02419999986886978,-0.029999999329447746,0.010700000450015068,0.01360000018030405,-0.04910000041127205,-0.02250000089406967,-0.030799999833106995]},{"ayah_id":"9:33","surah":9,"ayah":33,"arabic":"هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ","english":"Allah is He Who sent His Messenger (blessings and peace be upon him) with guidance and the Din (Religion) of truth to make him (the Messenger) dominant over every (other exponent of) Din (Religion), though much to the dislike of the polytheists.","vec_preview":[0.010099999606609344,0.010999999940395355,-0.03680000081658363,-0.0024999999441206455,-0.011599999852478504,-0.027899999171495438,-0.026100000366568565,-0.03999999910593033]},{"ayah_id":"9:34","surah":9,"ayah":34,"arabic":"۞ يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ كَثِيرًا مِّنَ الْأَحْبَارِ وَالرُّهْبَانِ لَيَأْكُلُونَ أَمْوَالَ النَّاسِ بِالْبَاطِلِ وَيَصُدُّونَ عَن سَبِيلِ اللَّهِ ۗ وَالَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ وَلَا يُنفِقُونَهَا فِي سَبِيلِ اللَّهِ فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ","english":"O believers! Indeed, the majority of the priests and monks (of the People of the Book) devour the wealth of people through unfair (means) and hinder from the path of Allah (i.e., fill their safes with people’s money, and hinder it from being spent for the publicity and promotion of the true Din [Religion]). And those who hoard silver and gold and do not spend it in the cause of Allah, warn them of a grievous torment.","vec_preview":[0.027000000700354576,0.03359999880194664,-0.026000000536441803,-0.017400000244379044,0.03739999979734421,-0.04309999942779541,-0.022099999710917473,-0.03929999843239784]},{"ayah_id":"9:35","surah":9,"ayah":35,"arabic":"يَوْمَ يُحْمَىٰ عَلَيْهَا فِي نَارِ جَهَنَّمَ فَتُكْوَىٰ بِهَا جِبَاهُهُمْ وَجُنُوبُهُمْ وَظُهُورُهُمْ ۖ هَـٰذَا مَا كَنَزْتُمْ لِأَنفُسِكُمْ فَذُوقُوا مَا كُنتُمْ تَكْنِزُونَ","english":"The Day when this (gold, silver and wealth) will be heated in the Fire of Hell, their foreheads, sides and backs will be branded with this (heated material, and it will be said to them:) ‘This is the same (wealth) that you treasured for (the benefit of) your souls. So taste (this wealth) which you had been amassing.’","vec_preview":[-0.008100000210106373,0.033900000154972076,-0.04390000179409981,0.013899999670684338,0.0210999995470047,-0.03720000013709068,-0.006300000008195639,-0.04749999940395355]},{"ayah_id":"9:36","surah":9,"ayah":36,"arabic":"إِنَّ عِدَّةَ الشُّهُورِ عِندَ اللَّهِ اثْنَا عَشَرَ شَهْرًا فِي كِتَابِ اللَّهِ يَوْمَ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ مِنْهَا أَرْبَعَةٌ حُرُمٌ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ ۚ فَلَا تَظْلِمُوا فِيهِنَّ أَنفُسَكُمْ ۚ وَقَاتِلُوا الْمُشْرِكِينَ كَافَّةً كَمَا يُقَاتِلُونَكُمْ كَافَّةً ۚ وَاعْلَمُوا أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ","english":"Indeed, the number of months with Allah has been (inscribed as) twelve in the Book of Allah (i.e., permanent Law of Nature) since the day He created the (system of) the heavens and the earth. Of these, four months (Rajab, Dhu al-Qa‘da, Dhu al-Hijja and Muharram) are sacred. This is the right Din (Religion). So do not wrong your souls during these months (by involving yourselves in fighting and war), and fight against all the idolaters (in retaliation) the same way as they all (allied) have imposed war upon all of you, and bear in mind that Allah is surely with the Godfearing.","vec_preview":[0.0032999999821186066,0.0066999997943639755,-0.02889999933540821,0.00989999994635582,0.019500000402331352,-0.03970000147819519,0.007499999832361937,-0.05420000106096268]},{"ayah_id":"9:37","surah":9,"ayah":37,"arabic":"إِنَّمَا النَّسِيءُ زِيَادَةٌ فِي الْكُفْرِ ۖ يُضَلُّ بِهِ الَّذِينَ كَفَرُوا يُحِلُّونَهُ عَامًا وَيُحَرِّمُونَهُ عَامًا لِّيُوَاطِئُوا عِدَّةَ مَا حَرَّمَ اللَّهُ فَيُحِلُّوا مَا حَرَّمَ اللَّهُ ۚ زُيِّنَ لَهُمْ سُوءُ أَعْمَالِهِمْ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْكَافِرِينَ","english":"Postponing and deferring (the sacred months) is just an addition to disbelief. By this, the disbelievers are led astray; they, in one year, count it lawful and in another year regard it forbidden to complete the count (of the months) which Allah has made sacred and (they also) make that (month) lawful which Allah has declared unlawful. Their evil deeds have been made attractive to them, and Allah does not guide the community of disbelievers.","vec_preview":[-0.00989999994635582,0.022299999371170998,-0.031099999323487282,0.017999999225139618,0.027799999341368675,-0.05990000069141388,-0.02459999918937683,-0.010599999688565731]},{"ayah_id":"9:38","surah":9,"ayah":38,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا مَا لَكُمْ إِذَا قِيلَ لَكُمُ انفِرُوا فِي سَبِيلِ اللَّهِ اثَّاقَلْتُمْ إِلَى الْأَرْضِ ۚ أَرَضِيتُم بِالْحَيَاةِ الدُّنْيَا مِنَ الْآخِرَةِ ۚ فَمَا مَتَاعُ الْحَيَاةِ الدُّنْيَا فِي الْآخِرَةِ إِلَّا قَلِيلٌ","english":"O believers! What is the matter with you that when you are asked to set out (to fight) in the way of Allah, you, weighing heavier, incline towards (the material and ignoble world of) the earth? Are you pleased with the life of this world rather than the Hereafter? So, the property and belongings of the life of this world are worthless in (comparison with) the Hereafter (and carry) but little (value).","vec_preview":[0.004000000189989805,0.012299999594688416,-0.025200000032782555,-0.008700000122189522,0.03240000084042549,-0.042399998754262924,-0.0005000000237487257,-0.040300000458955765]},{"ayah_id":"9:39","surah":9,"ayah":39,"arabic":"إِلَّا تَنفِرُوا يُعَذِّبْكُمْ عَذَابًا أَلِيمًا وَيَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ وَلَا تَضُرُّوهُ شَيْئًا ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","english":"If you do not move out (to fight for the promotion of peace and human dignity), He will afflict you with grievous torment and will replace you with another people and you will not be able to do Him any harm. And Allah has mighty power over everything.","vec_preview":[0.008700000122189522,0.015799999237060547,-0.037700001150369644,0.003000000026077032,0.022099999710917473,-0.043299999088048935,-0.013199999928474426,-0.042399998754262924]},{"ayah_id":"9:40","surah":9,"ayah":40,"arabic":"إِلَّا تَنصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ۖ فَأَنزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَّمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَىٰ ۗ وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ","english":"If you do not help him (the Holy Messenger of Allah in the struggle for the dominance of Islam, then what!). Indeed, Allah helped him (also at the time) when the disbelievers drove him away (from Mecca, his homeland,) whilst he was the second of the two (emigrants). Both (the Messenger [blessings and peace be upon him] and Abu Bakr) were in the cave (of Mount Thawr) when he said to his Companion (Abu Bakr): ‘Do not grieve. Allah is surely with us.’ So, Allah sent down His serenity upon him, and strengthened him by means of such armies (of angels) that you could not see, and He made the word of the disbelievers the lowermost, and Allah’s Word is (always) the uppermost and exalted. And Allah is Almighty, Most Wise.","vec_preview":[-0.002300000051036477,0.02969999983906746,-0.019099999219179153,-0.017400000244379044,0.03539999946951866,-0.040300000458955765,-0.025800000876188278,-0.039799999445676804]},{"ayah_id":"9:41","surah":9,"ayah":41,"arabic":"انفِرُوا خِفَافًا وَثِقَالًا وَجَاهِدُوا بِأَمْوَالِكُمْ وَأَنفُسِكُمْ فِي سَبِيلِ اللَّهِ ۚ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ","english":"Light or heavy, march forth (under all circumstances) and fight in the cause of Allah with your material and human resources. It is better for you if you are (reality) conscious.","vec_preview":[0.005200000014156103,0.008299999870359898,-0.033799998462200165,-0.007600000128149986,0.032600000500679016,-0.051100000739097595,0.00019999999494757503,-0.04639999940991402]},{"ayah_id":"9:42","surah":9,"ayah":42,"arabic":"لَوْ كَانَ عَرَضًا قَرِيبًا وَسَفَرًا قَاصِدًا لَّاتَّبَعُوكَ وَلَـٰكِن بَعُدَتْ عَلَيْهِمُ الشُّقَّةُ ۚ وَسَيَحْلِفُونَ بِاللَّهِ لَوِ اسْتَطَعْنَا لَخَرَجْنَا مَعَكُمْ يُهْلِكُونَ أَنفُسَهُمْ وَاللَّهُ يَعْلَمُ إِنَّهُمْ لَكَاذِبُونَ","english":"Had the benefit (i.e., spoils of war) been a near gain and the journey (of fighting) easy and moderate, then they (the hypocrites) would certainly have followed you. But (that) arduous journey appeared to them far too long. And they will (now) swear by Allah soon: ‘Had we been able to go, we would certainly have marched forth with you.’ They are drawing upon themselves (added) destruction (by these lies), and Allah knows that they are liars beyond doubt.","vec_preview":[-0.007699999958276749,0.014299999922513962,-0.03280000016093254,0.003700000001117587,0.03449999913573265,-0.03310000151395798,-0.017400000244379044,-0.05299999937415123]},{"ayah_id":"9:43","surah":9,"ayah":43,"arabic":"عَفَا اللَّهُ عَنكَ لِمَ أَذِنتَ لَهُمْ حَتَّىٰ يَتَبَيَّنَ لَكَ الَّذِينَ صَدَقُوا وَتَعْلَمَ الْكَاذِبِينَ","english":"Allah safeguard (protect and exalt) you! Why did you permit them (not to participate in war), till those who were speaking the truth would be known to you and you would (also) know the liars?","vec_preview":[-0.014100000262260437,0.01889999955892563,-0.03359999880194664,-0.0003000000142492354,0.02590000070631504,-0.04439999908208847,-0.02889999933540821,-0.04600000008940697]},{"ayah_id":"9:44","surah":9,"ayah":44,"arabic":"لَا يَسْتَأْذِنُكَ الَّذِينَ يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَن يُجَاهِدُوا بِأَمْوَالِهِمْ وَأَنفُسِهِمْ ۗ وَاللَّهُ عَلِيمٌ بِالْمُتَّقِينَ","english":"Those who believe in Allah and the Last Day will not seek from you (this) permission that they should (not) fight with their possessions and lives. And Allah knows the Godfearing full well.","vec_preview":[0.003800000064074993,0.00800000037997961,-0.03400000184774399,-0.013899999670684338,0.049300000071525574,-0.039900001138448715,-0.020999999716877937,-0.05429999902844429]},{"ayah_id":"9:45","surah":9,"ayah":45,"arabic":"إِنَّمَا يَسْتَأْذِنُكَ الَّذِينَ لَا يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَارْتَابَتْ قُلُوبُهُمْ فَهُمْ فِي رَيْبِهِمْ يَتَرَدَّدُونَ","english":"Only those who do not believe in Allah and the Last Day and whose hearts are in doubt will seek leave (i.e., exemption from fighting) from you. So in their doubt they are bewildered, lost in disorientation.","vec_preview":[-0.0027000000700354576,0.01140000019222498,-0.030799999833106995,-0.0019000000320374966,0.037300001829862595,-0.04650000110268593,-0.029100000858306885,-0.03180000185966492]},{"ayah_id":"9:46","surah":9,"ayah":46,"arabic":"۞ وَلَوْ أَرَادُوا الْخُرُوجَ لَأَعَدُّوا لَهُ عُدَّةً وَلَـٰكِن كَرِهَ اللَّهُ انبِعَاثَهُمْ فَثَبَّطَهُمْ وَقِيلَ اقْعُدُوا مَعَ الْقَاعِدِينَ","english":"If they had (really) resolved to go forth (for fighting), they would have procured (at least some) equipment for that. But (the fact is that owing to their falsehood and hypocrisy) Allah disliked (even) their rising up (for fighting). So, He stopped them (there). And it was said to them: ‘Sit in the company of those who sit (shirking from the fight).’","vec_preview":[-0.01759999990463257,0.019500000402331352,-0.02449999935925007,0.008299999870359898,0.03689999878406525,-0.035999998450279236,-0.01940000057220459,-0.04430000111460686]},{"ayah_id":"9:47","surah":9,"ayah":47,"arabic":"لَوْ خَرَجُوا فِيكُم مَّا زَادُوكُمْ إِلَّا خَبَالًا وَلَأَوْضَعُوا خِلَالَكُمْ يَبْغُونَكُمُ الْفِتْنَةَ وَفِيكُمْ سَمَّاعُونَ لَهُمْ ۗ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ","english":"If they had come out (joining you), they would have added nothing to you except mischief and disorder and would have strived hard amongst you (to stir up disaffection and discord). They want to bring about subversion within you, and (even now some of) their spies are there amongst you. And Allah is Well Aware of the wrongdoers.","vec_preview":[-0.00860000029206276,0.030400000512599945,-0.04430000111460686,0.014299999922513962,0.038100000470876694,-0.05510000139474869,-0.012299999594688416,-0.04540000110864639]},{"ayah_id":"9:48","surah":9,"ayah":48,"arabic":"لَقَدِ ابْتَغَوُا الْفِتْنَةَ مِن قَبْلُ وَقَلَّبُوا لَكَ الْأُمُورَ حَتَّىٰ جَاءَ الْحَقُّ وَظَهَرَ أَمْرُ اللَّهِ وَهُمْ كَارِهُونَ","english":"The truth is that they have been trying to cause subversion earlier too, and have been contriving schemes to upset your programmes until the truth came and the decree of Allah prevailed, though they disliked (it) downright.","vec_preview":[-0.008500000461935997,0.019200000911951065,-0.048700001090765,0.008999999612569809,0.029100000858306885,-0.04019999876618385,-0.004699999932199717,-0.04270000010728836]},{"ayah_id":"9:49","surah":9,"ayah":49,"arabic":"وَمِنْهُم مَّن يَقُولُ ائْذَن لِّي وَلَا تَفْتِنِّي ۚ أَلَا فِي الْفِتْنَةِ سَقَطُوا ۗ وَإِنَّ جَهَنَّمَ لَمُحِيطَةٌ بِالْكَافِرِينَ","english":"And amongst them is (also) he who says: ‘Accord me permission (to stay back home instead of going to fight) and put me not into trial.’ Listen, they have plunged (themselves) into trial, and assuredly Hell has encompassed the disbelievers.","vec_preview":[0.016499999910593033,0.01810000091791153,-0.031599998474121094,0.004600000102072954,0.04280000180006027,-0.03889999911189079,-0.027499999850988388,-0.04340000078082085]},{"ayah_id":"9:50","surah":9,"ayah":50,"arabic":"إِن تُصِبْكَ حَسَنَةٌ تَسُؤْهُمْ ۖ وَإِن تُصِبْكَ مُصِيبَةٌ يَقُولُوا قَدْ أَخَذْنَا أَمْرَنَا مِن قَبْلُ وَيَتَوَلَّوا وَّهُمْ فَرِحُونَ","english":"If some good (or some comfort) betides you, it grieves them, but if some adversity (or trouble) befalls you, then they say: ‘We had adopted (precaution in) our work in advance,’ and they turn away, rejoicing.","vec_preview":[0.006500000134110451,0.026599999517202377,-0.03440000116825104,0.009200000204145908,0.03400000184774399,-0.03290000185370445,-0.009700000286102295,-0.045899998396635056]},{"ayah_id":"9:51","surah":9,"ayah":51,"arabic":"قُل لَّن يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا هُوَ مَوْلَانَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ","english":"(O Beloved!) Say: ‘Never shall (anything) befall us but what Allah has decreed for us; He alone is our Protector. And in Allah alone the believers should put their trust.’","vec_preview":[0.012000000104308128,0.011500000022351742,-0.032999999821186066,-0.007499999832361937,0.03700000047683716,-0.03290000185370445,-0.017500000074505806,-0.0406000018119812]},{"ayah_id":"9:52","surah":9,"ayah":52,"arabic":"قُلْ هَلْ تَرَبَّصُونَ بِنَا إِلَّا إِحْدَى الْحُسْنَيَيْنِ ۖ وَنَحْنُ نَتَرَبَّصُ بِكُمْ أَن يُصِيبَكُمُ اللَّهُ بِعَذَابٍ مِّنْ عِندِهِ أَوْ بِأَيْدِينَا ۖ فَتَرَبَّصُوا إِنَّا مَعَكُم مُّتَرَبِّصُونَ","english":"Say: ‘Are you simply waiting for one of the two good fortunes in our favour (i.e., victory or martyrdom: whether we are martyred or return victorious)? And we are waiting in your favour (in view of your hypocrisy) to see Allah afflict you with a (special) torment either from Himself or at our hands. So wait. We (too) are waiting with you (to see whose wait proves productive).’","vec_preview":[0.019300000742077827,0.01489999983459711,-0.023800000548362732,-0.013299999758601189,0.04619999974966049,-0.04450000077486038,-0.022700000554323196,-0.051500000059604645]},{"ayah_id":"9:53","surah":9,"ayah":53,"arabic":"قُلْ أَنفِقُوا طَوْعًا أَوْ كَرْهًا لَّن يُتَقَبَّلَ مِنكُمْ ۖ إِنَّكُمْ كُنتُمْ قَوْمًا فَاسِقِينَ","english":"Say: ‘Spend willingly or unwillingly, this (money) will not be accepted from you at all. You are indeed a disobedient people.’","vec_preview":[0.019500000402331352,0.01889999955892563,-0.041600000113248825,-0.01510000042617321,0.03869999945163727,-0.04270000010728836,-0.01769999973475933,-0.03929999843239784]},{"ayah_id":"9:54","surah":9,"ayah":54,"arabic":"وَمَا مَنَعَهُمْ أَن تُقْبَلَ مِنْهُمْ نَفَقَاتُهُمْ إِلَّا أَنَّهُمْ كَفَرُوا بِاللَّهِ وَبِرَسُولِهِ وَلَا يَأْتُونَ الصَّلَاةَ إِلَّا وَهُمْ كُسَالَىٰ وَلَا يُنفِقُونَ إِلَّا وَهُمْ كَارِهُونَ","english":"And there is nothing that stands in the way of acceptance of their spending (i.e., charity donations) except that they deny Allah and His Messenger (blessings and peace be upon him) and come to offer Prayer but lazily and unwillingly, and (also) they do not spend (in the cause of Allah) except in a state of displeasure.","vec_preview":[0.01209999993443489,0.026499999687075615,-0.033799998462200165,0.005200000014156103,0.01860000006854534,-0.04019999876618385,-0.016499999910593033,-0.03290000185370445]},{"ayah_id":"9:55","surah":9,"ayah":55,"arabic":"فَلَا تُعْجِبْكَ أَمْوَالُهُمْ وَلَا أَوْلَادُهُمْ ۚ إِنَّمَا يُرِيدُ اللَّهُ لِيُعَذِّبَهُم بِهَا فِي الْحَيَاةِ الدُّنْيَا وَتَزْهَقَ أَنفُسُهُمْ وَهُمْ كَافِرُونَ","english":"So neither their wealth nor their children should amaze you. It is for these (things) only that Allah intends to punish them in the life of this world and that their souls may depart whilst they are in a state of disbelief.","vec_preview":[-0.0012000000569969416,0.026200000196695328,-0.02539999969303608,0.017400000244379044,0.026200000196695328,-0.04230000078678131,-0.0005000000237487257,-0.037700001150369644]},{"ayah_id":"9:56","surah":9,"ayah":56,"arabic":"وَيَحْلِفُونَ بِاللَّهِ إِنَّهُمْ لَمِنكُمْ وَمَا هُم مِّنكُمْ وَلَـٰكِنَّهُمْ قَوْمٌ يَفْرَقُونَ","english":"And (they are so cowardly that) they swear by Allah that they are from you whilst they are not from you. But they are those who fear (the disclosure and outcome of their hypocrisy. So they appear to be Muslims outawardly).","vec_preview":[-0.006200000178068876,0.017999999225139618,-0.02889999933540821,-0.019700000062584877,0.033900000154972076,-0.04560000076889992,-0.024900000542402267,-0.03500000014901161]},{"ayah_id":"9:57","surah":9,"ayah":57,"arabic":"لَوْ يَجِدُونَ مَلْجَأً أَوْ مَغَارَاتٍ أَوْ مُدَّخَلًا لَّوَلَّوْا إِلَيْهِ وَهُمْ يَجْمَحُونَ","english":"(Their state of mind is such that) if they could find a place of refuge or a cave or a crevice in the earth, they would turn towards it running very fast (and would not stay with you even for a moment, but they are under compulsion right now so they show off their false loyalty).","vec_preview":[0.0003000000142492354,0.01679999940097332,-0.04280000180006027,0.037700001150369644,0.01489999983459711,-0.044199999421834946,-0.014499999582767487,-0.03739999979734421]},{"ayah_id":"9:58","surah":9,"ayah":58,"arabic":"وَمِنْهُم مَّن يَلْمِزُكَ فِي الصَّدَقَاتِ فَإِنْ أُعْطُوا مِنْهَا رَضُوا وَإِن لَّمْ يُعْطَوْا مِنْهَا إِذَا هُمْ يَسْخَطُونَ","english":"And some amongst them are those who pass sarcastic remarks against you in the matter of (the distribution of) alms. If they are given some portion of (the alms), they feel pleased, but if nothing is given to them, they feel annoyed at once.","vec_preview":[0.0024999999441206455,0.009999999776482582,-0.03849999979138374,-0.004900000058114529,0.03269999846816063,-0.03799999877810478,-0.03280000016093254,-0.04650000110268593]},{"ayah_id":"9:59","surah":9,"ayah":59,"arabic":"وَلَوْ أَنَّهُمْ رَضُوا مَا آتَاهُمُ اللَّهُ وَرَسُولُهُ وَقَالُوا حَسْبُنَا اللَّهُ سَيُؤْتِينَا اللَّهُ مِن فَضْلِهِ وَرَسُولُهُ إِنَّا إِلَى اللَّهِ رَاغِبُونَ","english":"How good it would have been if they had felt pleased with what Allah and His Messenger (blessings and peace be upon him) had given them and said: ‘Sufficient for us is Allah. Allah will soon confer on us His bounty and so will His Messenger ([blessings and peace be upon him] in addition). Indeed, we are inclined to Allah alone.’ (And the Messenger [blessings and peace be upon him] is His mediator; in fact, his bestowal is Allah’s. Had they developed this belief and refrained from sarcasm, it would have been better.)","vec_preview":[-0.005400000140070915,-0.005100000184029341,-0.03849999979138374,0.010700000450015068,0.0272000003606081,-0.04259999841451645,-0.030700000002980232,-0.03720000013709068]},{"ayah_id":"9:60","surah":9,"ayah":60,"arabic":"۞ إِنَّمَا الصَّدَقَاتُ لِلْفُقَرَاءِ وَالْمَسَاكِينِ وَالْعَامِلِينَ عَلَيْهَا وَالْمُؤَلَّفَةِ قُلُوبُهُمْ وَفِي الرِّقَابِ وَالْغَارِمِينَ وَفِي سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ ۖ فَرِيضَةً مِّنَ اللَّهِ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","english":"Indeed, alms (Zakat) are meant for the poor and the indigent, and those who are deployed to collect charities and those in whose hearts the inculcation of love for Islam is aimed at. And, (moreover, spending Zakat for the) freeing of human lives (from the yoke of slavery) and removing the burden of those who are to pay debt and (those who toil hard) in the cause of Allah and the wayfarers (is true). This (all) has been prescribed by Allah, and Allah is All-Knowing, Most Wise.","vec_preview":[0.0066999997943639755,0.01899999938905239,-0.02459999918937683,0.004000000189989805,0.02280000038444996,-0.04780000075697899,-0.019999999552965164,-0.02759999968111515]},{"ayah_id":"9:61","surah":9,"ayah":61,"arabic":"وَمِنْهُمُ الَّذِينَ يُؤْذُونَ النَّبِيَّ وَيَقُولُونَ هُوَ أُذُنٌ ۚ قُلْ أُذُنُ خَيْرٍ لَّكُمْ يُؤْمِنُ بِاللَّهِ وَيُؤْمِنُ لِلْمُؤْمِنِينَ وَرَحْمَةٌ لِّلَّذِينَ آمَنُوا مِنكُمْ ۚ وَالَّذِينَ يُؤْذُونَ رَسُولَ اللَّهِ لَهُمْ عَذَابٌ أَلِيمٌ","english":"And amongst these (hypocrites) are also those who hurt (the Esteemed) Messenger (blessings and peace be upon him) and say: ‘He is only an ear (believes everything he hears).’ Say: ‘He is all ears to what is good for you; he believes in Allah and has faith in (what) the believers (say) and is mercy for those of you who have embraced faith. And those who hurt the Messenger of Allah (by means of their evil beliefs, doubts and foul statements), for them there is grievous torment.’","vec_preview":[0.01860000006854534,0.016899999231100082,-0.03420000150799751,-0.002400000113993883,0.05220000073313713,-0.04179999977350235,-0.016300000250339508,-0.042399998754262924]},{"ayah_id":"9:62","surah":9,"ayah":62,"arabic":"يَحْلِفُونَ بِاللَّهِ لَكُمْ لِيُرْضُوكُمْ وَاللَّهُ وَرَسُولُهُ أَحَقُّ أَن يُرْضُوهُ إِن كَانُوا مُؤْمِنِينَ","english":"O Muslims! They (the hypocrites) swear by Allah in your presence to keep you pleased, whereas Allah along with His Messenger (blessings and peace be upon him) has a greater right that they should please Him. If they are the believers, (they should have known this fact and should have pleased the Messenger [blessings and peace be upon him]. Allah is pleased only if the Messenger [blessings and peace be upon him] is pleased because their pleasure is but one and the same).","vec_preview":[0.01080000028014183,0.013199999928474426,-0.03420000150799751,0.0024999999441206455,0.02759999968111515,-0.03519999980926514,-0.011300000362098217,-0.03590000048279762]},{"ayah_id":"9:63","surah":9,"ayah":63,"arabic":"أَلَمْ يَعْلَمُوا أَنَّهُ مَن يُحَادِدِ اللَّهَ وَرَسُولَهُ فَأَنَّ لَهُ نَارَ جَهَنَّمَ خَالِدًا فِيهَا ۚ ذَٰلِكَ الْخِزْيُ الْعَظِيمُ","english":"Do they not know that he who opposes Allah and His Messenger (blessings and peace be upon him), the Fire of Hell is (destined) for him wherein he will dwell forever? There is no humiliation greater than this.","vec_preview":[-9.999999747378752e-05,0.005900000222027302,-0.026000000536441803,0.019099999219179153,0.04410000145435333,-0.04699999839067459,-0.01810000091791153,-0.03370000049471855]},{"ayah_id":"9:64","surah":9,"ayah":64,"arabic":"يَحْذَرُ الْمُنَافِقُونَ أَن تُنَزَّلَ عَلَيْهِمْ سُورَةٌ تُنَبِّئُهُم بِمَا فِي قُلُوبِهِمْ ۚ قُلِ اسْتَهْزِئُوا إِنَّ اللَّهَ مُخْرِجٌ مَّا تَحْذَرُونَ","english":"The hypocrites feel scared that a Sura (Chapter) will be sent down to the Muslims, and that will make them aware of those matters that are (hidden) in the hearts (of the hypocrites). Say: ‘Continue mocking. Surely, Allah is about to reveal that (matter) which you are scared of.’","vec_preview":[-0.0044999998062849045,0.03150000050663948,-0.0357000008225441,-0.012799999676644802,0.04809999838471413,-0.030400000512599945,-0.019200000911951065,-0.061799999326467514]},{"ayah_id":"9:65","surah":9,"ayah":65,"arabic":"وَلَئِن سَأَلْتَهُمْ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلْعَبُ ۚ قُلْ أَبِاللَّهِ وَآيَاتِهِ وَرَسُولِهِ كُنتُمْ تَسْتَهْزِئُونَ","english":"If you ask them, they will certainly say: ‘We only used to talk (away the journey) and enjoy.’ Say: ‘Were you mocking Allah, His Revelations and His Messenger (blessings and peace be upon him)?’","vec_preview":[0.012000000104308128,-0.013799999840557575,-0.02019999921321869,0.00019999999494757503,0.03440000116825104,-0.025200000032782555,-0.021700000390410423,-0.03669999912381172]},{"ayah_id":"9:66","surah":9,"ayah":66,"arabic":"لَا تَعْتَذِرُوا قَدْ كَفَرْتُم بَعْدَ إِيمَانِكُمْ ۚ إِن نَّعْفُ عَن طَائِفَةٍ مِّنكُمْ نُعَذِّبْ طَائِفَةً بِأَنَّهُمْ كَانُوا مُجْرِمِينَ","english":"(Now) do not make excuses. You have certainly become disbelievers after (showing that) you believed. If We forgive a party of you, (even then) We shall torment the other party because they sinned.","vec_preview":[0.004100000020116568,0.007000000216066837,-0.0414000004529953,-0.0031999999191612005,0.03689999878406525,-0.0406000018119812,-0.02810000069439411,-0.048700001090765]},{"ayah_id":"9:67","surah":9,"ayah":67,"arabic":"الْمُنَافِقُونَ وَالْمُنَافِقَاتُ بَعْضُهُم مِّن بَعْضٍ ۚ يَأْمُرُونَ بِالْمُنكَرِ وَيَنْهَوْنَ عَنِ الْمَعْرُوفِ وَيَقْبِضُونَ أَيْدِيَهُمْ ۚ نَسُوا اللَّهَ فَنَسِيَهُمْ ۗ إِنَّ الْمُنَافِقِينَ هُمُ الْفَاسِقُونَ","english":"The hypocrites, men and women, are one from another (alike). They command evil and forbid good and are close-fisted (in the matter of spending in the cause of Allah). They have forgotten Allah, so Allah has forgotten them. It is indeed the hypocrites who are disobedient.","vec_preview":[-0.0005000000237487257,0.03970000147819519,-0.029400000348687172,-0.014299999922513962,0.04349999874830246,-0.04010000079870224,-0.011900000274181366,-0.03799999877810478]},{"ayah_id":"9:68","surah":9,"ayah":68,"arabic":"وَعَدَ اللَّهُ الْمُنَافِقِينَ وَالْمُنَافِقَاتِ وَالْكُفَّارَ نَارَ جَهَنَّمَ خَالِدِينَ فِيهَا ۚ هِيَ حَسْبُهُمْ ۚ وَلَعَنَهُمُ اللَّهُ ۖ وَلَهُمْ عَذَابٌ مُّقِيمٌ","english":"Allah has promised the hypocrites, men and women, and the disbelievers, the Fire of Hell in which (they) will live forever. That (Fire) will suffice them. And Allah has cast His curse upon them, and for them is a torment that will last forever.","vec_preview":[0.0,0.025499999523162842,-0.031599998474121094,0.002899999963119626,0.03579999879002571,-0.053300000727176666,-0.011599999852478504,-0.02800000086426735]},{"ayah_id":"9:69","surah":9,"ayah":69,"arabic":"كَالَّذِينَ مِن قَبْلِكُمْ كَانُوا أَشَدَّ مِنكُمْ قُوَّةً وَأَكْثَرَ أَمْوَالًا وَأَوْلَادًا فَاسْتَمْتَعُوا بِخَلَاقِهِمْ فَاسْتَمْتَعْتُم بِخَلَاقِكُمْ كَمَا اسْتَمْتَعَ الَّذِينَ مِن قَبْلِكُم بِخَلَاقِهِمْ وَخُضْتُمْ كَالَّذِي خَاضُوا ۚ أُولَـٰئِكَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْآخِرَةِ ۖ وَأُولَـٰئِكَ هُمُ الْخَاسِرُونَ","english":"(O hypocrites!) You are like those who preceded you. They were far mightier than you in power and far richer in possessions and progeny. They benefited by their share (of the world); so are you (too) enjoying your portion (the same way) as your predecessors enjoyed their fixed share (of the worldly pleasures). Moreover, you (in like manner) have deeply indulged in falsehood as they deeply indulged in falsehood. Their works have gone fruitless in this world and in the Hereafter, and they are the ones who are the losers.","vec_preview":[0.011800000444054604,0.01889999955892563,-0.02800000086426735,0.011800000444054604,0.032099999487400055,-0.06440000236034393,-0.016699999570846558,-0.040800001472234726]},{"ayah_id":"9:70","surah":9,"ayah":70,"arabic":"أَلَمْ يَأْتِهِمْ نَبَأُ الَّذِينَ مِن قَبْلِهِمْ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَقَوْمِ إِبْرَاهِيمَ وَأَصْحَابِ مَدْيَنَ وَالْمُؤْتَفِكَاتِ ۚ أَتَتْهُمْ رُسُلُهُم بِالْبَيِّنَاتِ ۖ فَمَا كَانَ اللَّهُ لِيَظْلِمَهُمْ وَلَـٰكِن كَانُوا أَنفُسَهُمْ يَظْلِمُونَ","english":"Has the news not reached them of those who were before them—the people of Nuh (Noah), ‘Ad and Thamud and the people of Ibrahim (Abraham) and the citizens of Madyan and the dwellers of the towns which were overturned? Their Messengers (too) came to them with clear signs (but they disobeyed). So, it was not Allah’s glory to wrong them, but it was they who used to wrong themselves (because of rejecting the truth).","vec_preview":[0.018300000578165054,0.008500000461935997,-0.029100000858306885,-0.004800000227987766,0.03220000118017197,-0.048500001430511475,-0.030799999833106995,-0.03739999979734421]},{"ayah_id":"9:71","surah":9,"ayah":71,"arabic":"وَالْمُؤْمِنُونَ وَالْمُؤْمِنَاتُ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ يَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ وَيُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَيُطِيعُونَ اللَّهَ وَرَسُولَهُ ۚ أُولَـٰئِكَ سَيَرْحَمُهُمُ اللَّهُ ۗ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ","english":"The believers, men and women, are helpers and friends to one another. They command good and forbid evil and establish Prayer and pay Zakat (the Alms-due) and obey Allah and His Messenger (blessings and peace be upon him). It is they on whom Allah will soon shower His Mercy. Surely, Allah is Almighty, Most Wise.","vec_preview":[0.013299999758601189,0.027400000020861626,-0.03869999945163727,0.0015999999595806003,0.032499998807907104,-0.04390000179409981,-0.024000000208616257,-0.04450000077486038]},{"ayah_id":"9:72","surah":9,"ayah":72,"arabic":"وَعَدَ اللَّهُ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ۚ وَرِضْوَانٌ مِّنَ اللَّهِ أَكْبَرُ ۚ ذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ","english":"Allah has promised the believers, men and women, Gardens with streams flowing beneath. They will dwell therein forever. And (He has also promised) blessed mansions located at a special site in Paradise amidst evergreen Gardens, and (then) the greatest (bliss of all) is the pleasure and acceptance of Allah (which will be awarded as a mighty compensation). This indeed is the highest achievement.","vec_preview":[0.018200000748038292,0.026799999177455902,-0.028599999845027924,-0.009700000286102295,0.04309999942779541,-0.03519999980926514,-0.02319999970495701,-0.03220000118017197]},{"ayah_id":"9:73","surah":9,"ayah":73,"arabic":"يَا أَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ ۚ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمَصِيرُ","english":"O (Glorious) Messenger! Fight against the disbelievers and the hypocrites, and treat them harshly (for violating peace, creating disorder and committing militancy and aggression). And Hell is their abode and that is an evil abode.","vec_preview":[0.0210999995470047,-0.002400000113993883,-0.029999999329447746,0.014600000344216824,0.020899999886751175,-0.05249999836087227,-0.012000000104308128,-0.03189999982714653]},{"ayah_id":"9:74","surah":9,"ayah":74,"arabic":"يَحْلِفُونَ بِاللَّهِ مَا قَالُوا وَلَقَدْ قَالُوا كَلِمَةَ الْكُفْرِ وَكَفَرُوا بَعْدَ إِسْلَامِهِمْ وَهَمُّوا بِمَا لَمْ يَنَالُوا ۚ وَمَا نَقَمُوا إِلَّا أَنْ أَغْنَاهُمُ اللَّهُ وَرَسُولُهُ مِن فَضْلِهِ ۚ فَإِن يَتُوبُوا يَكُ خَيْرًا لَّهُمْ ۖ وَإِن يَتَوَلَّوْا يُعَذِّبْهُمُ اللَّهُ عَذَابًا أَلِيمًا فِي الدُّنْيَا وَالْآخِرَةِ ۚ وَمَا لَهُمْ فِي الْأَرْضِ مِن وَلِيٍّ وَلَا نَصِيرٍ","english":"(These hypocrites) swear by Allah that they have not said (anything), whereas they have definitely uttered blasphemy and have become disbelievers after (showing) their belief in Islam. They intended (many tortures too) that they could not achieve. And (out of Islam and the Messenger’s conduct) they could not disdain anything, except that Allah and His Messenger (blessings and peace be upon him) had made them affluent with His bounty. So if they repent (even now), it will be better for them, but if they remain averse (the same way), then Allah will afflict them with grievous torment, (both) in (the life of) this world and in the Hereafter, and they will not have any helper or friend on earth.","vec_preview":[0.010099999606609344,0.020999999716877937,-0.04360000044107437,0.0027000000700354576,0.03550000116229057,-0.055799998342990875,-0.014299999922513962,-0.02419999986886978]},{"ayah_id":"9:75","surah":9,"ayah":75,"arabic":"۞ وَمِنْهُم مَّنْ عَاهَدَ اللَّهَ لَئِنْ آتَانَا مِن فَضْلِهِ لَنَصَّدَّقَنَّ وَلَنَكُونَنَّ مِنَ الصَّالِحِينَ","english":"And amongst these (hypocrites) are also (some) who made a promise with Allah: ‘If He bestows upon us (riches) out of His bounty, we shall certainly give alms (in His way) and become of the righteous.’","vec_preview":[-0.0017999999690800905,-0.004999999888241291,-0.027499999850988388,-0.00800000037997961,0.03779999911785126,-0.019099999219179153,-0.03139999881386757,-0.05820000171661377]},{"ayah_id":"9:76","surah":9,"ayah":76,"arabic":"فَلَمَّا آتَاهُم مِّن فَضْلِهِ بَخِلُوا بِهِ وَتَوَلَّوا وَّهُم مُّعْرِضُونَ","english":"So when He conferred on them (wealth) out of His bounty, they became miserly with it and turned back, retracting (from their promise).","vec_preview":[0.007499999832361937,0.013700000010430813,-0.04529999941587448,0.026900000870227814,0.01269999984651804,-0.017400000244379044,-0.023900000378489494,-0.04569999873638153]},{"ayah_id":"9:77","surah":9,"ayah":77,"arabic":"فَأَعْقَبَهُمْ نِفَاقًا فِي قُلُوبِهِمْ إِلَىٰ يَوْمِ يَلْقَوْنَهُ بِمَا أَخْلَفُوا اللَّهَ مَا وَعَدُوهُ وَبِمَا كَانُوا يَكْذِبُونَ","english":"So He made hypocrisy in their hearts a consequence (of their own niggardliness) till the Day when they would meet Him, because they violated the promise they had made with Allah and (also) because they used to tell lies.","vec_preview":[-0.007600000128149986,0.026200000196695328,-0.031199999153614044,-0.011099999770522118,0.01769999973475933,-0.02419999986886978,-0.03629999980330467,-0.04529999941587448]},{"ayah_id":"9:78","surah":9,"ayah":78,"arabic":"أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ سِرَّهُمْ وَنَجْوَاهُمْ وَأَنَّ اللَّهَ عَلَّامُ الْغُيُوبِ","english":"Do they not know that Allah is aware of their secrets and their whisperings and that Allah knows best all unseen things?","vec_preview":[-0.011500000022351742,0.008100000210106373,-0.02449999935925007,0.010999999940395355,0.034699998795986176,-0.04340000078082085,-0.026100000366568565,-0.03319999948143959]},{"ayah_id":"9:79","surah":9,"ayah":79,"arabic":"الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ فِي الصَّدَقَاتِ وَالَّذِينَ لَا يَجِدُونَ إِلَّا جُهْدَهُمْ فَيَسْخَرُونَ مِنْهُمْ ۙ سَخِرَ اللَّهُ مِنْهُمْ وَلَهُمْ عَذَابٌ أَلِيمٌ","english":"The people who accuse (of pretentiousness and compulsion) those of the believers who give alms happily and willingly in (their) charity works, and also (blame) those (destitute Muslims) who find nothing (more to give) except for their toil and hard work, and (also) mock their (sentiment for spending in the cause of Allah), Allah will punish them for their scoffing, and there is for them a grievous punishment.","vec_preview":[0.0066999997943639755,0.024700000882148743,-0.03720000013709068,0.00800000037997961,0.04390000179409981,-0.038600001484155655,-0.03020000085234642,-0.04100000113248825]},{"ayah_id":"9:80","surah":9,"ayah":80,"arabic":"اسْتَغْفِرْ لَهُمْ أَوْ لَا تَسْتَغْفِرْ لَهُمْ إِن تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَن يَغْفِرَ اللَّهُ لَهُمْ ۚ ذَٰلِكَ بِأَنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ","english":"Whether or not you seek forgiveness for these (wicked and arrogant hypocrites who dare scoff at Your Eminence), if you implore forgiveness for them seventy times (out of your natural compassion and your benevolent practice of forgiving and forbearing), even then Allah will not forgive them at all because they have rejected Allah and His Messenger (blessings and peace be upon him) and Allah does not guide the rebels.","vec_preview":[0.005100000184029341,0.0203000009059906,-0.04019999876618385,-0.020600000396370888,0.03629999980330467,-0.037300001829862595,-0.014399999752640724,-0.04039999842643738]},{"ayah_id":"9:81","surah":9,"ayah":81,"arabic":"فَرِحَ الْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلَافَ رَسُولِ اللَّهِ وَكَرِهُوا أَن يُجَاهِدُوا بِأَمْوَالِهِمْ وَأَنفُسِهِمْ فِي سَبِيلِ اللَّهِ وَقَالُوا لَا تَنفِرُوا فِي الْحَرِّ ۗ قُلْ نَارُ جَهَنَّمَ أَشَدُّ حَرًّا ۚ لَّوْ كَانُوا يَفْقَهُونَ","english":"(These hypocrites) who stayed back (from fighting) due to opposing Allah’s Messenger are rejoicing over their sitting behind. They disliked it that they should strive in the cause of Allah with their wealth and their lives and said: ‘Do not move out in this heat.’ Say: ‘The Fire of Hell is far fiercer in heat.’ (How good it would be) if they could only understand!","vec_preview":[-0.008500000461935997,0.025599999353289604,-0.039400000125169754,-0.010099999606609344,0.03099999949336052,-0.05299999937415123,-0.01600000075995922,-0.043299999088048935]},{"ayah_id":"9:82","surah":9,"ayah":82,"arabic":"فَلْيَضْحَكُوا قَلِيلًا وَلْيَبْكُوا كَثِيرًا جَزَاءً بِمَا كَانُوا يَكْسِبُونَ","english":"So they should laugh for a while and weep for long (because they will have to weep for long in the Hereafter) as a recompense for what they used to earn.","vec_preview":[0.02239999920129776,0.01679999940097332,-0.03660000115633011,-0.0066999997943639755,0.03350000083446503,-0.003700000001117587,-0.021400000900030136,-0.04230000078678131]},{"ayah_id":"9:83","surah":9,"ayah":83,"arabic":"فَإِن رَّجَعَكَ اللَّهُ إِلَىٰ طَائِفَةٍ مِّنْهُمْ فَاسْتَأْذَنُوكَ لِلْخُرُوجِ فَقُل لَّن تَخْرُجُوا مَعِيَ أَبَدًا وَلَن تُقَاتِلُوا مَعِيَ عَدُوًّا ۖ إِنَّكُمْ رَضِيتُم بِالْقُعُودِ أَوَّلَ مَرَّةٍ فَاقْعُدُوا مَعَ الْخَالِفِينَ","english":"So, (O Beloved,) if Allah again takes you back to a party of these (hypocrites, when you are free from the battle of Tabuk,) and they seek your permission to go forth (to fight in the event of a future conflict), then say to them: ‘(Now) you shall never go forth with me, nor shall you ever accompany me to fight an enemy (because, abandoning the sacred struggle,) you rejoiced over sitting behind the first time. So, (this time as well,) stay behind along with those who remain behind.’","vec_preview":[-0.009200000204145908,0.00800000037997961,-0.04179999977350235,0.010599999688565731,0.06019999831914902,-0.03539999946951866,-0.00800000037997961,-0.0544000007212162]},{"ayah_id":"9:84","surah":9,"ayah":84,"arabic":"وَلَا تُصَلِّ عَلَىٰ أَحَدٍ مِّنْهُم مَّاتَ أَبَدًا وَلَا تَقُمْ عَلَىٰ قَبْرِهِ ۖ إِنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ وَمَاتُوا وَهُمْ فَاسِقُونَ","english":"And never perform (funeral) Prayer over any of these (hypocrites) who dies, nor stand at his grave (because your stepping on some place also brings about mercy and blessings, and they do not deserve your mercy and blessing). Indeed, they disbelieved in Allah and His Messenger (blessings and peace be upon him) and died in a state of defiance.","vec_preview":[0.004399999976158142,0.017799999564886093,-0.04839999973773956,0.006000000052154064,0.019500000402331352,-0.05209999904036522,-0.02319999970495701,-0.0284000001847744]},{"ayah_id":"9:85","surah":9,"ayah":85,"arabic":"وَلَا تُعْجِبْكَ أَمْوَالُهُمْ وَأَوْلَادُهُمْ ۚ إِنَّمَا يُرِيدُ اللَّهُ أَن يُعَذِّبَهُم بِهَا فِي الدُّنْيَا وَتَزْهَقَ أَنفُسُهُمْ وَهُمْ كَافِرُونَ","english":"Let not their riches and their progeny make you wonder. Allah wants only to torment them in this world (too) by means of these things, and that their souls may depart whilst they are (still) disbelievers.","vec_preview":[-0.001500000013038516,0.02539999969303608,-0.023099999874830246,0.01889999955892563,0.021700000390410423,-0.043299999088048935,-0.00139999995008111,-0.04089999943971634]},{"ayah_id":"9:86","surah":9,"ayah":86,"arabic":"وَإِذَا أُنزِلَتْ سُورَةٌ أَنْ آمِنُوا بِاللَّهِ وَجَاهِدُوا مَعَ رَسُولِهِ اسْتَأْذَنَكَ أُولُو الطَّوْلِ مِنْهُمْ وَقَالُوا ذَرْنَا نَكُن مَّعَ الْقَاعِدِينَ","english":"And when (such) a Sura (Chapter) is revealed: ‘Believe in Allah and fight in the cause of Allah along with His Messenger (blessings and peace be upon him),’ the affluent and the influential amongst them seek leave from you and say: ‘Leave us. We shall remain with those who sit (behind).’","vec_preview":[-0.008999999612569809,0.0017000000225380063,-0.02590000070631504,-0.0019000000320374966,0.0340999998152256,-0.03200000151991844,-0.0044999998062849045,-0.05299999937415123]},{"ayah_id":"9:87","surah":9,"ayah":87,"arabic":"رَضُوا بِأَن يَكُونُوا مَعَ الْخَوَالِفِ وَطُبِعَ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَفْقَهُونَ","english":"They liked that they would be with those women, children and the handicapped who would stay behind. And their hearts have been sealed, so they do not understand anything.","vec_preview":[-0.0027000000700354576,0.0013000000035390258,-0.0421999990940094,0.005100000184029341,0.03269999846816063,-0.024700000882148743,-0.03400000184774399,-0.04010000079870224]},{"ayah_id":"9:88","surah":9,"ayah":88,"arabic":"لَـٰكِنِ الرَّسُولُ وَالَّذِينَ آمَنُوا مَعَهُ جَاهَدُوا بِأَمْوَالِهِمْ وَأَنفُسِهِمْ ۚ وَأُولَـٰئِكَ لَهُمُ الْخَيْرَاتُ ۖ وَأُولَـٰئِكَ هُمُ الْمُفْلِحُونَ","english":"But the Messenger (blessings and peace be upon him) and those who believed with him fight in the cause of Allah with their material and human resources. And for them are all good things, and they are the ones who will achieve their goal.","vec_preview":[0.03350000083446503,0.002899999963119626,-0.029200000688433647,0.008299999870359898,0.00279999990016222,-0.066600002348423,-0.0066999997943639755,-0.03889999911189079]},{"ayah_id":"9:89","surah":9,"ayah":89,"arabic":"أَعَدَّ اللَّهُ لَهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ","english":"Allah has prepared for them Gardens beneath which streams flow. They are their permanent residents. This indeed is a colossal achievement.","vec_preview":[0.020400000736117363,0.004999999888241291,-0.029400000348687172,-0.013199999928474426,0.04529999941587448,-0.033900000154972076,-0.01590000092983246,-0.04170000180602074]},{"ayah_id":"9:90","surah":9,"ayah":90,"arabic":"وَجَاءَ الْمُعَذِّرُونَ مِنَ الْأَعْرَابِ لِيُؤْذَنَ لَهُمْ وَقَعَدَ الَّذِينَ كَذَبُوا اللَّهَ وَرَسُولَهُ ۚ سَيُصِيبُ الَّذِينَ كَفَرُوا مِنْهُمْ عَذَابٌ أَلِيمٌ","english":"And a few feigners from amongst the desert nomads came (to the Holy Messenger [blessings and peace be upon him] to submit their excuse) so that they might (also) be accorded permission, and those who lied to Allah and His Messenger (in their claim to be the believers) stayed behind (having forsaken the fight). Those of them who denied the truth will soon be seized by a painful torment.","vec_preview":[0.021199999377131462,0.019600000232458115,-0.04039999842643738,-0.0017000000225380063,0.017899999395012856,-0.03359999880194664,-0.012000000104308128,-0.04259999841451645]},{"ayah_id":"9:91","surah":9,"ayah":91,"arabic":"لَّيْسَ عَلَى الضُّعَفَاءِ وَلَا عَلَى الْمَرْضَىٰ وَلَا عَلَى الَّذِينَ لَا يَجِدُونَ مَا يُنفِقُونَ حَرَجٌ إِذَا نَصَحُوا لِلَّهِ وَرَسُولِهِ ۚ مَا عَلَى الْمُحْسِنِينَ مِن سَبِيلٍ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ","english":"There is no sin on the aged (i.e., the weak) and the sick, nor on those who are not so (affluent) that they may spend, while they are most sincerely and truly devoted to Allah and His Messenger (blessings and peace be upon him). No way can the righteous (i.e., the spiritually excellent) be blamed and Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.007499999832361937,0.020500000566244125,-0.04259999841451645,-0.004999999888241291,0.019099999219179153,-0.05849999934434891,-0.02070000022649765,-0.0348999984562397]},{"ayah_id":"9:92","surah":9,"ayah":92,"arabic":"وَلَا عَلَى الَّذِينَ إِذَا مَا أَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لَا أَجِدُ مَا أَحْمِلُكُمْ عَلَيْهِ تَوَلَّوا وَّأَعْيُنُهُمْ تَفِيضُ مِنَ الدَّمْعِ حَزَنًا أَلَّا يَجِدُوا مَا يُنفِقُونَ","english":"Nor can (anyway be scoffed or blamed) those who presented themselves to your service (with the purpose) that you may arrange for them mounts (for fighting, because they did not possess any means of conveyance). So you said: ‘I (also) do not find any (additional means) to mount you on.’ Then (with your permission) they returned in such a state that their eyes were streaming with tears in grief (of being deprived of fighting in the cause of Allah: Alas!) They did not have (much) wealth, which they could spend (and manage to take part in the sacred fight).","vec_preview":[0.011500000022351742,0.027799999341368675,-0.030899999663233757,-0.014999999664723873,0.03359999880194664,-0.04360000044107437,-0.039400000125169754,-0.052000001072883606]},{"ayah_id":"9:93","surah":9,"ayah":93,"arabic":"۞ إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَسْتَأْذِنُونَكَ وَهُمْ أَغْنِيَاءُ ۚ رَضُوا بِأَن يَكُونُوا مَعَ الْخَوَالِفِ وَطَبَعَ اللَّهُ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَعْلَمُونَ","english":"(Blame) lies only on those who seek your permission though they are affluent. They feel pleased to remain with the women and the handicapped who stay behind. Allah has sealed their hearts, so they do not understand (what the true loss or gain is).","vec_preview":[0.023900000378489494,0.027699999511241913,-0.026399999856948853,0.004999999888241291,0.03099999949336052,-0.047200001776218414,-0.020600000396370888,-0.03790000081062317]},{"ayah_id":"9:94","surah":9,"ayah":94,"arabic":"يَعْتَذِرُونَ إِلَيْكُمْ إِذَا رَجَعْتُمْ إِلَيْهِمْ ۚ قُل لَّا تَعْتَذِرُوا لَن نُّؤْمِنَ لَكُمْ قَدْ نَبَّأَنَا اللَّهُ مِنْ أَخْبَارِكُمْ ۚ وَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ ثُمَّ تُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ","english":"(O Muslims!) When you return to them (from the expedition of Tabuk), they will offer their apologies to you. (O Beloved!) Say: ‘Do not make excuses; we will not believe you at all. Allah has informed us about your state of affairs. Now (in the future) Allah as well as His Messenger will see your performance (in the world). Then (in the Hereafter too) you will be returned to (the Lord) Who knows everything hidden and manifest, and He will make you know (all your works) that you used to do.’","vec_preview":[0.022299999371170998,0.00279999990016222,-0.034299999475479126,-0.011300000362098217,0.03480000048875809,-0.027899999171495438,-0.0035000001080334187,-0.057999998331069946]},{"ayah_id":"9:95","surah":9,"ayah":95,"arabic":"سَيَحْلِفُونَ بِاللَّهِ لَكُمْ إِذَا انقَلَبْتُمْ إِلَيْهِمْ لِتُعْرِضُوا عَنْهُمْ ۖ فَأَعْرِضُوا عَنْهُمْ ۖ إِنَّهُمْ رِجْسٌ ۖ وَمَأْوَاهُمْ جَهَنَّمُ جَزَاءً بِمَا كَانُوا يَكْسِبُونَ","english":"Now they will swear to you by Allah, when you return to them, so that you may excuse them. So be indifferent to them. Surely, they are unclean and Hell is their abode, a reward for what they used to earn.","vec_preview":[0.006300000008195639,0.010599999688565731,-0.04529999941587448,0.002300000051036477,0.03880000114440918,-0.05299999937415123,0.0017999999690800905,-0.044199999421834946]},{"ayah_id":"9:96","surah":9,"ayah":96,"arabic":"يَحْلِفُونَ لَكُمْ لِتَرْضَوْا عَنْهُمْ ۖ فَإِن تَرْضَوْا عَنْهُمْ فَإِنَّ اللَّهَ لَا يَرْضَىٰ عَنِ الْقَوْمِ الْفَاسِقِينَ","english":"They swear to you so that you may feel pleased with them. So, (O Muslims,) if you are pleased with them, (even) then Allah will not be pleased with the disobedient people.","vec_preview":[-0.005100000184029341,0.016899999231100082,-0.03709999844431877,-0.01489999983459711,0.03539999946951866,-0.037300001829862595,-0.01940000057220459,-0.034299999475479126]},{"ayah_id":"9:97","surah":9,"ayah":97,"arabic":"الْأَعْرَابُ أَشَدُّ كُفْرًا وَنِفَاقًا وَأَجْدَرُ أَلَّا يَعْلَمُوا حُدُودَ مَا أَنزَلَ اللَّهُ عَلَىٰ رَسُولِهِ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","english":"(These) nomad villagers are unyielding disbelievers and incorrigible hypocrites. And (due to their stubbornness in disbelief and hypocrisy) they deserve to remain ignorant of those limits and commandments which Allah has sent down to His Messenger (blessings and peace be upon him). And Allah is All-Knowing, Most Wise.","vec_preview":[-0.003100000089034438,0.025299999862909317,-0.030400000512599945,0.013799999840557575,0.010900000110268593,-0.031599998474121094,-0.015300000086426735,-0.024800000712275505]},{"ayah_id":"9:98","surah":9,"ayah":98,"arabic":"وَمِنَ الْأَعْرَابِ مَن يَتَّخِذُ مَا يُنفِقُ مَغْرَمًا وَيَتَرَبَّصُ بِكُمُ الدَّوَائِرَ ۚ عَلَيْهِمْ دَائِرَةُ السَّوْءِ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ","english":"And amongst these nomad villagers there is (also) one who regards that (money) which he spends (in the cause of Allah) as a compulsory fine, and looks forward to the spinning evil (of miseries and misfortunes) coming upon you. But it is they whom the evil spin (of calamity and ill-fortune) is going to whirl. And Allah is All-Hearing, All-Knowing.","vec_preview":[0.014600000344216824,0.03420000150799751,-0.03909999877214432,-0.007600000128149986,0.027400000020861626,-0.042399998754262924,-0.025699999183416367,-0.03460000082850456]},{"ayah_id":"9:99","surah":9,"ayah":99,"arabic":"وَمِنَ الْأَعْرَابِ مَن يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَيَتَّخِذُ مَا يُنفِقُ قُرُبَاتٍ عِندَ اللَّهِ وَصَلَوَاتِ الرَّسُولِ ۚ أَلَا إِنَّهَا قُرْبَةٌ لَّهُمْ ۚ سَيُدْخِلُهُمُ اللَّهُ فِي رَحْمَتِهِ ۗ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ","english":"And (yet) amongst these nomads there is (also) one who believes in Allah and the Last Day and considers whatever he spends (in the way of Allah) as a means of nearness to Allah and receiving (the merciful) supplications of the Messenger. Listen! Assuredly, it is a source of nearness to Allah. Allah will soon admit them to His mercy. Surely, Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.010200000368058681,0.029999999329447746,-0.03200000151991844,0.006000000052154064,0.017500000074505806,-0.04340000078082085,-0.008299999870359898,-0.03269999846816063]},{"ayah_id":"9:100","surah":9,"ayah":100,"arabic":"وَالسَّابِقُونَ الْأَوَّلُونَ مِنَ الْمُهَاجِرِينَ وَالْأَنصَارِ وَالَّذِينَ اتَّبَعُوهُم بِإِحْسَانٍ رَّضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ وَأَعَدَّ لَهُمْ جَنَّاتٍ تَجْرِي تَحْتَهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ","english":"And the Emigrants and their Supporters (Ansar), the vanguard of the believers, and those who follow them in the grade of spiritual excellence—Allah is well-pleased with them (all) and they (all) are well-pleased with Him. And He has prepared for them Gardens with rivers flowing under them. They will live in them forever. This is indeed a colossal achievement.","vec_preview":[0.020400000736117363,0.013700000010430813,-0.03519999980926514,-0.006099999882280827,0.033900000154972076,-0.05490000173449516,-0.02979999966919422,-0.03180000185966492]},{"ayah_id":"9:101","surah":9,"ayah":101,"arabic":"وَمِمَّنْ حَوْلَكُم مِّنَ الْأَعْرَابِ مُنَافِقُونَ ۖ وَمِنْ أَهْلِ الْمَدِينَةِ ۖ مَرَدُوا عَلَى النِّفَاقِ لَا تَعْلَمُهُمْ ۖ نَحْنُ نَعْلَمُهُمْ ۚ سَنُعَذِّبُهُم مَّرَّتَيْنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٍ","english":"And, (O Muslims,) some amongst the nomad villagers around you and some citizens of Medina as well are hypocrites. They are adamant about hypocrisy. (So far) you know them not; We know them. (Later, the Holy Messenger [blessings and peace be upon him] was also given the knowledge and awareness of all the hypocrites.) Soon shall We torment them twice* (here in this world). Then they will be turned towards a greater torment (on the Day of Rising).","vec_preview":[0.021900000050663948,0.023000000044703484,-0.02889999933540821,-0.0020000000949949026,0.041600000113248825,-0.041999999433755875,-0.017100000753998756,-0.04520000144839287]},{"ayah_id":"9:102","surah":9,"ayah":102,"arabic":"وَآخَرُونَ اعْتَرَفُوا بِذُنُوبِهِمْ خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا عَسَى اللَّهُ أَن يَتُوبَ عَلَيْهِمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ","english":"And there are others (who) have confessed their sins. They have mixed up good deeds with some bad ones (by mistake). Allah will, most likely, accept their repentance. Surely, Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.008700000122189522,0.01489999983459711,-0.03280000016093254,-0.01889999955892563,0.03139999881386757,-0.03779999911785126,-0.016699999570846558,-0.04259999841451645]},{"ayah_id":"9:103","surah":9,"ayah":103,"arabic":"خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيْهِمْ ۖ إِنَّ صَلَاتَكَ سَكَنٌ لَّهُمْ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ","english":"Collect alms (Zakat—the Alms-due) from their wealth so that by these (alms) you may purify them (of their sins) and (by this purification of faith and riches) bestow upon them blessing and pray for them. Surely, your prayer is a (source of) delightful calm for them. And Allah is All-Hearing, All-Knowing.","vec_preview":[0.015399999916553497,0.03370000049471855,-0.02969999983906746,0.008799999952316284,0.02199999988079071,-0.012500000186264515,-0.010300000198185444,-0.044599998742341995]},{"ayah_id":"9:104","surah":9,"ayah":104,"arabic":"أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ هُوَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَأْخُذُ الصَّدَقَاتِ وَأَنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ","english":"Do they not know that indeed He is Allah alone Who accepts the repentance of His servants and takes charity donations (i.e., Zakat and alms with His own Mighty Hand) and that Allah is the One Who is Oft-Relenting, Ever-Merciful?","vec_preview":[0.0024999999441206455,0.019300000742077827,-0.023099999874830246,-0.0038999998942017555,0.03099999949336052,-0.035100001841783524,-0.019300000742077827,-0.041200000792741776]},{"ayah_id":"9:105","surah":9,"ayah":105,"arabic":"وَقُلِ اعْمَلُوا فَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ وَالْمُؤْمِنُونَ ۖ وَسَتُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ","english":"And say: ‘Work. Allah as well as His Messenger (blessings and peace be upon him) and the believers (too) will soon see your work. And you will shortly be returned to (the Lord) Who knows everything veiled and unveiled. So He will inform you of the works that you used to do.’","vec_preview":[0.02160000056028366,-0.004800000227987766,-0.02969999983906746,-0.010599999688565731,0.040699999779462814,-0.035100001841783524,-0.014399999752640724,-0.04170000180602074]},{"ayah_id":"9:106","surah":9,"ayah":106,"arabic":"وَآخَرُونَ مُرْجَوْنَ لِأَمْرِ اللَّهِ إِمَّا يُعَذِّبُهُمْ وَإِمَّا يَتُوبُ عَلَيْهِمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","english":"And there are (yet) others who are deferred, left to the (next) command of Allah. He will either torment them or accept their repentance. And Allah is All-Knowing, Most Wise.","vec_preview":[-0.004999999888241291,0.02539999969303608,-0.02969999983906746,0.013399999588727951,0.025200000032782555,-0.04039999842643738,-0.030899999663233757,-0.03680000081658363]},{"ayah_id":"9:107","surah":9,"ayah":107,"arabic":"وَالَّذِينَ اتَّخَذُوا مَسْجِدًا ضِرَارًا وَكُفْرًا وَتَفْرِيقًا بَيْنَ الْمُؤْمِنِينَ وَإِرْصَادًا لِّمَنْ حَارَبَ اللَّهَ وَرَسُولَهُ مِن قَبْلُ ۚ وَلَيَحْلِفُنَّ إِنْ أَرَدْنَا إِلَّا الْحُسْنَىٰ ۖ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ","english":"And (from amongst the hypocrites there are also those) who have erected a mosque to harm (the Muslims) and (promote) disbelief and disunite the believers, and as an ambush for the one who is already at war against Allah and His Messenger (blessings and peace be upon him). They will surely swear: ‘We have intended nothing but good (by constructing this mosque).’ And Allah bears witness that they are certainly liars.","vec_preview":[0.0024999999441206455,0.010400000028312206,-0.03200000151991844,-0.013700000010430813,0.037700001150369644,-0.04619999974966049,-0.018200000748038292,-0.031300000846385956]},{"ayah_id":"9:108","surah":9,"ayah":108,"arabic":"لَا تَقُمْ فِيهِ أَبَدًا ۚ لَّمَسْجِدٌ أُسِّسَ عَلَى التَّقْوَىٰ مِنْ أَوَّلِ يَوْمٍ أَحَقُّ أَن تَقُومَ فِيهِ ۚ فِيهِ رِجَالٌ يُحِبُّونَ أَن يَتَطَهَّرُوا ۚ وَاللَّهُ يُحِبُّ الْمُطَّهِّرِينَ","english":"(O Beloved!) Never stand in this (building which has been built in the name of a mosque). But the mosque which has been, from the very first day, founded on the fear of Allah has greater right to be honoured with your standing in it. There are people in it who love to remain purified (both physically and spiritually), and Allah loves those who commit themselves to purity.","vec_preview":[-0.004000000189989805,0.016599999740719795,-0.0414000004529953,0.007199999876320362,0.019300000742077827,-0.014700000174343586,-0.016499999910593033,-0.04820000007748604]},{"ayah_id":"9:109","surah":9,"ayah":109,"arabic":"أَفَمَنْ أَسَّسَ بُنْيَانَهُ عَلَىٰ تَقْوَىٰ مِنَ اللَّهِ وَرِضْوَانٍ خَيْرٌ أَم مَّنْ أَسَّسَ بُنْيَانَهُ عَلَىٰ شَفَا جُرُفٍ هَارٍ فَانْهَارَ بِهِ فِي نَارِ جَهَنَّمَ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","english":"Who is better—the one who founds his edifice (i.e., mosque) on the fear of Allah and (His) pleasure and satisfaction, or the one who lays the foundation of his building on the edge of a crumbling precipice? So, that (building) tumbled down with its architect into the Fire of Hell. And Allah does not guide the wrongdoers.","vec_preview":[0.006800000090152025,0.023499999195337296,-0.032099999487400055,0.017500000074505806,0.029400000348687172,-0.050599999725818634,-0.027799999341368675,-0.008899999782443047]},{"ayah_id":"9:110","surah":9,"ayah":110,"arabic":"لَا يَزَالُ بُنْيَانُهُمُ الَّذِي بَنَوْا رِيبَةً فِي قُلُوبِهِمْ إِلَّا أَن تَقَطَّعَ قُلُوبُهُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","english":"Their structure which they have raised (in the name of a mosque) will continue pricking their hearts (due to doubt and hypocrisy), except that their hearts are torn to pieces (due to persistently piercing concerns). And Allah is All-Knowing, Most Wise.","vec_preview":[-0.008799999952316284,0.025100000202655792,-0.01850000023841858,0.016499999910593033,0.0142000000923872,-0.04010000079870224,-0.03099999949336052,-0.03240000084042549]},{"ayah_id":"9:111","surah":9,"ayah":111,"arabic":"۞ إِنَّ اللَّهَ اشْتَرَىٰ مِنَ الْمُؤْمِنِينَ أَنفُسَهُمْ وَأَمْوَالَهُم بِأَنَّ لَهُمُ الْجَنَّةَ ۚ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ فَيَقْتُلُونَ وَيُقْتَلُونَ ۖ وَعْدًا عَلَيْهِ حَقًّا فِي التَّوْرَاةِ وَالْإِنجِيلِ وَالْقُرْآنِ ۚ وَمَنْ أَوْفَىٰ بِعَهْدِهِ مِنَ اللَّهِ ۚ فَاسْتَبْشِرُوا بِبَيْعِكُمُ الَّذِي بَايَعْتُم بِهِ ۚ وَذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ","english":"Surely, Allah has bought from the believers their souls and wealth in return for (the promise of) Paradise for them. (Now) they fight (for the noble cause of peace) in the way of Allah. So they kill (during the war) and are slain (themselves) too. (Allah has taken) the firm promise as a bountiful obligation on Him in the Torah, the Gospel (the Injil) and the Qur’an. And who is truer to his promise than Allah? So, (believers,) rejoice over your bargain against which you have sold (your souls and wealth). This is a colossal achievement.","vec_preview":[0.028999999165534973,0.017100000753998756,-0.024000000208616257,-0.006599999964237213,0.044199999421834946,-0.035599999129772186,-0.0203000009059906,-0.048500001430511475]},{"ayah_id":"9:112","surah":9,"ayah":112,"arabic":"التَّائِبُونَ الْعَابِدُونَ الْحَامِدُونَ السَّائِحُونَ الرَّاكِعُونَ السَّاجِدُونَ الْآمِرُونَ بِالْمَعْرُوفِ وَالنَّاهُونَ عَنِ الْمُنكَرِ وَالْحَافِظُونَ لِحُدُودِ اللَّهِ ۗ وَبَشِّرِ الْمُؤْمِنِينَ","english":"(These believers who have bargained with Allah for the Hereafter are those) who turn to Allah in repentance, and who worship, praise and glorify (Allah), and fast, abstaining from the worldly lusts, and bow down before Him (most humbly and submissively), and who prostrate themselves before Him (seeking His nearness), command good and forbid evil, and guard the limits (set) by Allah. And give glad tidings to these believers.","vec_preview":[0.010099999606609344,0.022099999710917473,-0.03480000048875809,0.003800000064074993,0.033399999141693115,-0.021199999377131462,-0.0272000003606081,-0.05000000074505806]},{"ayah_id":"9:113","surah":9,"ayah":113,"arabic":"مَا كَانَ لِلنَّبِيِّ وَالَّذِينَ آمَنُوا أَن يَسْتَغْفِرُوا لِلْمُشْرِكِينَ وَلَوْ كَانُوا أُولِي قُرْبَىٰ مِن بَعْدِ مَا تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحَابُ الْجَحِيمِ","english":"It is not the glory of the Prophet (blessings and peace be upon him) and the dignity of the believers that they pray for the forgiveness of the polytheists, even though they are kindred, after it has become clear to them that they (the polytheists) are the inmates of Hell.","vec_preview":[0.015200000256299973,-0.005900000222027302,-0.04340000078082085,-0.003100000089034438,0.011900000274181366,-0.05590000003576279,-0.021199999377131462,-0.046300001442432404]},{"ayah_id":"9:114","surah":9,"ayah":114,"arabic":"وَمَا كَانَ اسْتِغْفَارُ إِبْرَاهِيمَ لِأَبِيهِ إِلَّا عَن مَّوْعِدَةٍ وَعَدَهَا إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِّلَّهِ تَبَرَّأَ مِنْهُ ۚ إِنَّ إِبْرَاهِيمَ لَأَوَّاهٌ حَلِيمٌ","english":"And Ibrahim’s (Abraham’s) praying for his father’s (i.e., Azar, his uncle who brought him up) forgiveness was only due to the promise that he had made to him. But when it became evident to him that he was an enemy of Allah, he parted with him (dissociated himself from him and never prayed for him afterwards). Surely, Ibrahim (Abraham) was most compassionate (tender-hearted, tearful) and profoundly forbearing.","vec_preview":[0.007699999958276749,0.024299999698996544,-0.02590000070631504,0.016300000250339508,0.011599999852478504,-0.03779999911785126,-0.022700000554323196,-0.027000000700354576]},{"ayah_id":"9:115","surah":9,"ayah":115,"arabic":"وَمَا كَانَ اللَّهُ لِيُضِلَّ قَوْمًا بَعْدَ إِذْ هَدَاهُمْ حَتَّىٰ يُبَيِّنَ لَهُم مَّا يَتَّقُونَ ۚ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ","english":"And it is not Allah’s Glory to lead a people astray after guiding them aright, until He makes clear to them the things which they should guard against. Surely, Allah knows everything best.","vec_preview":[-0.01549999974668026,0.00279999990016222,-0.01720000058412552,-0.005499999970197678,0.02930000051856041,-0.03269999846816063,-0.02850000001490116,-0.03480000048875809]},{"ayah_id":"9:116","surah":9,"ayah":116,"arabic":"إِنَّ اللَّهَ لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ يُحْيِي وَيُمِيتُ ۚ وَمَا لَكُم مِّن دُونِ اللَّهِ مِن وَلِيٍّ وَلَا نَصِيرٍ","english":"Verily, He is Allah to Whom belongs the sovereignty of the heavens and the earth. He (is the One Who) gives life and causes death. And besides Allah, there is for you no friend or helper (who can support you against Allah’s command).","vec_preview":[0.0044999998062849045,0.012199999764561653,-0.03139999881386757,0.015399999916553497,0.009600000455975533,-0.03460000082850456,-0.004999999888241291,-0.03620000183582306]},{"ayah_id":"9:117","surah":9,"ayah":117,"arabic":"لَّقَد تَّابَ اللَّهُ عَلَى النَّبِيِّ وَالْمُهَاجِرِينَ وَالْأَنصَارِ الَّذِينَ اتَّبَعُوهُ فِي سَاعَةِ الْعُسْرَةِ مِن بَعْدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٍ مِّنْهُمْ ثُمَّ تَابَ عَلَيْهِمْ ۚ إِنَّهُ بِهِمْ رَءُوفٌ رَّحِيمٌ","english":"Surely, Allah turned in His mercy towards the Prophet (blessings and peace be upon him) and (also) towards the Emigrants and the Helpers who followed him (even) in the hour of distress (of the battle of Tabuk), after (the situation emerged wherein) the hearts of a party of them had nearly deviated. Then He turned towards them with bestowal and mercy. Allah is indeed Most Compassionate and Ever-Merciful towards them.","vec_preview":[0.022199999541044235,0.01769999973475933,-0.025200000032782555,-0.010400000028312206,0.03680000081658363,-0.03400000184774399,-0.022099999710917473,-0.035599999129772186]},{"ayah_id":"9:118","surah":9,"ayah":118,"arabic":"وَعَلَى الثَّلَاثَةِ الَّذِينَ خُلِّفُوا حَتَّىٰ إِذَا ضَاقَتْ عَلَيْهِمُ الْأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنفُسُهُمْ وَظَنُّوا أَن لَّا مَلْجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا ۚ إِنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ","english":"And (He also turned towards) those three persons (with merciful compassion) whose (decision) was deferred until, when the earth, despite all its vastness, closed in upon them, and their (own) souls (too) became cumbersome for them, and they knew for sure that there is no refuge from (the torment of) Allah except in (turning towards) Him. Allah then inclined towards them in bestowal and kindness so that they (too) might persevere with repentance and inclination. Surely, Allah is the One Who is Most Relenting, Ever-Merciful.","vec_preview":[-0.003000000026077032,0.01759999990463257,-0.037300001829862595,-0.017899999395012856,0.030899999663233757,-0.03669999912381172,-0.024399999529123306,-0.04340000078082085]},{"ayah_id":"9:119","surah":9,"ayah":119,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ","english":"O believers! Fear Allah persistently, and remain in the (company) of those who uphold the truth.","vec_preview":[0.00930000003427267,0.008899999782443047,-0.0364999994635582,-0.01119999960064888,0.045099999755620956,-0.014100000262260437,-0.03240000084042549,-0.050200000405311584]},{"ayah_id":"9:120","surah":9,"ayah":120,"arabic":"مَا كَانَ لِأَهْلِ الْمَدِينَةِ وَمَنْ حَوْلَهُم مِّنَ الْأَعْرَابِ أَن يَتَخَلَّفُوا عَن رَّسُولِ اللَّهِ وَلَا يَرْغَبُوا بِأَنفُسِهِمْ عَن نَّفْسِهِ ۚ ذَٰلِكَ بِأَنَّهُمْ لَا يُصِيبُهُمْ ظَمَأٌ وَلَا نَصَبٌ وَلَا مَخْمَصَةٌ فِي سَبِيلِ اللَّهِ وَلَا يَطَئُونَ مَوْطِئًا يَغِيظُ الْكُفَّارَ وَلَا يَنَالُونَ مِنْ عَدُوٍّ نَّيْلًا إِلَّا كُتِبَ لَهُم بِهِ عَمَلٌ صَالِحٌ ۚ إِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ","english":"It was unbecoming the people of Medina and the villagers (inhabitants) of the suburbs to lag behind (stepping aside from) Allah’s Messenger (blessings and peace be upon him), nor to feel for their own souls greater concern than his (blessed and sacred) soul. This (command) is because in the cause of Allah (whatever) thirst they suffer, (whatever) turmoil they undergo, (whatever) hunger they endure, and stepping on a track where treading rouses violent reaction amongst the disbelievers, and whatever they receive from the enemy (killing and injury or spoils of war): in recompense of everything is recorded a good deed to their credit. Surely, Allah does not waste the reward of the righteous.","vec_preview":[0.008100000210106373,0.00860000029206276,-0.022600000724196434,-0.005200000014156103,0.024299999698996544,-0.04039999842643738,-0.02329999953508377,-0.03759999945759773]},{"ayah_id":"9:121","surah":9,"ayah":121,"arabic":"وَلَا يُنفِقُونَ نَفَقَةً صَغِيرَةً وَلَا كَبِيرَةً وَلَا يَقْطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمْ لِيَجْزِيَهُمُ اللَّهُ أَحْسَنَ مَا كَانُوا يَعْمَلُونَ","english":"They (who fight in the cause of Allah) do not spend any amount, small or great, nor do they journey through a valley, but that (all this expense and journey) is written down for them so that Allah confers on them the best reward (for every such act) they used to do.","vec_preview":[-0.004100000020116568,0.01860000006854534,-0.037300001829862595,-0.008200000040233135,0.019500000402331352,-0.02879999950528145,-0.008999999612569809,-0.04129999876022339]},{"ayah_id":"9:122","surah":9,"ayah":122,"arabic":"۞ وَمَا كَانَ الْمُؤْمِنُونَ لِيَنفِرُوا كَافَّةً ۚ فَلَوْلَا نَفَرَ مِن كُلِّ فِرْقَةٍ مِّنْهُمْ طَائِفَةٌ لِّيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنذِرُوا قَوْمَهُمْ إِذَا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ","english":"And it is not possible for all the Muslims to set out (together). So, why should a party from within every group (or tribe) not go forth in order that they may acquire deeper knowledge (i.e., thorough understanding and insight) of the Din (Religion), and warn their people when they return to them so that they may guard themselves (against a life of sins and disobedience)?","vec_preview":[-0.002899999963119626,0.023000000044703484,-0.05260000005364418,-0.002899999963119626,0.0333000011742115,-0.04360000044107437,-0.02979999966919422,-0.0471000000834465]},{"ayah_id":"9:123","surah":9,"ayah":123,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا قَاتِلُوا الَّذِينَ يَلُونَكُم مِّنَ الْكُفَّارِ وَلْيَجِدُوا فِيكُمْ غِلْظَةً ۚ وَاعْلَمُوا أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ","english":"O believers! Fight against those of the disbelievers who are around you (i.e., who are directly involved in hostilities and terrorist activities against you). And (fight in a way and at a time that) they find in you toughness (of might, valour and defensive capability). And bear in mind that Allah is with those who guard themselves against evil.","vec_preview":[0.013100000098347664,0.012799999676644802,-0.032099999487400055,-0.0024999999441206455,0.05350000038743019,-0.03150000050663948,-0.023800000548362732,-0.04650000110268593]},{"ayah_id":"9:124","surah":9,"ayah":124,"arabic":"وَإِذَا مَا أُنزِلَتْ سُورَةٌ فَمِنْهُم مَّن يَقُولُ أَيُّكُمْ زَادَتْهُ هَـٰذِهِ إِيمَانًا ۚ فَأَمَّا الَّذِينَ آمَنُوا فَزَادَتْهُمْ إِيمَانًا وَهُمْ يَسْتَبْشِرُونَ","english":"And whenever a Sura (Chapter) is revealed, some of these (hypocrites) say (mischievously): ‘Whose faith amongst you has this (Sura) increased?’ So, this (Sura) has increased the faith of those who have embraced faith and they rejoice (over this boosted state of faith).","vec_preview":[-0.00039999998989515007,0.013500000350177288,-0.029999999329447746,0.003000000026077032,0.032499998807907104,-0.029999999329447746,-0.023800000548362732,-0.04670000076293945]},{"ayah_id":"9:125","surah":9,"ayah":125,"arabic":"وَأَمَّا الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ فَزَادَتْهُمْ رِجْسًا إِلَىٰ رِجْسِهِمْ وَمَاتُوا وَهُمْ كَافِرُونَ","english":"But as for those whose hearts are diseased, this (Sura) has added vileness (and impurity) to their filth (disbelief and hypocrisy). And they died as disbelievers.","vec_preview":[0.009800000116229057,0.027499999850988388,-0.03660000115633011,0.005799999926239252,0.03550000116229057,-0.031199999153614044,-0.03709999844431877,-0.03700000047683716]},{"ayah_id":"9:126","surah":9,"ayah":126,"arabic":"أَوَلَا يَرَوْنَ أَنَّهُمْ يُفْتَنُونَ فِي كُلِّ عَامٍ مَّرَّةً أَوْ مَرَّتَيْنِ ثُمَّ لَا يَتُوبُونَ وَلَا هُمْ يَذَّكَّرُونَ","english":"Do they not see that they are put in trouble once or twice every year? (Even) then they do not repent, nor do they take advice.","vec_preview":[-0.02800000086426735,0.008899999782443047,-0.03480000048875809,-0.010200000368058681,0.014399999752640724,-0.03970000147819519,-0.023800000548362732,-0.06120000034570694]},{"ayah_id":"9:127","surah":9,"ayah":127,"arabic":"وَإِذَا مَا أُنزِلَتْ سُورَةٌ نَّظَرَ بَعْضُهُمْ إِلَىٰ بَعْضٍ هَلْ يَرَاكُم مِّنْ أَحَدٍ ثُمَّ انصَرَفُوا ۚ صَرَفَ اللَّهُ قُلُوبَهُم بِأَنَّهُمْ قَوْمٌ لَّا يَفْقَهُونَ","english":"Whenever a Sura (Chapter) is revealed, they look at one another (and inquire through body language:) ‘Is there anyone watching you?’ Then they turn away. Allah has turned their hearts away because they are the ones who lack understanding.","vec_preview":[0.0008999999845400453,0.022099999710917473,-0.025800000876188278,-0.0019000000320374966,0.026000000536441803,-0.04100000113248825,-0.019600000232458115,-0.04439999908208847]},{"ayah_id":"9:128","surah":9,"ayah":128,"arabic":"لَقَدْ جَاءَكُمْ رَسُولٌ مِّنْ أَنفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيصٌ عَلَيْكُم بِالْمُؤْمِنِينَ رَءُوفٌ رَّحِيمٌ","english":"Surely, a (Glorious) Messenger from amongst yourselves has come to you. Your suffering and distress (becomes) grievously heavy on him (blessings and peace be upon him). (O mankind,) he is ardently desirous of your (betterment and guidance. And) he is most (deeply) clement and merciful to the believers.","vec_preview":[0.029899999499320984,0.021199999377131462,-0.039400000125169754,-0.00989999994635582,0.020400000736117363,-0.041999999433755875,-0.014299999922513962,-0.04179999977350235]},{"ayah_id":"9:129","surah":9,"ayah":129,"arabic":"فَإِن تَوَلَّوْا فَقُلْ حَسْبِيَ اللَّهُ لَا إِلَـٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ","english":"If (in spite of all these favours and blessings) they (still) deviate, then say: ‘Enough for me is Allah. There is no God but He. I have reposed my trust in Him alone, and He is the Lord of the Mighty Throne.’","vec_preview":[0.011900000274181366,0.009200000204145908,-0.025599999353289604,0.01489999983459711,0.03500000014901161,-0.031199999153614044,-0.009200000204145908,-0.04639999940991402]}]