[{"ayah_id":"4:1","surah":4,"ayah":1,"arabic":"يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُم مِّن نَّفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا وَنِسَاءً ۚ وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ ۚ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا","english":"O mankind! Fear your Lord, Who (initiated) your creation from a single soul, then from it created its mate, and from these two spread (the creation of) countless men and women. So, fear Allah for Whose sake you solicit needs from one another. And (become Godfearing) towards your own kith and kin (as well). Allah is indeed Ever-Watchful over you.","vec_preview":[0.02459999918937683,0.023000000044703484,-0.032099999487400055,-0.015200000256299973,0.043800000101327896,-0.033900000154972076,-0.013500000350177288,-0.040699999779462814]},{"ayah_id":"4:2","surah":4,"ayah":2,"arabic":"وَآتُوا الْيَتَامَىٰ أَمْوَالَهُمْ ۖ وَلَا تَتَبَدَّلُوا الْخَبِيثَ بِالطَّيِّبِ ۖ وَلَا تَأْكُلُوا أَمْوَالَهُمْ إِلَىٰ أَمْوَالِكُمْ ۚ إِنَّهُ كَانَ حُوبًا كَبِيرًا","english":"And deliver to the orphans their belongings; and do not exchange the bad for the good; nor consume their wealth by mixing it with your own. Indeed, this is a great sin.","vec_preview":[0.01640000008046627,0.02500000037252903,-0.03610000014305115,-0.005900000222027302,0.030700000002980232,-0.03200000151991844,-0.020899999886751175,-0.05649999901652336]},{"ayah_id":"4:3","surah":4,"ayah":3,"arabic":"وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَىٰ فَانكِحُوا مَا طَابَ لَكُم مِّنَ النِّسَاءِ مَثْنَىٰ وَثُلَاثَ وَرُبَاعَ ۖ فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُوا فَوَاحِدَةً أَوْ مَا مَلَكَتْ أَيْمَانُكُمْ ۚ ذَٰلِكَ أَدْنَىٰ أَلَّا تَعُولُوا","english":"And if you have the apprehension that you will not be able to treat the orphan girls justly, then marry the women you like and who are lawful for you, two or three or four (but this sanction is conditional on justice). But if you fear that you will not be able to treat (more than one wife) justly, then (marry) only one woman or the maids who have come under your possession (according to the Islamic law). This makes it more likely that you restrain yourselves from committing injustice.","vec_preview":[0.02280000038444996,0.017400000244379044,-0.030300000682473183,-0.007000000216066837,0.04690000042319298,-0.031300000846385956,-0.012000000104308128,-0.0608999989926815]},{"ayah_id":"4:4","surah":4,"ayah":4,"arabic":"وَآتُوا النِّسَاءَ صَدُقَاتِهِنَّ نِحْلَةً ۚ فَإِن طِبْنَ لَكُمْ عَن شَيْءٍ مِّنْهُ نَفْسًا فَكُلُوهُ هَنِيئًا مَّرِيئًا","english":"And pay the women their dower with a pleased heart. Then if they forgo for you some (of the dower) out of their own pleasure, you may consume it as pleasant and favourable (for you).","vec_preview":[0.007499999832361937,0.024900000542402267,-0.04430000111460686,-0.005100000184029341,0.029999999329447746,-0.01510000042617321,-0.03229999914765358,-0.04800000041723251]},{"ayah_id":"4:5","surah":4,"ayah":5,"arabic":"وَلَا تُؤْتُوا السُّفَهَاءَ أَمْوَالَكُمُ الَّتِي جَعَلَ اللَّهُ لَكُمْ قِيَامًا وَارْزُقُوهُمْ فِيهَا وَاكْسُوهُمْ وَقُولُوا لَهُمْ قَوْلًا مَّعْرُوفًا","english":"And do not entrust to the mentally deficient your (or their) assets which Allah has made a means of stability for your economy. However, feed them out of it and clothe them, and say to them good and nice words.","vec_preview":[0.010099999606609344,0.01899999938905239,-0.0284000001847744,-0.011900000274181366,0.030700000002980232,-0.02410000003874302,-0.00930000003427267,-0.05040000006556511]},{"ayah_id":"4:6","surah":4,"ayah":6,"arabic":"وَابْتَلُوا الْيَتَامَىٰ حَتَّىٰ إِذَا بَلَغُوا النِّكَاحَ فَإِنْ آنَسْتُم مِّنْهُمْ رُشْدًا فَادْفَعُوا إِلَيْهِمْ أَمْوَالَهُمْ ۖ وَلَا تَأْكُلُوهَا إِسْرَافًا وَبِدَارًا أَن يَكْبَرُوا ۚ وَمَن كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ ۖ وَمَن كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ ۚ فَإِذَا دَفَعْتُمْ إِلَيْهِمْ أَمْوَالَهُمْ فَأَشْهِدُوا عَلَيْهِمْ ۚ وَكَفَىٰ بِاللَّهِ حَسِيبًا","english":"And evaluate and test the orphans (for the sake of their training) till they attain to (the age of) marriage. Then if you discern in them ingenuity (and the knack of planning), hand over their assets to them. And devour not their wealth spending it wastefully and in haste (fearing that after) they grow mature (they will take it back). The one who is affluent must absolutely abstain (from the orphan’s property), but he who is indigent (himself) should consume but a fair portion of it (only). And when you return to them their assets, take witnesses over them. And Sufficient is Allah at reckoning.","vec_preview":[0.006800000090152025,0.03610000014305115,-0.026599999517202377,-0.0012000000569969416,0.006200000178068876,-0.03620000183582306,-0.017000000923871994,-0.05249999836087227]},{"ayah_id":"4:7","surah":4,"ayah":7,"arabic":"لِّلرِّجَالِ نَصِيبٌ مِّمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ وَلِلنِّسَاءِ نَصِيبٌ مِّمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ مِمَّا قَلَّ مِنْهُ أَوْ كَثُرَ ۚ نَصِيبًا مَّفْرُوضًا","english":"Men have a share in (the assets) that their parents and nearest kin leave behind, and women (also) have a share in the inheritance of their parents and the nearest kin. Be it small or large, the share has been fixed (by Allah).","vec_preview":[0.021400000900030136,0.028599999845027924,-0.024399999529123306,-0.005799999926239252,0.02070000022649765,-0.03660000115633011,-0.01489999983459711,-0.03920000046491623]},{"ayah_id":"4:8","surah":4,"ayah":8,"arabic":"وَإِذَا حَضَرَ الْقِسْمَةَ أُولُو الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينُ فَارْزُقُوهُم مِّنْهُ وَقُولُوا لَهُمْ قَوْلًا مَّعْرُوفًا","english":"If the relatives (other than heirs) and the orphans and the indigent are present on the occasion of the division (of inheritance), give them also something out of it and say to them good and nice words.","vec_preview":[0.000699999975040555,0.014700000174343586,-0.0357000008225441,0.010499999858438969,0.026900000870227814,-0.014800000004470348,-0.01979999989271164,-0.05460000038146973]},{"ayah_id":"4:9","surah":4,"ayah":9,"arabic":"وَلْيَخْشَ الَّذِينَ لَوْ تَرَكُوا مِنْ خَلْفِهِمْ ذُرِّيَّةً ضِعَافًا خَافُوا عَلَيْهِمْ فَلْيَتَّقُوا اللَّهَ وَلْيَقُولُوا قَوْلًا سَدِيدًا","english":"And the people (who execute matters of orphans) should fear that (whilst dying), if they were to leave tender offspring behind, (how) frightened (and worried) they would be over the plight of their children! They should, therefore, keep fearing Allah (in the matter of orphans) and should speak in a straightforward manner.","vec_preview":[-0.009499999694526196,0.022099999710917473,-0.03280000016093254,9.999999747378752e-05,0.04349999874830246,-0.03460000082850456,-0.02630000002682209,-0.04800000041723251]},{"ayah_id":"4:10","surah":4,"ayah":10,"arabic":"إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوَالَ الْيَتَامَىٰ ظُلْمًا إِنَّمَا يَأْكُلُونَ فِي بُطُونِهِمْ نَارًا ۖ وَسَيَصْلَوْنَ سَعِيرًا","english":"Indeed, those who eat up the property of orphans unjustly fill their bellies but with fire, and soon will they fall into a Blazing Fire.","vec_preview":[0.011900000274181366,0.045499999076128006,-0.03310000151395798,0.02239999920129776,0.014299999922513962,-0.03420000150799751,-0.02850000001490116,-0.050599999725818634]},{"ayah_id":"4:11","surah":4,"ayah":11,"arabic":"يُوصِيكُمُ اللَّهُ فِي أَوْلَادِكُمْ ۖ لِلذَّكَرِ مِثْلُ حَظِّ الْأُنثَيَيْنِ ۚ فَإِن كُنَّ نِسَاءً فَوْقَ اثْنَتَيْنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَ ۖ وَإِن كَانَتْ وَاحِدَةً فَلَهَا النِّصْفُ ۚ وَلِأَبَوَيْهِ لِكُلِّ وَاحِدٍ مِّنْهُمَا السُّدُسُ مِمَّا تَرَكَ إِن كَانَ لَهُ وَلَدٌ ۚ فَإِن لَّمْ يَكُن لَّهُ وَلَدٌ وَوَرِثَهُ أَبَوَاهُ فَلِأُمِّهِ الثُّلُثُ ۚ فَإِن كَانَ لَهُ إِخْوَةٌ فَلِأُمِّهِ السُّدُسُ ۚ مِن بَعْدِ وَصِيَّةٍ يُوصِي بِهَا أَوْ دَيْنٍ ۗ آبَاؤُكُمْ وَأَبْنَاؤُكُمْ لَا تَدْرُونَ أَيُّهُمْ أَقْرَبُ لَكُمْ نَفْعًا ۚ فَرِيضَةً مِّنَ اللَّهِ ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا","english":"Allah commands you concerning (the inheritance of) your children: The share of a son is equal to that of two daughters; then if there are only daughters (two or) more, they are entitled to two-thirds of the inheritance; if there is only one daughter, her share will be one half; the mother and the father of the deceased will get one-sixth of the inheritance each if the deceased leaves children behind; but in case the deceased has no children and the heirs are only his mother and his father, the mother’s share is one-third (and the rest is the father’s); then, if he has brothers and sisters, the mother will have a sixth portion. This distribution will be (executed) after (the fulfilment of) the will he may have made or after (the payment of) the debt. You know not which of them, whether your parents or your sons, are closer to you in bringing you benefit. This (distribution) is a duty assigned (i.e., fixed) by Allah. Surely, Allah is All-Knowing, Most Wise.","vec_preview":[0.010700000450015068,0.011099999770522118,-0.017899999395012856,0.0035000001080334187,0.04490000009536743,-0.0414000004529953,-0.011500000022351742,-0.04540000110864639]},{"ayah_id":"4:12","surah":4,"ayah":12,"arabic":"۞ وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوَاجُكُمْ إِن لَّمْ يَكُن لَّهُنَّ وَلَدٌ ۚ فَإِن كَانَ لَهُنَّ وَلَدٌ فَلَكُمُ الرُّبُعُ مِمَّا تَرَكْنَ ۚ مِن بَعْدِ وَصِيَّةٍ يُوصِينَ بِهَا أَوْ دَيْنٍ ۚ وَلَهُنَّ الرُّبُعُ مِمَّا تَرَكْتُمْ إِن لَّمْ يَكُن لَّكُمْ وَلَدٌ ۚ فَإِن كَانَ لَكُمْ وَلَدٌ فَلَهُنَّ الثُّمُنُ مِمَّا تَرَكْتُم ۚ مِّن بَعْدِ وَصِيَّةٍ تُوصُونَ بِهَا أَوْ دَيْنٍ ۗ وَإِن كَانَ رَجُلٌ يُورَثُ كَلَالَةً أَوِ امْرَأَةٌ وَلَهُ أَخٌ أَوْ أُخْتٌ فَلِكُلِّ وَاحِدٍ مِّنْهُمَا السُّدُسُ ۚ فَإِن كَانُوا أَكْثَرَ مِن ذَٰلِكَ فَهُمْ شُرَكَاءُ فِي الثُّلُثِ ۚ مِن بَعْدِ وَصِيَّةٍ يُوصَىٰ بِهَا أَوْ دَيْنٍ غَيْرَ مُضَارٍّ ۚ وَصِيَّةً مِّنَ اللَّهِ ۗ وَاللَّهُ عَلِيمٌ حَلِيمٌ","english":"And for you, the share in the property your wives leave is one half, provided they have no children. In case they have offspring, then there is one-fourth of inheritance for you, (that too) after (the fulfilment of) the will that may have been made or after (the payment of) debt. And the share of your wives in the assets you leave is one-fourth, provided you have no children. But if you have children, then their share in your inheritance is one-eighth, after (the fulfilment of) the will made pertaining to (the inheritance) or the payment of (your) debt. In the case of a man or a woman who leaves neither parents nor children, but who has a brother or a sister (on the mother’s side i.e., a uterine brother or a sister), there is a one-sixth share for each of the two. But if they are more than that, they all will be sharers in one-third. (This division shall also be accomplished) after the will which is made without any prejudice towards the heirs or after the (payment) of debt. This is a command from Allah, and Allah is All-Knowing, Most Forbearing.","vec_preview":[0.020400000736117363,0.013500000350177288,-0.01889999955892563,-0.004399999976158142,0.03449999913573265,-0.034699998795986176,-0.019700000062584877,-0.030899999663233757]},{"ayah_id":"4:13","surah":4,"ayah":13,"arabic":"تِلْكَ حُدُودُ اللَّهِ ۚ وَمَن يُطِعِ اللَّهَ وَرَسُولَهُ يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ وَذَٰلِكَ الْفَوْزُ الْعَظِيمُ","english":"These are the limits set by Allah. And the one who obeys Allah and His Messenger (blessings and peace be upon him), He (Allah) will admit him to the Gardens beneath which rivers flow. They shall reside therein forever, and this is a great achievement.","vec_preview":[0.028200000524520874,0.010200000368058681,-0.04800000041723251,0.012500000186264515,0.02370000071823597,-0.061000000685453415,-0.0044999998062849045,-0.03420000150799751]},{"ayah_id":"4:14","surah":4,"ayah":14,"arabic":"وَمَن يَعْصِ اللَّهَ وَرَسُولَهُ وَيَتَعَدَّ حُدُودَهُ يُدْخِلْهُ نَارًا خَالِدًا فِيهَا وَلَهُ عَذَابٌ مُّهِينٌ","english":"But whoever disobeys Allah and His Messenger (blessings and peace be upon him) and exceeds His limits, He will admit him to Hell wherein shall he dwell forever; and there is a humiliating torment for him.","vec_preview":[0.012000000104308128,0.00860000029206276,-0.033399999141693115,0.02459999918937683,0.019200000911951065,-0.052400000393390656,-0.007400000002235174,-0.02710000053048134]},{"ayah_id":"4:15","surah":4,"ayah":15,"arabic":"وَاللَّاتِي يَأْتِينَ الْفَاحِشَةَ مِن نِّسَائِكُمْ فَاسْتَشْهِدُوا عَلَيْهِنَّ أَرْبَعَةً مِّنكُمْ ۖ فَإِن شَهِدُوا فَأَمْسِكُوهُنَّ فِي الْبُيُوتِ حَتَّىٰ يَتَوَفَّاهُنَّ الْمَوْتُ أَوْ يَجْعَلَ اللَّهُ لَهُنَّ سَبِيلًا","english":"And those of your women who commit adultery, call in from your men four witnesses against them. Then if they produce evidence, confine those women to their houses till death completes their term of life, or Allah ordains a way (i.e., a new injunction) for them.","vec_preview":[0.019300000742077827,0.020899999886751175,-0.03180000185966492,-0.002099999925121665,0.04410000145435333,-0.04349999874830246,-0.007199999876320362,-0.060499999672174454]},{"ayah_id":"4:16","surah":4,"ayah":16,"arabic":"وَاللَّذَانِ يَأْتِيَانِهَا مِنكُمْ فَآذُوهُمَا ۖ فَإِن تَابَا وَأَصْلَحَا فَأَعْرِضُوا عَنْهُمَا ۗ إِنَّ اللَّهَ كَانَ تَوَّابًا رَّحِيمًا","english":"And the two persons who commit adultery from amongst you, punish them both. Then, if they repent and mend (their) ways, refrain from punishing them. Indeed, Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.0038999998942017555,0.023800000548362732,-0.03660000115633011,-0.0019000000320374966,0.040300000458955765,-0.02250000089406967,-0.004800000227987766,-0.043299999088048935]},{"ayah_id":"4:17","surah":4,"ayah":17,"arabic":"إِنَّمَا التَّوْبَةُ عَلَى اللَّهِ لِلَّذِينَ يَعْمَلُونَ السُّوءَ بِجَهَالَةٍ ثُمَّ يَتُوبُونَ مِن قَرِيبٍ فَأُولَـٰئِكَ يَتُوبُ اللَّهُ عَلَيْهِمْ ۗ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا","english":"Allah has only promised to accept the repentance of those who commit evil deeds due to ignorance and then repent soon after. So Allah will turn to such people with His mercy and Allah is All-Knowing, Most Wise.","vec_preview":[-0.0010000000474974513,0.0272000003606081,-0.03060000017285347,0.0013000000035390258,0.03319999948143959,-0.05090000107884407,-0.028200000524520874,-0.04490000009536743]},{"ayah_id":"4:18","surah":4,"ayah":18,"arabic":"وَلَيْسَتِ التَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ حَتَّىٰ إِذَا حَضَرَ أَحَدَهُمُ الْمَوْتُ قَالَ إِنِّي تُبْتُ الْآنَ وَلَا الَّذِينَ يَمُوتُونَ وَهُمْ كُفَّارٌ ۚ أُولَـٰئِكَ أَعْتَدْنَا لَهُمْ عَذَابًا أَلِيمًا","english":"But repentance is not (accepted) of the people who persist in sinful acts until death overtakes one of them, (then) he says: ‘Now I repent.’ Nor is repentance (of any avail) to those who die as disbelievers. We have prepared grievous torment for them.","vec_preview":[-0.00019999999494757503,0.027400000020861626,-0.04540000110864639,0.010900000110268593,0.044199999421834946,-0.047600001096725464,-0.03739999979734421,-0.05689999833703041]},{"ayah_id":"4:19","surah":4,"ayah":19,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَحِلُّ لَكُمْ أَن تَرِثُوا النِّسَاءَ كَرْهًا ۖ وَلَا تَعْضُلُوهُنَّ لِتَذْهَبُوا بِبَعْضِ مَا آتَيْتُمُوهُنَّ إِلَّا أَن يَأْتِينَ بِفَاحِشَةٍ مُّبَيِّنَةٍ ۚ وَعَاشِرُوهُنَّ بِالْمَعْرُوفِ ۚ فَإِن كَرِهْتُمُوهُنَّ فَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَيَجْعَلَ اللَّهُ فِيهِ خَيْرًا كَثِيرًا","english":"O believers! It is not lawful for you to become heirs to women by force. And do not retain them by force in order to take (back) from them a portion of what you gave them, unless they commit open indecency. And treat them honourably. Then if you dislike them, it may be that you dislike a thing and Allah places in it abundant good.","vec_preview":[0.013199999928474426,0.007300000172108412,-0.04659999907016754,-0.0044999998062849045,0.04569999873638153,-0.03530000150203705,-0.014999999664723873,-0.045099999755620956]},{"ayah_id":"4:20","surah":4,"ayah":20,"arabic":"وَإِنْ أَرَدتُّمُ اسْتِبْدَالَ زَوْجٍ مَّكَانَ زَوْجٍ وَآتَيْتُمْ إِحْدَاهُنَّ قِنطَارًا فَلَا تَأْخُذُوا مِنْهُ شَيْئًا ۚ أَتَأْخُذُونَهُ بُهْتَانًا وَإِثْمًا مُّبِينًا","english":"And if you seek to take a wife in place of another and you have (by now) given to her heaps of wealth, yet do not take back any part of it. Do you want to take that wealth (back) by means of unjust accusation and manifest sin?","vec_preview":[0.000699999975040555,0.00839999970048666,-0.032499998807907104,0.0007999999797903001,0.022700000554323196,-0.01810000091791153,-0.04450000077486038,-0.05079999938607216]},{"ayah_id":"4:21","surah":4,"ayah":21,"arabic":"وَكَيْفَ تَأْخُذُونَهُ وَقَدْ أَفْضَىٰ بَعْضُكُمْ إِلَىٰ بَعْضٍ وَأَخَذْنَ مِنكُم مِّيثَاقًا غَلِيظًا","english":"And how can you take it back whilst you have had marital relations with each other, and they have (also) taken a firm promise from you?","vec_preview":[0.030500000342726707,0.035999998450279236,-0.026200000196695328,0.0005000000237487257,0.025599999353289604,-0.03620000183582306,-0.016899999231100082,-0.04430000111460686]},{"ayah_id":"4:22","surah":4,"ayah":22,"arabic":"وَلَا تَنكِحُوا مَا نَكَحَ آبَاؤُكُم مِّنَ النِّسَاءِ إِلَّا مَا قَدْ سَلَفَ ۚ إِنَّهُ كَانَ فَاحِشَةً وَمَقْتًا وَسَاءَ سَبِيلًا","english":"And do not marry women whom your fathers and forefathers married. But that which has passed (before this command is forgiven). It is indeed highly indecent, infuriating and an evil custom.","vec_preview":[0.03610000014305115,0.019899999722838402,-0.03319999948143959,0.012600000016391277,0.025499999523162842,-0.05310000106692314,-0.01360000018030405,-0.0414000004529953]},{"ayah_id":"4:23","surah":4,"ayah":23,"arabic":"حُرِّمَتْ عَلَيْكُمْ أُمَّهَاتُكُمْ وَبَنَاتُكُمْ وَأَخَوَاتُكُمْ وَعَمَّاتُكُمْ وَخَالَاتُكُمْ وَبَنَاتُ الْأَخِ وَبَنَاتُ الْأُخْتِ وَأُمَّهَاتُكُمُ اللَّاتِي أَرْضَعْنَكُمْ وَأَخَوَاتُكُم مِّنَ الرَّضَاعَةِ وَأُمَّهَاتُ نِسَائِكُمْ وَرَبَائِبُكُمُ اللَّاتِي فِي حُجُورِكُم مِّن نِّسَائِكُمُ اللَّاتِي دَخَلْتُم بِهِنَّ فَإِن لَّمْ تَكُونُوا دَخَلْتُم بِهِنَّ فَلَا جُنَاحَ عَلَيْكُمْ وَحَلَائِلُ أَبْنَائِكُمُ الَّذِينَ مِنْ أَصْلَابِكُمْ وَأَن تَجْمَعُوا بَيْنَ الْأُخْتَيْنِ إِلَّا مَا قَدْ سَلَفَ ۗ إِنَّ اللَّهَ كَانَ غَفُورًا رَّحِيمًا","english":"Forbidden to you are your mothers and your daughters and your sisters and your father’s sisters and your mother’s sisters and your brother’s daughters and sister’s daughters and your mothers (who) have suckled you, your foster sisters and mothers of your wives. And (similarly) your stepdaughters brought up under your parentage born of your women with whom you have had marital relations (are also forbidden to you.) If you have not had martial relations, then there is no harm (in marrying their daughters). Also forbidden are the wives of your real sons who are of your loins, and having (in marriage) two sisters together, except what has passed in the days of ignorance. Allah indeed is Most Forgiving, Ever-Merciful.","vec_preview":[0.027499999850988388,0.026399999856948853,-0.03929999843239784,-0.0019000000320374966,0.03889999911189079,-0.04430000111460686,-0.0066999997943639755,-0.04360000044107437]},{"ayah_id":"4:24","surah":4,"ayah":24,"arabic":"۞ وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ ۖ كِتَابَ اللَّهِ عَلَيْكُمْ ۚ وَأُحِلَّ لَكُم مَّا وَرَاءَ ذَٰلِكُمْ أَن تَبْتَغُوا بِأَمْوَالِكُم مُّحْصِنِينَ غَيْرَ مُسَافِحِينَ ۚ فَمَا اسْتَمْتَعْتُم بِهِ مِنْهُنَّ فَآتُوهُنَّ أُجُورَهُنَّ فَرِيضَةً ۚ وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَاضَيْتُم بِهِ مِن بَعْدِ الْفَرِيضَةِ ۚ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا","english":"And (forbidden to you are also) women having husbands except those (prisoners of war) who come into your legal possession. Allah has prescribed for you (these prohibitions). And (all women) other than these are made lawful for you, so that you may wish them for marriage by means of your money (i.e., dower), maintaining chastity and not in pursuit of satisfying lust. Then those of them from whom you have received benefit in exchange for that (money), pay them their fixed dowers. And there is no sin on you pertaining to the money on which you mutually agree after fixing the dower. Surely, Allah is All-Knowing, Most Wise.","vec_preview":[0.018400000408291817,0.025800000876188278,-0.02930000051856041,-0.003100000089034438,0.02850000001490116,-0.03449999913573265,-0.012900000438094139,-0.05009999871253967]},{"ayah_id":"4:25","surah":4,"ayah":25,"arabic":"وَمَن لَّمْ يَسْتَطِعْ مِنكُمْ طَوْلًا أَن يَنكِحَ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ فَمِن مَّا مَلَكَتْ أَيْمَانُكُم مِّن فَتَيَاتِكُمُ الْمُؤْمِنَاتِ ۚ وَاللَّهُ أَعْلَمُ بِإِيمَانِكُم ۚ بَعْضُكُم مِّن بَعْضٍ ۚ فَانكِحُوهُنَّ بِإِذْنِ أَهْلِهِنَّ وَآتُوهُنَّ أُجُورَهُنَّ بِالْمَعْرُوفِ مُحْصَنَاتٍ غَيْرَ مُسَافِحَاتٍ وَلَا مُتَّخِذَاتِ أَخْدَانٍ ۚ فَإِذَا أُحْصِنَّ فَإِنْ أَتَيْنَ بِفَاحِشَةٍ فَعَلَيْهِنَّ نِصْفُ مَا عَلَى الْمُحْصَنَاتِ مِنَ الْعَذَابِ ۚ ذَٰلِكَ لِمَنْ خَشِيَ الْعَنَتَ مِنكُمْ ۚ وَأَن تَصْبِرُوا خَيْرٌ لَّكُمْ ۗ وَاللَّهُ غَفُورٌ رَّحِيمٌ","english":"And whoever of you cannot afford to marry free believing women may marry those believing slave girls who are in your possession (under Islamic law). And Allah knows best (the state of) your belief. You (all) are one from another. So, marry these (slave girls) with the permission of their masters, and pay them their dowers according to custom, provided they are wedlocked (being chaste), neither committing illegal sex, nor taking secret lovers. If they commit fornication after they have entered into wedlock, their punishment will be the half of that (appointed) for free (unmarried) women. This permission is for him amongst you who fears (indulging in) sin, and if you practise self-restraint, that is better for you. And Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.024299999698996544,0.02410000003874302,-0.024399999529123306,0.004800000227987766,0.04439999908208847,-0.0430000014603138,-0.01600000075995922,-0.05909999832510948]},{"ayah_id":"4:26","surah":4,"ayah":26,"arabic":"يُرِيدُ اللَّهُ لِيُبَيِّنَ لَكُمْ وَيَهْدِيَكُمْ سُنَنَ الَّذِينَ مِن قَبْلِكُمْ وَيَتُوبَ عَلَيْكُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","english":"Allah intends to explain to you (His commands) and guide you to the ways of those (pious) people who have passed before you and turn to you in mercy. And Allah is All-Knowing, Most Wise.","vec_preview":[-0.0034000000450760126,0.009800000116229057,-0.02329999953508377,0.01769999973475933,0.028999999165534973,-0.040699999779462814,-0.01640000008046627,-0.03689999878406525]},{"ayah_id":"4:27","surah":4,"ayah":27,"arabic":"وَاللَّهُ يُرِيدُ أَن يَتُوبَ عَلَيْكُمْ وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ أَن تَمِيلُوا مَيْلًا عَظِيمًا","english":"And Allah intends to bestow upon you His favour, but those who pursue the lusts (of the ill-commanding selves) wish you to turn far away from the right path.","vec_preview":[0.005200000014156103,-0.0032999999821186066,-0.025499999523162842,-0.0007999999797903001,0.035100001841783524,-0.02669999934732914,-0.011800000444054604,-0.045099999755620956]},{"ayah_id":"4:28","surah":4,"ayah":28,"arabic":"يُرِيدُ اللَّهُ أَن يُخَفِّفَ عَنكُمْ ۚ وَخُلِقَ الْإِنسَانُ ضَعِيفًا","english":"Allah intends to lighten your burden. And man has been created weak (and infirm).","vec_preview":[-0.013899999670684338,0.00559999980032444,-0.021800000220537186,0.009999999776482582,0.026900000870227814,-0.03720000013709068,-0.012600000016391277,-0.030799999833106995]},{"ayah_id":"4:29","surah":4,"ayah":29,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَأْكُلُوا أَمْوَالَكُم بَيْنَكُم بِالْبَاطِلِ إِلَّا أَن تَكُونَ تِجَارَةً عَن تَرَاضٍ مِّنكُمْ ۚ وَلَا تَقْتُلُوا أَنفُسَكُمْ ۚ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا","english":"O believers! Do not devour one another’s wealth unlawfully amongst yourselves unless it is a trade by your mutual agreement and do not kill yourselves. Surely, Allah is Kind to you.","vec_preview":[0.026399999856948853,0.021900000050663948,-0.03680000081658363,-0.0015999999595806003,0.03889999911189079,-0.03889999911189079,-0.026100000366568565,-0.054499998688697815]},{"ayah_id":"4:30","surah":4,"ayah":30,"arabic":"وَمَن يَفْعَلْ ذَٰلِكَ عُدْوَانًا وَظُلْمًا فَسَوْفَ نُصْلِيهِ نَارًا ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا","english":"But whoever will do that through transgression and injustice, We shall soon throw him into the Fire (of Hell) and that is very easy for Allah.","vec_preview":[-0.002400000113993883,0.00019999999494757503,-0.030500000342726707,0.013199999928474426,0.02590000070631504,-0.06909999996423721,-0.019600000232458115,-0.02449999935925007]},{"ayah_id":"4:31","surah":4,"ayah":31,"arabic":"إِن تَجْتَنِبُوا كَبَائِرَ مَا تُنْهَوْنَ عَنْهُ نُكَفِّرْ عَنكُمْ سَيِّئَاتِكُمْ وَنُدْخِلْكُم مُّدْخَلًا كَرِيمًا","english":"If you keep abstaining from major sins that you are forbidden to do, We shall remove from you your minor sins and shall admit you to a place of honour.","vec_preview":[0.013199999928474426,0.014800000004470348,-0.05050000175833702,0.023600000888109207,0.011800000444054604,-0.03269999846816063,-0.016899999231100082,-0.05130000039935112]},{"ayah_id":"4:32","surah":4,"ayah":32,"arabic":"وَلَا تَتَمَنَّوْا مَا فَضَّلَ اللَّهُ بِهِ بَعْضَكُمْ عَلَىٰ بَعْضٍ ۚ لِّلرِّجَالِ نَصِيبٌ مِّمَّا اكْتَسَبُوا ۖ وَلِلنِّسَاءِ نَصِيبٌ مِّمَّا اكْتَسَبْنَ ۚ وَاسْأَلُوا اللَّهَ مِن فَضْلِهِ ۗ إِنَّ اللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيمًا","english":"And do not long for the thing in which Allah has made some of you superior to others. Men will have a share of what they earn, and women will have a share of what they earn, and keep begging Allah for His bounty. Surely, Allah knows best everything .","vec_preview":[0.015699999406933784,0.019300000742077827,-0.033900000154972076,-0.018799999728798866,0.0348999984562397,-0.04039999842643738,-0.02329999953508377,-0.0414000004529953]},{"ayah_id":"4:33","surah":4,"ayah":33,"arabic":"وَلِكُلٍّ جَعَلْنَا مَوَالِيَ مِمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ ۚ وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ فَآتُوهُمْ نَصِيبَهُمْ ۚ إِنَّ اللَّهَ كَانَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدًا","english":"And We have appointed to everyone heirs of the property left by parents and near relations. And to those with whom you have made an agreement, give them their share. Assuredly, Allah observes everything.","vec_preview":[0.010099999606609344,0.00019999999494757503,-0.020500000566244125,-0.0019000000320374966,0.013399999588727951,-0.040699999779462814,-0.0210999995470047,-0.037700001150369644]},{"ayah_id":"4:34","surah":4,"ayah":34,"arabic":"الرِّجَالُ قَوَّامُونَ عَلَى النِّسَاءِ بِمَا فَضَّلَ اللَّهُ بَعْضَهُمْ عَلَىٰ بَعْضٍ وَبِمَا أَنفَقُوا مِنْ أَمْوَالِهِمْ ۚ فَالصَّالِحَاتُ قَانِتَاتٌ حَافِظَاتٌ لِّلْغَيْبِ بِمَا حَفِظَ اللَّهُ ۚ وَاللَّاتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ وَاضْرِبُوهُنَّ ۖ فَإِنْ أَطَعْنَكُمْ فَلَا تَبْغُوا عَلَيْهِنَّ سَبِيلًا ۗ إِنَّ اللَّهَ كَانَ عَلِيًّا كَبِيرًا","english":"Men are guardians of women, because Allah has made one superior to the other, and (also) because men spend their wealth (on them). So the pious wives are obedient. They guard (their chastity) in the absence of their husbands with the protection of Allah. But those women whom you fear will disobey and defy, admonish them; and (if they do not amend) separate them (from yourselves) in beds; and (if they still do not improve) turn away from them, striking a temporary parting. Then if they become cooperative with you, do not seek any way against them. Surely, Allah is Most High, Most Great.","vec_preview":[0.028999999165534973,0.023499999195337296,-0.03590000048279762,-0.0003000000142492354,0.04740000143647194,-0.04360000044107437,-0.01720000058412552,-0.052799999713897705]},{"ayah_id":"4:35","surah":4,"ayah":35,"arabic":"وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا فَابْعَثُوا حَكَمًا مِّنْ أَهْلِهِ وَحَكَمًا مِّنْ أَهْلِهَا إِن يُرِيدَا إِصْلَاحًا يُوَفِّقِ اللَّهُ بَيْنَهُمَا ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا خَبِيرًا","english":"And if you fear a breach between the two, then appoint one arbitrator from the husband’s family and the other from the wife’s family. If both (the arbitrators) resolve to bring about settlement, Allah will create harmony between them. Indeed, Allah is All-Knowing, All-Aware.","vec_preview":[0.0032999999821186066,0.021400000900030136,-0.03629999980330467,0.0035000001080334187,0.03460000082850456,-0.027699999511241913,-0.01810000091791153,-0.04740000143647194]},{"ayah_id":"4:36","surah":4,"ayah":36,"arabic":"۞ وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا وَبِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَالْجَارِ ذِي الْقُرْبَىٰ وَالْجَارِ الْجُنُبِ وَالصَّاحِبِ بِالْجَنبِ وَابْنِ السَّبِيلِ وَمَا مَلَكَتْ أَيْمَانُكُمْ ۗ إِنَّ اللَّهَ لَا يُحِبُّ مَن كَانَ مُخْتَالًا فَخُورًا","english":"And worship Allah and do not set up any partners with Him. And treat the parents with moral excellence and (do good to) relatives, orphans, the needy, the close as well as unacquainted neighbours, and your fellows and the wayfarers and those whom you possess. Surely, Allah does not like the one who is arrogant (i.e., self-conceited) and boastful (i.e., egoist),","vec_preview":[0.006000000052154064,0.009700000286102295,-0.034699998795986176,0.009399999864399433,0.03629999980330467,-0.04769999906420708,-0.021299999207258224,-0.05000000074505806]},{"ayah_id":"4:37","surah":4,"ayah":37,"arabic":"الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ وَيَكْتُمُونَ مَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ ۗ وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُّهِينًا","english":"Those who are miserly and bid others (also) to be miserly and hide that (blessing) which Allah has granted them of His bounty. And We have prepared a disgraceful torment for the disbelievers,","vec_preview":[-0.0034000000450760126,0.01679999940097332,-0.03400000184774399,0.004399999976158142,0.04430000111460686,-0.039000000804662704,-0.018799999728798866,-0.039500001817941666]},{"ayah_id":"4:38","surah":4,"ayah":38,"arabic":"وَالَّذِينَ يُنفِقُونَ أَمْوَالَهُمْ رِئَاءَ النَّاسِ وَلَا يُؤْمِنُونَ بِاللَّهِ وَلَا بِالْيَوْمِ الْآخِرِ ۗ وَمَن يَكُنِ الشَّيْطَانُ لَهُ قَرِينًا فَسَاءَ قَرِينًا","english":"And those who spend their wealth to show off to people, and believe neither in Allah nor in the Last Day. And whoever Satan sides with as a companion, so he is an evil companion!","vec_preview":[0.005200000014156103,0.013199999928474426,-0.03420000150799751,-0.003100000089034438,0.031099999323487282,-0.04439999908208847,-0.008799999952316284,-0.0478999987244606]},{"ayah_id":"4:39","surah":4,"ayah":39,"arabic":"وَمَاذَا عَلَيْهِمْ لَوْ آمَنُوا بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَأَنفَقُوا مِمَّا رَزَقَهُمُ اللَّهُ ۚ وَكَانَ اللَّهُ بِهِمْ عَلِيمًا","english":"And what loss would they have suffered, if they had believed in Allah and the Last Day, and spent (in His way) of what Allah had given them? And Allah is Well Aware of them (i.e., their state of affairs).","vec_preview":[-0.0013000000035390258,0.02500000037252903,-0.026000000536441803,-0.0034000000450760126,0.0340999998152256,-0.04039999842643738,-0.0142000000923872,-0.03720000013709068]},{"ayah_id":"4:40","surah":4,"ayah":40,"arabic":"إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ ۖ وَإِن تَكُ حَسَنَةً يُضَاعِفْهَا وَيُؤْتِ مِن لَّدُنْهُ أَجْرًا عَظِيمًا","english":"Surely, Allah does not do (even) an iota of injustice, and if there is a good work, He doubles it and grants from His presence an immense reward.","vec_preview":[0.002199999988079071,0.0052999998442828655,-0.030500000342726707,0.00860000029206276,0.02879999950528145,-0.03449999913573265,-0.020500000566244125,-0.031300000846385956]},{"ayah_id":"4:41","surah":4,"ayah":41,"arabic":"فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَـٰؤُلَاءِ شَهِيدًا","english":"Then how it will be on the Day when We shall bring one witness from each Umma (Community), and, (O Beloved,) We shall bring you as a witness against them all?","vec_preview":[0.013500000350177288,0.010499999858438969,-0.02370000071823597,0.01119999960064888,0.01860000006854534,-0.0210999995470047,-0.02930000051856041,-0.03909999877214432]},{"ayah_id":"4:42","surah":4,"ayah":42,"arabic":"يَوْمَئِذٍ يَوَدُّ الَّذِينَ كَفَرُوا وَعَصَوُا الرَّسُولَ لَوْ تُسَوَّىٰ بِهِمُ الْأَرْضُ وَلَا يَكْتُمُونَ اللَّهَ حَدِيثًا","english":"On that Day those who disbelieved and disobeyed the Messenger (blessings and peace be upon him) will wish that (after burying them) the earth over them were levelled. And they will not be able to hide anything from Allah.","vec_preview":[-0.005499999970197678,0.027000000700354576,-0.0364999994635582,0.00279999990016222,0.004900000058114529,-0.03400000184774399,-0.012600000016391277,-0.03200000151991844]},{"ayah_id":"4:43","surah":4,"ayah":43,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْرَبُوا الصَّلَاةَ وَأَنتُمْ سُكَارَىٰ حَتَّىٰ تَعْلَمُوا مَا تَقُولُونَ وَلَا جُنُبًا إِلَّا عَابِرِي سَبِيلٍ حَتَّىٰ تَغْتَسِلُوا ۚ وَإِن كُنتُم مَّرْضَىٰ أَوْ عَلَىٰ سَفَرٍ أَوْ جَاءَ أَحَدٌ مِّنكُم مِّنَ الْغَائِطِ أَوْ لَامَسْتُمُ النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُمْ ۗ إِنَّ اللَّهَ كَانَ عَفُوًّا غَفُورًا","english":"O believers! Do not go near Prayer in a drunken state until you are able to understand what you say. Nor (should you approach Prayer) until you bathe after total ablution becomes obligatory, unless you are travelling. And if you are sick, or on a journey, or return from a call of nature, or make sexual contact with (your) women and then fail to find water, then clean yourselves by using pure soil. So wipe your faces and hands. Surely, Allah is Most Pardoning, Most Forgiving.","vec_preview":[0.021900000050663948,0.022199999541044235,-0.03920000046491623,-0.015699999406933784,0.05460000038146973,-0.02969999983906746,-0.01549999974668026,-0.03830000013113022]},{"ayah_id":"4:44","surah":4,"ayah":44,"arabic":"أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِّنَ الْكِتَابِ يَشْتَرُونَ الضَّلَالَةَ وَيُرِيدُونَ أَن تَضِلُّوا السَّبِيلَ","english":"Have you not seen those who were given a portion of the (revealed) Book? They buy misguidance, and want you (also) to turn away from the straight path.","vec_preview":[0.013500000350177288,0.01730000041425228,-0.040699999779462814,-0.0017999999690800905,0.02850000001490116,-0.025100000202655792,-0.02370000071823597,-0.045099999755620956]},{"ayah_id":"4:45","surah":4,"ayah":45,"arabic":"وَاللَّهُ أَعْلَمُ بِأَعْدَائِكُمْ ۚ وَكَفَىٰ بِاللَّهِ وَلِيًّا وَكَفَىٰ بِاللَّهِ نَصِيرًا","english":"And Allah knows best your enemies and Allah is Sufficient (as) a Protector and Allah is Sufficient (as) a Helper.","vec_preview":[0.00930000003427267,0.016200000420212746,-0.010499999858438969,0.002400000113993883,0.026799999177455902,-0.0284000001847744,-0.020999999716877937,-0.04470000043511391]},{"ayah_id":"4:46","surah":4,"ayah":46,"arabic":"مِّنَ الَّذِينَ هَادُوا يُحَرِّفُونَ الْكَلِمَ عَن مَّوَاضِعِهِ وَيَقُولُونَ سَمِعْنَا وَعَصَيْنَا وَاسْمَعْ غَيْرَ مُسْمَعٍ وَرَاعِنَا لَيًّا بِأَلْسِنَتِهِمْ وَطَعْنًا فِي الدِّينِ ۚ وَلَوْ أَنَّهُمْ قَالُوا سَمِعْنَا وَأَطَعْنَا وَاسْمَعْ وَانظُرْنَا لَكَانَ خَيْرًا لَّهُمْ وَأَقْوَمَ وَلَـٰكِن لَّعَنَهُمُ اللَّهُ بِكُفْرِهِمْ فَلَا يُؤْمِنُونَ إِلَّا قَلِيلًا","english":"And some amongst the Jews pervert the words (of the Torah) from their (original) places and say: ‘We have heard but we disobey,’ and (also say): ‘Listen! (God forbid!) May you not be listened to,’ and twisting their tongues, scoffing at Din (Religion) they say: ‘Ra‘ina.’ And, (instead,) if they had said: ‘We have heard and obeyed,’ and ‘(Your Eminence! Please) give audience (to our request), and bless us with a (benevolent and kind) look,’ that would have been better for them, and (this utterance) would have been right and appropriate (too); but Allah has cursed them owing to their disbelief. So they do not believe except a few.","vec_preview":[-0.010499999858438969,0.025200000032782555,-0.041099999099969864,-0.005400000140070915,0.034699998795986176,-0.04010000079870224,-0.018300000578165054,-0.05999999865889549]},{"ayah_id":"4:47","surah":4,"ayah":47,"arabic":"يَا أَيُّهَا الَّذِينَ أُوتُوا الْكِتَابَ آمِنُوا بِمَا نَزَّلْنَا مُصَدِّقًا لِّمَا مَعَكُم مِّن قَبْلِ أَن نَّطْمِسَ وُجُوهًا فَنَرُدَّهَا عَلَىٰ أَدْبَارِهَا أَوْ نَلْعَنَهُمْ كَمَا لَعَنَّا أَصْحَابَ السَّبْتِ ۚ وَكَانَ أَمْرُ اللَّهِ مَفْعُولًا","english":"O People of the Book! Believe in (that Book) which We have revealed (now to Our Beloved Muhammad [blessings and peace be upon him]) which (originally) confirms the Book that is with you, before We disfigure (features of some) faces and turn them on to their rear, or cast on them a curse like the one that We cast on those (who disobeyed) in the case of Sabbath. And the commandment of Allah is bound to be executed.","vec_preview":[0.009499999694526196,-0.004999999888241291,-0.03840000182390213,-0.025699999183416367,0.024900000542402267,-0.014399999752640724,-0.016599999740719795,-0.06260000169277191]},{"ayah_id":"4:48","surah":4,"ayah":48,"arabic":"إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَاءُ ۚ وَمَن يُشْرِكْ بِاللَّهِ فَقَدِ افْتَرَىٰ إِثْمًا عَظِيمًا","english":"Surely, Allah does not forgive setting up of partners with Him, and He forgives (any other sin) lesser in degree for whom He wills. And whoever sets up partners with Allah certainly fabricates a horrible sin.","vec_preview":[0.00430000014603138,0.002300000051036477,-0.028699999675154686,-0.0003000000142492354,0.02590000070631504,-0.04190000146627426,-0.013000000268220901,-0.04309999942779541]},{"ayah_id":"4:49","surah":4,"ayah":49,"arabic":"أَلَمْ تَرَ إِلَى الَّذِينَ يُزَكُّونَ أَنفُسَهُم ۚ بَلِ اللَّهُ يُزَكِّي مَن يَشَاءُ وَلَا يُظْلَمُونَ فَتِيلًا","english":"Have you not seen the people who show themselves off as pure? Nay, Allah is the One Who purifies whom He pleases, and they will not be wronged even equal to a thread.","vec_preview":[-0.008799999952316284,0.011800000444054604,-0.03150000050663948,0.008299999870359898,0.016499999910593033,-0.04470000043511391,-0.03440000116825104,-0.039500001817941666]},{"ayah_id":"4:50","surah":4,"ayah":50,"arabic":"انظُرْ كَيْفَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ ۖ وَكَفَىٰ بِهِ إِثْمًا مُّبِينًا","english":"Look! How they invent a lie against Allah, and this manifest sin is sufficient (for afflicting them with torment)!","vec_preview":[-0.007899999618530273,0.010700000450015068,-0.025599999353289604,-0.0038999998942017555,0.032099999487400055,-0.03240000084042549,-0.019200000911951065,-0.03579999879002571]},{"ayah_id":"4:51","surah":4,"ayah":51,"arabic":"أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِّنَ الْكِتَابِ يُؤْمِنُونَ بِالْجِبْتِ وَالطَّاغُوتِ وَيَقُولُونَ لِلَّذِينَ كَفَرُوا هَـٰؤُلَاءِ أَهْدَىٰ مِنَ الَّذِينَ آمَنُوا سَبِيلًا","english":"Have you not seen those who have been given a portion of (the revealed) Book? (In spite of that) they believe in idols and Satan. And about the disbelievers they say: ‘These (disbelievers) are better guided than the believers.’","vec_preview":[0.02710000053048134,0.018699999898672104,-0.03739999979734421,0.00019999999494757503,0.041099999099969864,-0.022600000724196434,-0.02290000021457672,-0.051500000059604645]},{"ayah_id":"4:52","surah":4,"ayah":52,"arabic":"أُولَـٰئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ ۖ وَمَن يَلْعَنِ اللَّهُ فَلَن تَجِدَ لَهُ نَصِيرًا","english":"These are the people whom Allah has cursed, and you will not find any helper at all for the one whom Allah curses.","vec_preview":[-0.01679999940097332,0.0032999999821186066,-0.028300000354647636,0.01889999955892563,0.024399999529123306,-0.039400000125169754,-0.0203000009059906,-0.03849999979138374]},{"ayah_id":"4:53","surah":4,"ayah":53,"arabic":"أَمْ لَهُمْ نَصِيبٌ مِّنَ الْمُلْكِ فَإِذًا لَّا يُؤْتُونَ النَّاسَ نَقِيرًا","english":"Have they any share in the kingdom? If so, they would not give (anything) to the people worth even a speck (because of their miserliness).","vec_preview":[-0.0027000000700354576,0.022199999541044235,-0.02889999933540821,-0.001500000013038516,0.017899999395012856,-0.0348999984562397,-0.0272000003606081,-0.03889999911189079]},{"ayah_id":"4:54","surah":4,"ayah":54,"arabic":"أَمْ يَحْسُدُونَ النَّاسَ عَلَىٰ مَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ ۖ فَقَدْ آتَيْنَا آلَ إِبْرَاهِيمَ الْكِتَابَ وَالْحِكْمَةَ وَآتَيْنَاهُم مُّلْكًا عَظِيمًا","english":"Do they (the Jews) feel jealous of the people because of (the blessings) which Allah has conferred upon them of His bounty? So, surely, We have given the family of Ibrahim (Abraham) the Book and wisdom, and We also granted them a great kingdom.","vec_preview":[0.013899999670684338,0.017799999564886093,-0.022199999541044235,-0.006000000052154064,0.025100000202655792,-0.03750000149011612,-0.012600000016391277,-0.02160000056028366]},{"ayah_id":"4:55","surah":4,"ayah":55,"arabic":"فَمِنْهُم مَّنْ آمَنَ بِهِ وَمِنْهُم مَّن صَدَّ عَنْهُ ۚ وَكَفَىٰ بِجَهَنَّمَ سَعِيرًا","english":"So, some of them believed in it and some turned away from it, and enough is the blazing Fire of Hell (for those who turn away).","vec_preview":[0.010400000028312206,0.041999999433755875,-0.028999999165534973,0.0027000000700354576,0.0471000000834465,-0.022600000724196434,-0.022600000724196434,-0.028599999845027924]},{"ayah_id":"4:56","surah":4,"ayah":56,"arabic":"إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِنَا سَوْفَ نُصْلِيهِمْ نَارًا كُلَّمَا نَضِجَتْ جُلُودُهُم بَدَّلْنَاهُمْ جُلُودًا غَيْرَهَا لِيَذُوقُوا الْعَذَابَ ۗ إِنَّ اللَّهَ كَانَ عَزِيزًا حَكِيمًا","english":"Surely, those who disbelieved in Our Revelations, We shall soon hurl them into the Fire (of Hell). When their skins are burnt off, We shall replace them with other skins so that they may taste the torment (continually). Surely, Allah is Almighty, Most Wise.","vec_preview":[-0.01269999984651804,0.007899999618530273,-0.030799999833106995,-0.005200000014156103,0.020500000566244125,-0.05959999933838844,-0.020899999886751175,-0.026000000536441803]},{"ayah_id":"4:57","surah":4,"ayah":57,"arabic":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَنُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ لَّهُمْ فِيهَا أَزْوَاجٌ مُّطَهَّرَةٌ ۖ وَنُدْخِلُهُمْ ظِلًّا ظَلِيلًا","english":"Those who believe and assiduously perform pious acts, We shall admit them to Gardens beneath which streams flow. They will live there forever. Therein will be pure spouses for them. And We shall admit them into plenteous, deep shades.","vec_preview":[0.017899999395012856,-0.004600000102072954,-0.05420000106096268,-0.010499999858438969,0.04270000010728836,-0.05220000073313713,-0.01730000041425228,-0.03539999946951866]},{"ayah_id":"4:58","surah":4,"ayah":58,"arabic":"۞ إِنَّ اللَّهَ يَأْمُرُكُمْ أَن تُؤَدُّوا الْأَمَانَاتِ إِلَىٰ أَهْلِهَا وَإِذَا حَكَمْتُم بَيْنَ النَّاسِ أَن تَحْكُمُوا بِالْعَدْلِ ۚ إِنَّ اللَّهَ نِعِمَّا يَعِظُكُم بِهِ ۗ إِنَّ اللَّهَ كَانَ سَمِيعًا بَصِيرًا","english":"Surely, Allah commands you to entrust the belongings to those who are worthy of them; and when you judge matters amongst people, give judgment with justice. What an excellent advice Allah gives you! Surely, Allah is All-Hearing, All-Seeing.","vec_preview":[0.0017000000225380063,0.030700000002980232,-0.03869999945163727,-0.012799999676644802,0.03579999879002571,-0.04639999940991402,-0.022099999710917473,-0.044199999421834946]},{"ayah_id":"4:59","surah":4,"ayah":59,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنكُمْ ۖ فَإِن تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِن كُنتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا","english":"O believers! Obey Allah and obey the Messenger (blessings and peace be upon him) and those (men of truth) who hold command amongst you. Then if you disagree amongst yourselves over any issue, refer it to Allah and the Messenger ([blessings and peace be upon him] for final judgment), if you believe in Allah and the Last Day. That is best (for you) and best for the end result.","vec_preview":[0.016200000420212746,0.013500000350177288,-0.038600001484155655,-0.002899999963119626,0.03420000150799751,-0.04230000078678131,-0.0215000007301569,-0.05260000005364418]},{"ayah_id":"4:60","surah":4,"ayah":60,"arabic":"أَلَمْ تَرَ إِلَى الَّذِينَ يَزْعُمُونَ أَنَّهُمْ آمَنُوا بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ يُرِيدُونَ أَن يَتَحَاكَمُوا إِلَى الطَّاغُوتِ وَقَدْ أُمِرُوا أَن يَكْفُرُوا بِهِ وَيُرِيدُ الشَّيْطَانُ أَن يُضِلَّهُمْ ضَلَالًا بَعِيدًا","english":"Have you not seen these (hypocrites) who claim (verbally) that they believe in this (Book, the Qur’an) which has been revealed to you and also in those (revealed Books) which were sent down before you? (But) they desire to take their disputes (for settlement) to Satan (i.e., the law based on defiance against Allah’s commandments) although they have been ordained to reject it (openly). And Satan only desires to lead them far astray.","vec_preview":[-0.0035000001080334187,0.011099999770522118,-0.03420000150799751,0.006500000134110451,0.05260000005364418,-0.0494999997317791,-0.0272000003606081,-0.03840000182390213]},{"ayah_id":"4:61","surah":4,"ayah":61,"arabic":"وَإِذَا قِيلَ لَهُمْ تَعَالَوْا إِلَىٰ مَا أَنزَلَ اللَّهُ وَإِلَى الرَّسُولِ رَأَيْتَ الْمُنَافِقِينَ يَصُدُّونَ عَنكَ صُدُودًا","english":"And when they are asked to come to what Allah has revealed (the Qur’an) and to the Messenger (blessings and peace be upon him), you will see that the hypocrites turn away from (coming towards) you.","vec_preview":[0.004100000020116568,0.014399999752640724,-0.034299999475479126,-0.013899999670684338,0.02370000071823597,-0.04859999939799309,0.0007999999797903001,-0.03620000183582306]},{"ayah_id":"4:62","surah":4,"ayah":62,"arabic":"فَكَيْفَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ ثُمَّ جَاءُوكَ يَحْلِفُونَ بِاللَّهِ إِنْ أَرَدْنَا إِلَّا إِحْسَانًا وَتَوْفِيقًا","english":"Then what will be their plight (at that time) when some disaster befalls them on account of their own crooked works, and they will appear before you swearing by Allah, (saying): ‘We intended nothing but piety and mutual harmony’?","vec_preview":[0.010099999606609344,0.015200000256299973,-0.031700000166893005,0.005200000014156103,0.03420000150799751,-0.03660000115633011,-0.006399999838322401,-0.03200000151991844]},{"ayah_id":"4:63","surah":4,"ayah":63,"arabic":"أُولَـٰئِكَ الَّذِينَ يَعْلَمُ اللَّهُ مَا فِي قُلُوبِهِمْ فَأَعْرِضْ عَنْهُمْ وَعِظْهُمْ وَقُل لَّهُمْ فِي أَنفُسِهِمْ قَوْلًا بَلِيغًا","english":"These are the (hypocrite and vicious) people whose every secret in their hearts Allah knows best. So, avoid them and admonish them persistently, and establish effective communication with them about themselves.","vec_preview":[-0.007899999618530273,0.014700000174343586,-0.026599999517202377,0.00430000014603138,0.027300000190734863,-0.023600000888109207,-0.017500000074505806,-0.04820000007748604]},{"ayah_id":"4:64","surah":4,"ayah":64,"arabic":"وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا لِيُطَاعَ بِإِذْنِ اللَّهِ ۚ وَلَوْ أَنَّهُمْ إِذ ظَّلَمُوا أَنفُسَهُمْ جَاءُوكَ فَاسْتَغْفَرُوا اللَّهَ وَاسْتَغْفَرَ لَهُمُ الرَّسُولُ لَوَجَدُوا اللَّهَ تَوَّابًا رَّحِيمًا","english":"And We have not sent any Messenger but that he must be obeyed by the command of Allah. And, (O Beloved,) if they, having wronged their souls, had come to you imploring the forgiveness of Allah, and the Messenger (blessings and peace be upon him) had also asked forgiveness for them, then (owing to this mediation and intercession) they would certainly have found Allah Most Relenting, Ever-Merciful.","vec_preview":[0.02539999969303608,0.007499999832361937,-0.032999999821186066,0.003000000026077032,0.011300000362098217,-0.043299999088048935,-0.009700000286102295,-0.04500000178813934]},{"ayah_id":"4:65","surah":4,"ayah":65,"arabic":"فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّىٰ يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوا فِي أَنفُسِهِمْ حَرَجًا مِّمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيمًا","english":"So, (O Beloved,) by your Lord, they cannot become true believers until they make you a judge in every dispute that arises amongst them, and thereafter they do not feel any resentment in their hearts against the judgment that you make, and submit (to your decision) gladly, with total submission.","vec_preview":[0.00800000037997961,0.027799999341368675,-0.053300000727176666,-0.0024999999441206455,0.03709999844431877,-0.05420000106096268,-0.008999999612569809,-0.05209999904036522]},{"ayah_id":"4:66","surah":4,"ayah":66,"arabic":"وَلَوْ أَنَّا كَتَبْنَا عَلَيْهِمْ أَنِ اقْتُلُوا أَنفُسَكُمْ أَوِ اخْرُجُوا مِن دِيَارِكُم مَّا فَعَلُوهُ إِلَّا قَلِيلٌ مِّنْهُمْ ۖ وَلَوْ أَنَّهُمْ فَعَلُوا مَا يُوعَظُونَ بِهِ لَكَانَ خَيْرًا لَّهُمْ وَأَشَدَّ تَثْبِيتًا","english":"If We had prescribed for them: ‘Kill yourselves, or leave your homes and go away,’ only a few of them would have acted upon it. If they had abided by what they were advised to do, that would have been in their favour, enabling them to tenaciously hold fast (to the Faith).","vec_preview":[-0.0020000000949949026,0.005900000222027302,-0.030500000342726707,0.0006000000284984708,0.018300000578165054,-0.047200001776218414,-0.02539999969303608,-0.04450000077486038]},{"ayah_id":"4:67","surah":4,"ayah":67,"arabic":"وَإِذًا لَّآتَيْنَاهُم مِّن لَّدُنَّا أَجْرًا عَظِيمًا","english":"And then We too would have bestowed upon them a great reward from Our presence.","vec_preview":[-0.024700000882148743,0.014000000432133675,-0.006000000052154064,-0.0032999999821186066,0.02419999986886978,-0.025599999353289604,-0.026200000196695328,-0.044199999421834946]},{"ayah_id":"4:68","surah":4,"ayah":68,"arabic":"وَلَهَدَيْنَاهُمْ صِرَاطًا مُّسْتَقِيمًا","english":"And We would have surely guided them to the straight path.","vec_preview":[-0.017100000753998756,0.02070000022649765,-0.023099999874830246,-0.006099999882280827,0.026200000196695328,0.0003000000142492354,-0.017899999395012856,-0.03189999982714653]},{"ayah_id":"4:69","surah":4,"ayah":69,"arabic":"وَمَن يُطِعِ اللَّهَ وَالرَّسُولَ فَأُولَـٰئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِم مِّنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ ۚ وَحَسُنَ أُولَـٰئِكَ رَفِيقًا","english":"And whoever obeys Allah and His Messenger (blessings and peace be upon him) are the people who will be in the company of those (spiritual dignitaries on the Last Day) whom Allah has blessed with His (special) favour: the Prophets, the truthful, the martyrs and the most pious. And how excellent these companions are!","vec_preview":[0.011599999852478504,0.007000000216066837,-0.024399999529123306,0.00559999980032444,0.03689999878406525,-0.04659999907016754,-0.01679999940097332,-0.03269999846816063]},{"ayah_id":"4:70","surah":4,"ayah":70,"arabic":"ذَٰلِكَ الْفَضْلُ مِنَ اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ عَلِيمًا","english":"This (exceptional) bounty is from Allah, and Allah suffices as a Knower.","vec_preview":[0.00419999985024333,0.011099999770522118,-0.031300000846385956,-0.002400000113993883,0.03449999913573265,-0.026499999687075615,-0.02500000037252903,-0.042100001126527786]},{"ayah_id":"4:71","surah":4,"ayah":71,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا خُذُوا حِذْرَكُمْ فَانفِرُوا ثُبَاتٍ أَوِ انفِرُوا جَمِيعًا","english":"O believers! Fit out for your safeguard, then set out as separate units or march off all together.","vec_preview":[0.012799999676644802,0.032099999487400055,-0.03610000014305115,-0.002199999988079071,0.042399998754262924,-0.058400001376867294,-0.017100000753998756,-0.04450000077486038]},{"ayah_id":"4:72","surah":4,"ayah":72,"arabic":"وَإِنَّ مِنكُمْ لَمَن لَّيُبَطِّئَنَّ فَإِنْ أَصَابَتْكُم مُّصِيبَةٌ قَالَ قَدْ أَنْعَمَ اللَّهُ عَلَيَّ إِذْ لَمْ أَكُن مَّعَهُمْ شَهِيدًا","english":"And certainly there are some amongst you who delay (slackening intentionally). Then if (during war) some adversity befalls you, he (who tarries behind) says: ‘Indeed, Allah has favoured me in that I was not present with them (in the battlefield).’","vec_preview":[0.018799999728798866,0.01510000042617321,-0.031300000846385956,-0.0071000000461936,0.03830000013113022,-0.04399999976158142,-0.023600000888109207,-0.03920000046491623]},{"ayah_id":"4:73","surah":4,"ayah":73,"arabic":"وَلَئِنْ أَصَابَكُمْ فَضْلٌ مِّنَ اللَّهِ لَيَقُولَنَّ كَأَن لَّمْ تَكُن بَيْنَكُمْ وَبَيْنَهُ مَوَدَّةٌ يَا لَيْتَنِي كُنتُ مَعَهُمْ فَأَفُوزَ فَوْزًا عَظِيمًا","english":"But if some favour comes to you from Allah, (then) the same (hypocrite) shall (regretfully) say, as if there was no friendship between you and him: ‘Would that I had been with them, then I would also have achieved a massive triumph!’","vec_preview":[0.018200000748038292,0.0066999997943639755,-0.02879999950528145,-0.014600000344216824,0.03150000050663948,-0.03229999914765358,-0.03550000116229057,-0.04569999873638153]},{"ayah_id":"4:74","surah":4,"ayah":74,"arabic":"۞ فَلْيُقَاتِلْ فِي سَبِيلِ اللَّهِ الَّذِينَ يَشْرُونَ الْحَيَاةَ الدُّنْيَا بِالْآخِرَةِ ۚ وَمَن يُقَاتِلْ فِي سَبِيلِ اللَّهِ فَيُقْتَلْ أَوْ يَغْلِبْ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا","english":"So they (the believers) who sell the life of this world for the Hereafter should fight in the cause of Allah (for the establishment of peace and elimination of terrorism). And whoever fights in the way of Allah, whether he (himself) gets slain or wins victory, (in both cases) We shall soon bless him with great reward.","vec_preview":[0.0027000000700354576,0.010400000028312206,-0.027300000190734863,-0.0008999999845400453,0.03530000150203705,-0.056699998676776886,-0.013700000010430813,-0.03840000182390213]},{"ayah_id":"4:75","surah":4,"ayah":75,"arabic":"وَمَا لَكُمْ لَا تُقَاتِلُونَ فِي سَبِيلِ اللَّهِ وَالْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ الَّذِينَ يَقُولُونَ رَبَّنَا أَخْرِجْنَا مِنْ هَـٰذِهِ الْقَرْيَةِ الظَّالِمِ أَهْلُهَا وَاجْعَل لَّنَا مِن لَّدُنكَ وَلِيًّا وَاجْعَل لَّنَا مِن لَّدُنكَ نَصِيرًا","english":"What has happened to you (Muslims) that you do not fight in the cause of Allah (for the freedom of the oppressed), whereas those helpless (oppressed and tyrannized) men, women and children who (depressed by the plunder and carnage) call out (for their freedom): ‘O our Lord! Rescue us from this town whose (affluent and influential) people are oppressors, and appoint for us some guardian from Your presence, and make someone our helper from Your presence’?","vec_preview":[0.012600000016391277,-0.0026000000070780516,-0.03150000050663948,-0.0071000000461936,0.045099999755620956,-0.035999998450279236,-0.010300000198185444,-0.054999999701976776]},{"ayah_id":"4:76","surah":4,"ayah":76,"arabic":"الَّذِينَ آمَنُوا يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ ۖ وَالَّذِينَ كَفَرُوا يُقَاتِلُونَ فِي سَبِيلِ الطَّاغُوتِ فَقَاتِلُوا أَوْلِيَاءَ الشَّيْطَانِ ۖ إِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفًا","english":"Those who believe fight in the way of Allah (for the restoration of peace and elimination of oppression and exploitation), and those who disbelieve fight in the way of Satan (for evil and mischievous objectives). So, (O believers,) fight against Satan’s allies (the enemies of humankind). Surely, Satan’s maneuvering is ineffective.","vec_preview":[-0.00570000009611249,0.004100000020116568,-0.034299999475479126,0.0012000000569969416,0.04520000144839287,-0.05999999865889549,-0.03269999846816063,-0.03669999912381172]},{"ayah_id":"4:77","surah":4,"ayah":77,"arabic":"أَلَمْ تَرَ إِلَى الَّذِينَ قِيلَ لَهُمْ كُفُّوا أَيْدِيَكُمْ وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ إِذَا فَرِيقٌ مِّنْهُمْ يَخْشَوْنَ النَّاسَ كَخَشْيَةِ اللَّهِ أَوْ أَشَدَّ خَشْيَةً ۚ وَقَالُوا رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا الْقِتَالَ لَوْلَا أَخَّرْتَنَا إِلَىٰ أَجَلٍ قَرِيبٍ ۗ قُلْ مَتَاعُ الدُّنْيَا قَلِيلٌ وَالْآخِرَةُ خَيْرٌ لِّمَنِ اتَّقَىٰ وَلَا تُظْلَمُونَ فَتِيلًا","english":"Have you not observed the state of those who were instructed: ‘Restrain your hands (even from defensive fighting), and establish Prayer and pay Zakat (the Alms-due) regularly’? (So they were happy with it.) But when the armed struggle (against tyranny and aggression) was prescribed for them, a section of them started fearing (hostile) people the way one fears Allah or even more. And they said: ‘O our Lord! Why have You enjoined fighting upon us (so soon)? Why have You not given us respite for another short period?’ Say (to them): ‘Worldly interest is minor (i.e., immaterial) whilst the Hereafter is an extremely valuable (blessing) for the one who becomes Godwary and pious. There, you shall not be treated unjustly even equal to a thread.’","vec_preview":[-0.002099999925121665,0.025200000032782555,-0.031199999153614044,-0.014600000344216824,0.05220000073313713,-0.02590000070631504,-0.02410000003874302,-0.051500000059604645]},{"ayah_id":"4:78","surah":4,"ayah":78,"arabic":"أَيْنَمَا تَكُونُوا يُدْرِككُّمُ الْمَوْتُ وَلَوْ كُنتُمْ فِي بُرُوجٍ مُّشَيَّدَةٍ ۗ وَإِن تُصِبْهُمْ حَسَنَةٌ يَقُولُوا هَـٰذِهِ مِنْ عِندِ اللَّهِ ۖ وَإِن تُصِبْهُمْ سَيِّئَةٌ يَقُولُوا هَـٰذِهِ مِنْ عِندِكَ ۚ قُلْ كُلٌّ مِّنْ عِندِ اللَّهِ ۖ فَمَالِ هَـٰؤُلَاءِ الْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا","english":"(O you who abstain from the armed struggle due to fear of death!) Death will overtake you wherever you may be, (even) if you are in unconquerable fortresses. And (their mentality is such that) if some good fortune (benefit) comes to them, they say: ‘It is from Allah (i.e., intermediation and benevolence of the Messenger has no role in it),’ and if some adversity befalls them, they say: ‘(O Messenger!) It is from you (i.e., because of you).’ Say: ‘(In fact,) all comes from Allah.’ So, what has gone wrong with these people that they do not feel inclined to understand anything?","vec_preview":[0.004900000058114529,0.028999999165534973,-0.02710000053048134,0.008899999782443047,0.052400000393390656,-0.03359999880194664,-0.03500000014901161,-0.03880000114440918]},{"ayah_id":"4:79","surah":4,"ayah":79,"arabic":"مَّا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ ۖ وَمَا أَصَابَكَ مِن سَيِّئَةٍ فَمِن نَّفْسِكَ ۚ وَأَرْسَلْنَاكَ لِلنَّاسِ رَسُولًا ۚ وَكَفَىٰ بِاللَّهِ شَهِيدًا","english":"(O man! Train your self this way that) if some good fortune comes to you, (consider that) it is from Allah (do not attribute it to the excellence of your strategy). And when some misfortune befalls, you (believe that) it is from yourself (attribute it to the evil in your own self). And, (O Beloved,) We have sent you as a Messenger to the whole mankind, and Allah is Sufficient as a witness (to your Messengership).","vec_preview":[0.030700000002980232,0.009499999694526196,-0.03550000116229057,-0.0010999999940395355,0.02019999921321869,-0.041999999433755875,-0.012500000186264515,-0.03909999877214432]},{"ayah_id":"4:80","surah":4,"ayah":80,"arabic":"مَّن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ ۖ وَمَن تَوَلَّىٰ فَمَا أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظًا","english":"Whoever obeys the Messenger (blessings and peace be upon him) obeys (but) Allah indeed, but he who turns away, then We have not sent you to watch over them.","vec_preview":[0.0017999999690800905,0.010900000110268593,-0.022199999541044235,0.012199999764561653,0.011099999770522118,-0.03620000183582306,-0.00860000029206276,-0.030700000002980232]},{"ayah_id":"4:81","surah":4,"ayah":81,"arabic":"وَيَقُولُونَ طَاعَةٌ فَإِذَا بَرَزُوا مِنْ عِندِكَ بَيَّتَ طَائِفَةٌ مِّنْهُمْ غَيْرَ الَّذِي تَقُولُ ۖ وَاللَّهُ يَكْتُبُ مَا يُبَيِّتُونَ ۖ فَأَعْرِضْ عَنْهُمْ وَتَوَكَّلْ عَلَى اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا","english":"And (the state of these hypocrites is such that in your presence) they say: ‘(We) have obeyed (your order).’ But when they depart from your presence, a section of them opine at night contrary to what you have said (and indulge in intriguing consultations). And Allah is recording (all that) which they plot all night. So, (O Beloved Prophet,) turn away your illumined face from them and trust Allah, and Sufficient is Allah as a Guardian.","vec_preview":[0.005400000140070915,0.021199999377131462,-0.025100000202655792,-0.0010000000474974513,0.036400001496076584,-0.008299999870359898,-0.020800000056624413,-0.0494999997317791]},{"ayah_id":"4:82","surah":4,"ayah":82,"arabic":"أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ ۚ وَلَوْ كَانَ مِنْ عِندِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا","english":"Do they not ponder over the Qur’an? Had this (Qur’an come) from anyone other than Allah, these people would have found in it many contradictions.","vec_preview":[0.0032999999821186066,0.017899999395012856,-0.028999999165534973,-0.006800000090152025,0.0035000001080334187,-0.04569999873638153,-0.019899999722838402,-0.02280000038444996]},{"ayah_id":"4:83","surah":4,"ayah":83,"arabic":"وَإِذَا جَاءَهُمْ أَمْرٌ مِّنَ الْأَمْنِ أَوِ الْخَوْفِ أَذَاعُوا بِهِ ۖ وَلَوْ رَدُّوهُ إِلَى الرَّسُولِ وَإِلَىٰ أُولِي الْأَمْرِ مِنْهُمْ لَعَلِمَهُ الَّذِينَ يَسْتَنبِطُونَهُ مِنْهُمْ ۗ وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ لَاتَّبَعْتُمُ الشَّيْطَانَ إِلَّا قَلِيلًا","english":"When there comes to them any news of peace or fear, they spread it around. Had they referred it to the Messenger (blessings and peace be upon him), or those of them who are in command (instead of making it public), then those amongst them who can draw conclusion from some matter would have found it (i.e., the truth of the news). Had there not been Allah’s favour to you and His mercy, certainly you would (all) have followed Satan except only a few.","vec_preview":[0.0017999999690800905,0.023000000044703484,-0.03840000182390213,-0.00139999995008111,0.02370000071823597,-0.05139999836683273,-0.01209999993443489,-0.04129999876022339]},{"ayah_id":"4:84","surah":4,"ayah":84,"arabic":"فَقَاتِلْ فِي سَبِيلِ اللَّهِ لَا تُكَلَّفُ إِلَّا نَفْسَكَ ۚ وَحَرِّضِ الْمُؤْمِنِينَ ۖ عَسَى اللَّهُ أَن يَكُفَّ بَأْسَ الَّذِينَ كَفَرُوا ۚ وَاللَّهُ أَشَدُّ بَأْسًا وَأَشَدُّ تَنكِيلًا","english":"So, (O Beloved,) fight in the cause of Allah (in your defence). You will not be held responsible (for anyone else) but your own soul. And motivate the believers (to fight the miscreants who impose aggression and war upon you). It will be no wonder if Allah smashes the attacking power of the disbelievers. And Allah is Strongest in hold as well as Hardest in punishment.","vec_preview":[0.005400000140070915,0.014399999752640724,-0.02590000070631504,0.007899999618530273,0.031599998474121094,-0.04639999940991402,-0.019500000402331352,-0.03680000081658363]},{"ayah_id":"4:85","surah":4,"ayah":85,"arabic":"مَّن يَشْفَعْ شَفَاعَةً حَسَنَةً يَكُن لَّهُ نَصِيبٌ مِّنْهَا ۖ وَمَن يَشْفَعْ شَفَاعَةً سَيِّئَةً يَكُن لَّهُ كِفْلٌ مِّنْهَا ۗ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ مُّقِيتًا","english":"Whoever makes a righteous intercession has a (fixed) share (in its reward), and he who makes an evil intercession has a (fixed) share (in its sin), and Allah has full control over everything.","vec_preview":[-0.0010000000474974513,0.02319999970495701,-0.03189999982714653,0.017500000074505806,0.010700000450015068,-0.03280000016093254,-0.041600000113248825,-0.020500000566244125]},{"ayah_id":"4:86","surah":4,"ayah":86,"arabic":"وَإِذَا حُيِّيتُم بِتَحِيَّةٍ فَحَيُّوا بِأَحْسَنَ مِنْهَا أَوْ رُدُّوهَا ۗ إِنَّ اللَّهَ كَانَ عَلَىٰ كُلِّ شَيْءٍ حَسِيبًا","english":"And when you are honoured with (a word of) greeting, then (in reply) greet with a better (salutation) or (at least) reciprocate (in the same words). Surely, Allah takes account of everything.","vec_preview":[0.0066999997943639755,0.000699999975040555,-0.03009999915957451,-0.002400000113993883,0.0215000007301569,-0.030799999833106995,-0.023600000888109207,-0.02879999950528145]},{"ayah_id":"4:87","surah":4,"ayah":87,"arabic":"اللَّهُ لَا إِلَـٰهَ إِلَّا هُوَ ۚ لَيَجْمَعَنَّكُمْ إِلَىٰ يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ ۗ وَمَنْ أَصْدَقُ مِنَ اللَّهِ حَدِيثًا","english":"Allah is He besides Whom there is none worthy of worship. He shall certainly gather you on the Day of Resurrection about which there is no doubt. And who is more truthful in word than Allah?","vec_preview":[0.0008999999845400453,0.02410000003874302,-0.030899999663233757,0.007400000002235174,0.03629999980330467,-0.030500000342726707,-0.014399999752640724,-0.05260000005364418]},{"ayah_id":"4:88","surah":4,"ayah":88,"arabic":"۞ فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ وَاللَّهُ أَرْكَسَهُم بِمَا كَسَبُوا ۚ أَتُرِيدُونَ أَن تَهْدُوا مَنْ أَضَلَّ اللَّهُ ۖ وَمَن يُضْلِلِ اللَّهُ فَلَن تَجِدَ لَهُ سَبِيلًا","english":"So what has happened to you that you are split into two groups with regard to the hypocrites, whilst Allah has overturned them (i.e., their reason and contemplation) owing to their misdeeds? Do you seek to guide him to the straight road whom Allah has held strayed (because of his own misdeeds)? And, (O listener,) you cannot at all find a way (of guidance) for him whom Allah holds misguided.","vec_preview":[0.013799999840557575,0.021900000050663948,-0.025200000032782555,-0.008799999952316284,0.032099999487400055,-0.05480000004172325,0.0010000000474974513,-0.04699999839067459]},{"ayah_id":"4:89","surah":4,"ayah":89,"arabic":"وَدُّوا لَوْ تَكْفُرُونَ كَمَا كَفَرُوا فَتَكُونُونَ سَوَاءً ۖ فَلَا تَتَّخِذُوا مِنْهُمْ أَوْلِيَاءَ حَتَّىٰ يُهَاجِرُوا فِي سَبِيلِ اللَّهِ ۚ فَإِن تَوَلَّوْا فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ وَجَدتُّمُوهُمْ ۖ وَلَا تَتَّخِذُوا مِنْهُمْ وَلِيًّا وَلَا نَصِيرًا","english":"They (the hypocrites) wish that you should also disbelieve as they have disbelieved so that you all might become alike. So do not make friends with (any of) them until they emigrate in the way of Allah (in order to prove their sincerity and truthfulness). Then, if they turn away (and start war against you), seize them and kill them wherever you find them (during the war), and take not (any of) them either for a friend or for a helper.","vec_preview":[0.0035000001080334187,0.02070000022649765,-0.027699999511241913,-0.0005000000237487257,0.01510000042617321,-0.060100000351667404,-0.007899999618530273,-0.04500000178813934]},{"ayah_id":"4:90","surah":4,"ayah":90,"arabic":"إِلَّا الَّذِينَ يَصِلُونَ إِلَىٰ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُم مِّيثَاقٌ أَوْ جَاءُوكُمْ حَصِرَتْ صُدُورُهُمْ أَن يُقَاتِلُوكُمْ أَوْ يُقَاتِلُوا قَوْمَهُمْ ۚ وَلَوْ شَاءَ اللَّهُ لَسَلَّطَهُمْ عَلَيْكُمْ فَلَقَاتَلُوكُمْ ۚ فَإِنِ اعْتَزَلُوكُمْ فَلَمْ يُقَاتِلُوكُمْ وَأَلْقَوْا إِلَيْكُمُ السَّلَمَ فَمَا جَعَلَ اللَّهُ لَكُمْ عَلَيْهِمْ سَبِيلًا","english":"But (do not fight) those who have allied with a people that between you and them there is a (peace) treaty, or who (losing heart) come to you in such a state that their breasts are afflicted (with this obsession) whether they should fight you or their own people. If Allah had so willed, He (strengthening their hearts) would have given them supremacy over you. Then they would certainly have fought you. So if they keep away from you and do not fight you and send you (a message) for peace, then (in the interest of peace) Allah has left no way open for you (to launch any aggression) against them.","vec_preview":[0.012299999594688416,0.03099999949336052,-0.03840000182390213,0.007699999958276749,0.03700000047683716,-0.057100001722574234,-0.017899999395012856,-0.03889999911189079]},{"ayah_id":"4:91","surah":4,"ayah":91,"arabic":"سَتَجِدُونَ آخَرِينَ يُرِيدُونَ أَن يَأْمَنُوكُمْ وَيَأْمَنُوا قَوْمَهُمْ كُلَّ مَا رُدُّوا إِلَى الْفِتْنَةِ أُرْكِسُوا فِيهَا ۚ فَإِن لَّمْ يَعْتَزِلُوكُمْ وَيُلْقُوا إِلَيْكُمُ السَّلَمَ وَيَكُفُّوا أَيْدِيَهُمْ فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ ۚ وَأُولَـٰئِكُمْ جَعَلْنَا لَكُمْ عَلَيْهِمْ سُلْطَانًا مُّبِينًا","english":"Now you will find another category of people who desire to remain free of any threat from you (by hypocritically pretending to believe), and (also) live in peace from their own community (by siding with disbelievers secretly. But their true state is this that) whenever they are turned to mischief (and wickedness against Muslims), they plunge (headlong) into it. So if they do not give up (fighting against you, nor) send you any (message for) peace, (nor) hold their hands off (their disruptive activities), then seize (and capture) them and kill them wherever you find them. And it is they against whom We have granted you unrestricted authority.","vec_preview":[0.003100000089034438,0.032099999487400055,-0.03680000081658363,-0.008500000461935997,0.044199999421834946,-0.035100001841783524,-0.019600000232458115,-0.039900001138448715]},{"ayah_id":"4:92","surah":4,"ayah":92,"arabic":"وَمَا كَانَ لِمُؤْمِنٍ أَن يَقْتُلَ مُؤْمِنًا إِلَّا خَطَأً ۚ وَمَن قَتَلَ مُؤْمِنًا خَطَأً فَتَحْرِيرُ رَقَبَةٍ مُّؤْمِنَةٍ وَدِيَةٌ مُّسَلَّمَةٌ إِلَىٰ أَهْلِهِ إِلَّا أَن يَصَّدَّقُوا ۚ فَإِن كَانَ مِن قَوْمٍ عَدُوٍّ لَّكُمْ وَهُوَ مُؤْمِنٌ فَتَحْرِيرُ رَقَبَةٍ مُّؤْمِنَةٍ ۖ وَإِن كَانَ مِن قَوْمٍ بَيْنَكُمْ وَبَيْنَهُم مِّيثَاقٌ فَدِيَةٌ مُّسَلَّمَةٌ إِلَىٰ أَهْلِهِ وَتَحْرِيرُ رَقَبَةٍ مُّؤْمِنَةٍ ۖ فَمَن لَّمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ تَوْبَةً مِّنَ اللَّهِ ۗ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا","english":"And it is not (lawful) for a Muslim to kill a Muslim but by mistake. And anyone who kills a Muslim unintentionally shall (be liable to) free a Muslim slave and (pay) blood money, to be (necessarily) handed over to the heirs of the person slain, unless they remit it. In case, he (the slain) comes from the people who are your enemies and is a believer (as well), then (only) freeing a (male or female) slave is prescribed. But if he (the slain) belongs to a people that between you and them there is a (peace) treaty, then blood compensation must be delivered to his family, and freeing a Muslim (male or female) slave is also mandatory. Then he who does not find (a slave) is (bound) to fast for two consecutive months. (This is his) repentance (prescribed) by Allah. And Allah is All-Knowing, Most Wise.","vec_preview":[0.006000000052154064,0.0272000003606081,-0.025599999353289604,0.002099999925121665,0.0478999987244606,-0.04170000180602074,-0.03579999879002571,-0.03849999979138374]},{"ayah_id":"4:93","surah":4,"ayah":93,"arabic":"وَمَن يَقْتُلْ مُؤْمِنًا مُّتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا وَغَضِبَ اللَّهُ عَلَيْهِ وَلَعَنَهُ وَأَعَدَّ لَهُ عَذَابًا عَظِيمًا","english":"But he who kills a Muslim deliberately, his sentence will be Hell wherein will he abide for ages. Allah will afflict him with His wrath and will cast His curse on him. And He has prepared for him a dreadful torment.","vec_preview":[0.004699999932199717,0.011900000274181366,-0.027899999171495438,0.019600000232458115,0.03139999881386757,-0.05220000073313713,-0.026599999517202377,-0.03680000081658363]},{"ayah_id":"4:94","surah":4,"ayah":94,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا ضَرَبْتُمْ فِي سَبِيلِ اللَّهِ فَتَبَيَّنُوا وَلَا تَقُولُوا لِمَنْ أَلْقَىٰ إِلَيْكُمُ السَّلَامَ لَسْتَ مُؤْمِنًا تَبْتَغُونَ عَرَضَ الْحَيَاةِ الدُّنْيَا فَعِندَ اللَّهِ مَغَانِمُ كَثِيرَةٌ ۚ كَذَٰلِكَ كُنتُم مِّن قَبْلُ فَمَنَّ اللَّهُ عَلَيْكُمْ فَتَبَيَّنُوا ۚ إِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا","english":"O believers! When you set out (to fight) in the way of Allah, carry out a careful probe, and do not say to him who greets you (as a Muslim): ‘You are not a believer.’ You seek goods of the worldly life (in the shape of spoils of war, after killing a Muslim declaring him a disbeliever). So, (rest assured that) Allah has gains and booties in plenty. Before this you (too) were the same. Then Allah conferred on you His Favour (and you became Muslims). So investigate and confirm the truth (about others as well). Surely, Allah is Well Aware of what you do.","vec_preview":[0.0044999998062849045,0.007799999788403511,-0.03229999914765358,-0.016599999740719795,0.05730000138282776,-0.03550000116229057,-0.014700000174343586,-0.04879999905824661]},{"ayah_id":"4:95","surah":4,"ayah":95,"arabic":"لَّا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ غَيْرُ أُولِي الضَّرَرِ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِهِمْ وَأَنفُسِهِمْ ۚ فَضَّلَ اللَّهُ الْمُجَاهِدِينَ بِأَمْوَالِهِمْ وَأَنفُسِهِمْ عَلَى الْقَاعِدِينَ دَرَجَةً ۚ وَكُلًّا وَعَدَ اللَّهُ الْحُسْنَىٰ ۚ وَفَضَّلَ اللَّهُ الْمُجَاهِدِينَ عَلَى الْقَاعِدِينَ أَجْرًا عَظِيمًا","english":"Those of the Muslims who (shirking fight) stay back (home) without any stressful condition (i.e., excuse), and those who fight in the cause of Allah with their material as well as human resources cannot be equal (in their reward and rank). Allah has exalted in rank those who fight in the cause of Allah with their material as well as human resources above those who stay back withdrawn. Allah has (surely) promised good to all (the believers, yet) He has bestowed the merit of excellence with a mighty reward (and bounty) on those who strive hard over those who stay behind.","vec_preview":[-0.006200000178068876,0.03220000118017197,-0.03889999911189079,-0.005499999970197678,0.02889999933540821,-0.026900000870227814,-0.019700000062584877,-0.045899998396635056]},{"ayah_id":"4:96","surah":4,"ayah":96,"arabic":"دَرَجَاتٍ مِّنْهُ وَمَغْفِرَةً وَرَحْمَةً ۚ وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا","english":"There are (for them multiple) degrees of higher grades from Him and forgiveness and mercy. And Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.009800000116229057,0.012400000356137753,-0.024299999698996544,-0.0017000000225380063,0.013100000098347664,-0.039799999445676804,-0.012000000104308128,-0.025499999523162842]},{"ayah_id":"4:97","surah":4,"ayah":97,"arabic":"إِنَّ الَّذِينَ تَوَفَّاهُمُ الْمَلَائِكَةُ ظَالِمِي أَنفُسِهِمْ قَالُوا فِيمَ كُنتُمْ ۖ قَالُوا كُنَّا مُسْتَضْعَفِينَ فِي الْأَرْضِ ۚ قَالُوا أَلَمْ تَكُنْ أَرْضُ اللَّهِ وَاسِعَةً فَتُهَاجِرُوا فِيهَا ۚ فَأُولَـٰئِكَ مَأْوَاهُمْ جَهَنَّمُ ۖ وَسَاءَتْ مَصِيرًا","english":"Indeed, those whose lives the angels take in such a state that (due to living in an environment of disbelief and dissension) they have ruined their souls, the angels ask them: ‘What condition were you in? (You neither protected your Din [Religion] and faith, nor left the land of disbelief and dissension.)’ They (regretfully) reply: ‘We were powerless and helpless in the land.’ The angels will say: ‘Was Allah’s earth not vast enough for you to migrate in it (somewhere)?’ So it is they whose abode is Hell, and what an evil abode that is!","vec_preview":[0.009100000374019146,0.022700000554323196,-0.039000000804662704,-0.009700000286102295,0.04390000179409981,-0.041600000113248825,-0.01549999974668026,-0.03229999914765358]},{"ayah_id":"4:98","surah":4,"ayah":98,"arabic":"إِلَّا الْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ لَا يَسْتَطِيعُونَ حِيلَةً وَلَا يَهْتَدُونَ سَبِيلًا","english":"Except for those really helpless men, women and children who neither are capable to make any plan, nor do they know any way (to escape from there).","vec_preview":[0.013000000268220901,0.010200000368058681,-0.02969999983906746,0.018300000578165054,0.028599999845027924,-0.047200001776218414,-0.016599999740719795,-0.035100001841783524]},{"ayah_id":"4:99","surah":4,"ayah":99,"arabic":"فَأُولَـٰئِكَ عَسَى اللَّهُ أَن يَعْفُوَ عَنْهُمْ ۚ وَكَانَ اللَّهُ عَفُوًّا غَفُورًا","english":"They are those whom Allah shall certainly spare, and Allah is Most Pardoning, Most Forgiving.","vec_preview":[-0.007400000002235174,0.015200000256299973,-0.011900000274181366,-0.0019000000320374966,0.010599999688565731,-0.042500000447034836,-0.004999999888241291,-0.032999999821186066]},{"ayah_id":"4:100","surah":4,"ayah":100,"arabic":"۞ وَمَن يُهَاجِرْ فِي سَبِيلِ اللَّهِ يَجِدْ فِي الْأَرْضِ مُرَاغَمًا كَثِيرًا وَسَعَةً ۚ وَمَن يَخْرُجْ مِن بَيْتِهِ مُهَاجِرًا إِلَى اللَّهِ وَرَسُولِهِ ثُمَّ يُدْرِكْهُ الْمَوْتُ فَقَدْ وَقَعَ أَجْرُهُ عَلَى اللَّهِ ۗ وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا","english":"And he who emigrates leaving his home in the way of Allah will find (for hijra—migration) many places in the earth and plentiful provision (for sustenance), and he who leaves his home, migrating towards Allah and His Messenger (blessings and peace be upon him), and then death overtakes him (on the way), his reward with Allah is ensured and Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.017500000074505806,0.0203000009059906,-0.034299999475479126,-0.0066999997943639755,0.010300000198185444,-0.043800000101327896,-0.008799999952316284,-0.02759999968111515]},{"ayah_id":"4:101","surah":4,"ayah":101,"arabic":"وَإِذَا ضَرَبْتُمْ فِي الْأَرْضِ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَقْصُرُوا مِنَ الصَّلَاةِ إِنْ خِفْتُمْ أَن يَفْتِنَكُمُ الَّذِينَ كَفَرُوا ۚ إِنَّ الْكَافِرِينَ كَانُوا لَكُمْ عَدُوًّا مُّبِينًا","english":"And when you travel in the land, there will be no sin on you if you shorten the Prayer (i.e., offer two instead of four mandatory cycles), if you fear that the disbelievers are likely to afflict you with distress. Assuredly, the disbelievers are your open enemies.","vec_preview":[9.999999747378752e-05,0.0203000009059906,-0.043299999088048935,0.013500000350177288,0.026000000536441803,-0.04619999974966049,-0.017999999225139618,-0.03920000046491623]},{"ayah_id":"4:102","surah":4,"ayah":102,"arabic":"وَإِذَا كُنتَ فِيهِمْ فَأَقَمْتَ لَهُمُ الصَّلَاةَ فَلْتَقُمْ طَائِفَةٌ مِّنْهُم مَّعَكَ وَلْيَأْخُذُوا أَسْلِحَتَهُمْ فَإِذَا سَجَدُوا فَلْيَكُونُوا مِن وَرَائِكُمْ وَلْتَأْتِ طَائِفَةٌ أُخْرَىٰ لَمْ يُصَلُّوا فَلْيُصَلُّوا مَعَكَ وَلْيَأْخُذُوا حِذْرَهُمْ وَأَسْلِحَتَهُمْ ۗ وَدَّ الَّذِينَ كَفَرُوا لَوْ تَغْفُلُونَ عَنْ أَسْلِحَتِكُمْ وَأَمْتِعَتِكُمْ فَيَمِيلُونَ عَلَيْكُم مَّيْلَةً وَاحِدَةً ۚ وَلَا جُنَاحَ عَلَيْكُمْ إِن كَانَ بِكُمْ أَذًى مِّن مَّطَرٍ أَوْ كُنتُم مَّرْضَىٰ أَن تَضَعُوا أَسْلِحَتَكُمْ ۖ وَخُذُوا حِذْرَكُمْ ۗ إِنَّ اللَّهَ أَعَدَّ لِلْكَافِرِينَ عَذَابًا مُّهِينًا","english":"And, (O Beloved,) when you are (present) amongst these (soldiers), form up for them (congregational) Prayer. A squad of them, retaining their arms, should (first) stand by you (to follow you in Prayer); having performed their prostrations, they should (getting aside) take position in your rear. And (now) another squad who has not (yet) prayed should come up and pray with you (under your leadership); they should (also) hold on to their security measures and retain their weapons (persistently). The infidels want you to become neglectful of your weapons and other means of defence, and that they may launch a sudden attack against you. If you face a problem due to rain or illness, there is no harm if you (remove and) set your weapons aside, and hold fast to your means of security. Verily, Allah has prepared a humiliating torment for the disbelievers.","vec_preview":[0.011500000022351742,0.03280000016093254,-0.03959999978542328,0.02019999921321869,0.04650000110268593,-0.04910000041127205,-0.023499999195337296,-0.02290000021457672]},{"ayah_id":"4:103","surah":4,"ayah":103,"arabic":"فَإِذَا قَضَيْتُمُ الصَّلَاةَ فَاذْكُرُوا اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِكُمْ ۚ فَإِذَا اطْمَأْنَنتُمْ فَأَقِيمُوا الصَّلَاةَ ۚ إِنَّ الصَّلَاةَ كَانَتْ عَلَى الْمُؤْمِنِينَ كِتَابًا مَّوْقُوتًا","english":"So, (O Muslims,) when you have finished your Prayers, remember Allah (in all postures:) standing, sitting and (lying down) on your sides. And when (free of fear) you feel secure, establish Prayers (as prescribed). Verily, Prayer is obligatory for Muslims in accordance with the fixed timings.","vec_preview":[0.012500000186264515,0.01769999973475933,-0.03709999844431877,-0.006399999838322401,0.04430000111460686,-0.022199999541044235,-0.027699999511241913,-0.04399999976158142]},{"ayah_id":"4:104","surah":4,"ayah":104,"arabic":"وَلَا تَهِنُوا فِي ابْتِغَاءِ الْقَوْمِ ۖ إِن تَكُونُوا تَأْلَمُونَ فَإِنَّهُمْ يَأْلَمُونَ كَمَا تَأْلَمُونَ ۖ وَتَرْجُونَ مِنَ اللَّهِ مَا لَا يَرْجُونَ ۗ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا","english":"And do not slacken in pursuing the foes. If you are afflicted with pain (in this pursuit), then they also face but (similar) suffering as you are exposed to. But you have hope (of reward and bounty) from Allah which they do not. And Allah is All-Knowing, Most Wise.","vec_preview":[-0.012199999764561653,0.024000000208616257,-0.045899998396635056,-0.006800000090152025,0.03269999846816063,-0.049400001764297485,-0.031700000166893005,-0.04969999939203262]},{"ayah_id":"4:105","surah":4,"ayah":105,"arabic":"إِنَّا أَنزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ لِتَحْكُمَ بَيْنَ النَّاسِ بِمَا أَرَاكَ اللَّهُ ۚ وَلَا تَكُن لِّلْخَائِنِينَ خَصِيمًا","english":"(O Glorious Messenger!) Surely, We have revealed to you the Book based on Truth so that you may judge between the people in accordance with (the Truth) which Allah has shown to you. And (never) become a contender on behalf of the treacherous ones.","vec_preview":[0.009700000286102295,0.004699999932199717,-0.030899999663233757,-0.01860000006854534,0.021900000050663948,-0.03720000013709068,-0.01730000041425228,-0.052799999713897705]},{"ayah_id":"4:106","surah":4,"ayah":106,"arabic":"وَاسْتَغْفِرِ اللَّهَ ۖ إِنَّ اللَّهَ كَانَ غَفُورًا رَّحِيمًا","english":"And implore Allah’s forgiveness. Allah is indeed Most Forgiving, Ever-Merciful.","vec_preview":[0.01080000028014183,0.002099999925121665,-0.012600000016391277,-0.00860000029206276,0.01600000075995922,-0.03500000014901161,-0.013799999840557575,-0.029100000858306885]},{"ayah_id":"4:107","surah":4,"ayah":107,"arabic":"وَلَا تُجَادِلْ عَنِ الَّذِينَ يَخْتَانُونَ أَنفُسَهُمْ ۚ إِنَّ اللَّهَ لَا يُحِبُّ مَن كَانَ خَوَّانًا أَثِيمًا","english":"And do not plead (in defence of) those who are deceiving their own souls. Surely, Allah does not like anyone who is a committed betrayer and sinner.","vec_preview":[-0.019600000232458115,0.003000000026077032,-0.033799998462200165,-0.004800000227987766,0.03849999979138374,-0.027699999511241913,-0.027300000190734863,-0.03539999946951866]},{"ayah_id":"4:108","surah":4,"ayah":108,"arabic":"يَسْتَخْفُونَ مِنَ النَّاسِ وَلَا يَسْتَخْفُونَ مِنَ اللَّهِ وَهُوَ مَعَهُمْ إِذْ يُبَيِّتُونَ مَا لَا يَرْضَىٰ مِنَ الْقَوْلِ ۚ وَكَانَ اللَّهُ بِمَا يَعْمَلُونَ مُحِيطًا","english":"They hide (their deceitfulness) from people (feeling ashamed), but feel no shame before Allah, whilst He is with them when they hold consultations (secretly) at night about that matter which Allah disapproves. And Allah has encompassed whatever they do.","vec_preview":[-0.0034000000450760126,0.01119999960064888,-0.0364999994635582,-0.017799999564886093,0.05389999970793724,-0.027699999511241913,-0.01720000058412552,-0.04699999839067459]},{"ayah_id":"4:109","surah":4,"ayah":109,"arabic":"هَا أَنتُمْ هَـٰؤُلَاءِ جَادَلْتُمْ عَنْهُمْ فِي الْحَيَاةِ الدُّنْيَا فَمَن يُجَادِلُ اللَّهَ عَنْهُمْ يَوْمَ الْقِيَامَةِ أَم مَّن يَكُونُ عَلَيْهِمْ وَكِيلًا","english":"Beware! You are those who pleaded on their behalf in the life of this world, but who will contend with Allah on their behalf (even) on the Day of Resurrection, or who will be their advocate (on that Day too)?","vec_preview":[0.0010999999940395355,0.024299999698996544,-0.019300000742077827,0.0032999999821186066,0.016200000420212746,-0.02419999986886978,-0.005100000184029341,-0.04800000041723251]},{"ayah_id":"4:110","surah":4,"ayah":110,"arabic":"وَمَن يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللَّهَ يَجِدِ اللَّهَ غَفُورًا رَّحِيمًا","english":"And he who commits evil or wrongs his own soul and then seeks Allah’s forgiveness will find Allah Most Forgiving, Ever-Merciful.","vec_preview":[-0.00019999999494757503,-0.0026000000070780516,-0.03790000081062317,0.005200000014156103,0.015799999237060547,-0.04340000078082085,-0.008999999612569809,-0.02449999935925007]},{"ayah_id":"4:111","surah":4,"ayah":111,"arabic":"وَمَن يَكْسِبْ إِثْمًا فَإِنَّمَا يَكْسِبُهُ عَلَىٰ نَفْسِهِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا","english":"And whoever commits sin is only bringing (its consequent misery) to his own soul and Allah is All-Knowing, Most Wise.","vec_preview":[0.011300000362098217,0.013399999588727951,-0.03310000151395798,-0.008299999870359898,0.012400000356137753,-0.04769999906420708,-0.03400000184774399,-0.030700000002980232]},{"ayah_id":"4:112","surah":4,"ayah":112,"arabic":"وَمَن يَكْسِبْ خَطِيئَةً أَوْ إِثْمًا ثُمَّ يَرْمِ بِهِ بَرِيئًا فَقَدِ احْتَمَلَ بُهْتَانًا وَإِثْمًا مُّبِينًا","english":"And whoever commits some error or sin and then casts its blame on some blameless person has certainly taken (the burden of) a calumny and an open sin.","vec_preview":[0.017899999395012856,0.021900000050663948,-0.04430000111460686,0.009499999694526196,0.02070000022649765,-0.039400000125169754,-0.02800000086426735,-0.041600000113248825]},{"ayah_id":"4:113","surah":4,"ayah":113,"arabic":"وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكَ وَرَحْمَتُهُ لَهَمَّت طَّائِفَةٌ مِّنْهُمْ أَن يُضِلُّوكَ وَمَا يُضِلُّونَ إِلَّا أَنفُسَهُمْ ۖ وَمَا يَضُرُّونَكَ مِن شَيْءٍ ۚ وَأَنزَلَ اللَّهُ عَلَيْكَ الْكِتَابَ وَالْحِكْمَةَ وَعَلَّمَكَ مَا لَمْ تَكُن تَعْلَمُ ۚ وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا","english":"And, (O Beloved,) had not Allah’s bounty and mercy been upon you, a party of these (treacherous) people would have resolved to lead you astray, whereas they are only leading themselves astray and can no way do any harm to you. And Allah has revealed to you the Book and Wisdom and has bestowed upon you all that knowledge which you did not possess. Mighty indeed is Allah’s bounty on you.","vec_preview":[0.0032999999821186066,0.022099999710917473,-0.027300000190734863,-0.009399999864399433,0.020099999383091927,-0.045099999755620956,-0.00989999994635582,-0.03350000083446503]},{"ayah_id":"4:114","surah":4,"ayah":114,"arabic":"۞ لَّا خَيْرَ فِي كَثِيرٍ مِّن نَّجْوَاهُمْ إِلَّا مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ أَوْ إِصْلَاحٍ بَيْنَ النَّاسِ ۚ وَمَن يَفْعَلْ ذَٰلِكَ ابْتِغَاءَ مَرْضَاتِ اللَّهِ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا","english":"There is no good in most of their secret consultations except (the counsel) of the person who enjoins charity or piety or peace-making amongst people. And whoever does this, seeking Allah’s pleasure, We shall soon bless him with a mighty reward.","vec_preview":[0.01119999960064888,0.02810000069439411,-0.03310000151395798,-0.011800000444054604,0.0421999990940094,-0.035599999129772186,-0.015599999576807022,-0.03220000118017197]},{"ayah_id":"4:115","surah":4,"ayah":115,"arabic":"وَمَن يُشَاقِقِ الرَّسُولَ مِن بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَىٰ وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ نُوَلِّهِ مَا تَوَلَّىٰ وَنُصْلِهِ جَهَنَّمَ ۖ وَسَاءَتْ مَصِيرًا","english":"But whoever opposes the Messenger (blessings and peace be upon him) after the path of guidance has become clear to him, and follows the path other than that of the believers, We shall keep him in the same (state of disorientation) he has (himself) turned to, and shall (eventually) cast him into Hell and that is an evil dwelling.","vec_preview":[0.027499999850988388,0.007199999876320362,-0.029200000688433647,0.005100000184029341,0.01269999984651804,-0.06069999933242798,-0.020400000736117363,-0.04659999907016754]},{"ayah_id":"4:116","surah":4,"ayah":116,"arabic":"إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَاءُ ۚ وَمَن يُشْرِكْ بِاللَّهِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا","english":"Assuredly, Allah does not forgive (the sin of) setting up any partner with Him, but He forgives any (sin) lesser than that whom He wills. And the one who associates anything with Allah as His partner has surely strayed far off.","vec_preview":[-0.0010999999940395355,0.0020000000949949026,-0.03319999948143959,0.003599999938160181,0.021199999377131462,-0.04729999974370003,-0.02290000021457672,-0.04439999908208847]},{"ayah_id":"4:117","surah":4,"ayah":117,"arabic":"إِن يَدْعُونَ مِن دُونِهِ إِلَّا إِنَاثًا وَإِن يَدْعُونَ إِلَّا شَيْطَانًا مَّرِيدًا","english":"These (polytheists) merely worship the feminine objects apart from Allah, and they worship only Satan, the rebel,","vec_preview":[0.004999999888241291,0.007899999618530273,-0.023399999365210533,0.022099999710917473,0.02199999988079071,-0.02590000070631504,-0.013700000010430813,-0.0364999994635582]},{"ayah_id":"4:118","surah":4,"ayah":118,"arabic":"لَّعَنَهُ اللَّهُ ۘ وَقَالَ لَأَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِيبًا مَّفْرُوضًا","english":"(Satan) on whom Allah has laid His curse and who said: ‘I will certainly take (for myself) an appointed portion of Your servants.","vec_preview":[-0.0066999997943639755,0.00419999985024333,-0.028599999845027924,-0.012299999594688416,0.03009999915957451,-0.03310000151395798,-0.027300000190734863,-0.03759999945759773]},{"ayah_id":"4:119","surah":4,"ayah":119,"arabic":"وَلَأُضِلَّنَّهُمْ وَلَأُمَنِّيَنَّهُمْ وَلَآمُرَنَّهُمْ فَلَيُبَتِّكُنَّ آذَانَ الْأَنْعَامِ وَلَآمُرَنَّهُمْ فَلَيُغَيِّرُنَّ خَلْقَ اللَّهِ ۚ وَمَن يَتَّخِذِ الشَّيْطَانَ وَلِيًّا مِّن دُونِ اللَّهِ فَقَدْ خَسِرَ خُسْرَانًا مُّبِينًا","english":"I will, for sure, lead them astray, arouse in them foul aspirations and keep directing them. So they will definitely incise the ears of the cattle. And indeed, I shall command them persistently. So they will surely alter what Allah has created.’ And whoever forsakes Allah and takes Satan for a friend will most certainly suffer a perceptible loss.","vec_preview":[-0.00839999970048666,0.020999999716877937,-0.03020000085234642,0.0035000001080334187,0.015599999576807022,-0.04670000076293945,-0.01810000091791153,-0.0471000000834465]},{"ayah_id":"4:120","surah":4,"ayah":120,"arabic":"يَعِدُهُمْ وَيُمَنِّيهِمْ ۖ وَمَا يَعِدُهُمُ الشَّيْطَانُ إِلَّا غُرُورًا","english":"Satan makes (false) promises to them and stirs up in them (deceitful) hopes, and Satan makes not any promise to them except deception.","vec_preview":[-0.010700000450015068,0.022299999371170998,-0.02969999983906746,0.04100000113248825,0.02759999968111515,-0.03180000185966492,-0.01860000006854534,-0.032600000500679016]},{"ayah_id":"4:121","surah":4,"ayah":121,"arabic":"أُولَـٰئِكَ مَأْوَاهُمْ جَهَنَّمُ وَلَا يَجِدُونَ عَنْهَا مَحِيصًا","english":"They are the people whose abode is Hell, and they will not find any way to escape from it.","vec_preview":[-0.01640000008046627,-0.001500000013038516,-0.04089999943971634,0.019899999722838402,0.003800000064074993,-0.04050000011920929,-0.017899999395012856,-0.042500000447034836]},{"ayah_id":"4:122","surah":4,"ayah":122,"arabic":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَنُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ وَعْدَ اللَّهِ حَقًّا ۚ وَمَنْ أَصْدَقُ مِنَ اللَّهِ قِيلًا","english":"But those who have believed and persistently did pious acts, We shall soon admit them to Gardens with rivers flowing beneath. They will reside in them for ever. This is Allah’s true promise, and who can be more truthful in Word than Allah?","vec_preview":[0.011699999682605267,-0.0020000000949949026,-0.04960000142455101,-0.01269999984651804,0.03830000013113022,-0.043699998408555984,-0.02070000022649765,-0.03959999978542328]},{"ayah_id":"4:123","surah":4,"ayah":123,"arabic":"لَّيْسَ بِأَمَانِيِّكُمْ وَلَا أَمَانِيِّ أَهْلِ الْكِتَابِ ۗ مَن يَعْمَلْ سُوءًا يُجْزَ بِهِ وَلَا يَجِدْ لَهُ مِن دُونِ اللَّهِ وَلِيًّا وَلَا نَصِيرًا","english":"(Allah’s promise of salvation) does not accord with what you desire, nor with what the People of the Book aspire to. Whoever does an evil deed will be punished for it, and he will not find for himself any supporter or helper apart from Allah.","vec_preview":[0.007400000002235174,0.0027000000700354576,-0.03539999946951866,-0.009100000374019146,0.02850000001490116,-0.04479999840259552,-0.019500000402331352,-0.044599998742341995]},{"ayah_id":"4:124","surah":4,"ayah":124,"arabic":"وَمَن يَعْمَلْ مِنَ الصَّالِحَاتِ مِن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ فَأُولَـٰئِكَ يَدْخُلُونَ الْجَنَّةَ وَلَا يُظْلَمُونَ نَقِيرًا","english":"But anyone, whether man or woman, who does pious acts and is a believer, they are the ones who will enter Paradise and will not be wronged a speck.","vec_preview":[0.013000000268220901,-0.006099999882280827,-0.050599999725818634,-0.006099999882280827,0.014700000174343586,-0.04170000180602074,-0.008500000461935997,-0.04399999976158142]},{"ayah_id":"4:125","surah":4,"ayah":125,"arabic":"وَمَنْ أَحْسَنُ دِينًا مِّمَّنْ أَسْلَمَ وَجْهَهُ لِلَّهِ وَهُوَ مُحْسِنٌ وَاتَّبَعَ مِلَّةَ إِبْرَاهِيمَ حَنِيفًا ۗ وَاتَّخَذَ اللَّهُ إِبْرَاهِيمَ خَلِيلًا","english":"And with regard to adopting the Din (Religion), who can be better than the one who submits his whole being entirely to Allah, whilst he also holds spiritual excellence, and persistently follows the Din (Religion) of Ibrahim (Abraham)—a devotee (to Allah and) upright? And Allah had taken Ibrahim (Abraham) for a sincere and intimate friend. (So, he also becomes Allah’s friend by virtue of his spiritual affiliation to Ibrahim [Abraham].)","vec_preview":[0.020800000056624413,0.015200000256299973,-0.028699999675154686,0.008200000040233135,0.027499999850988388,-0.03139999881386757,-0.01759999990463257,-0.019700000062584877]},{"ayah_id":"4:126","surah":4,"ayah":126,"arabic":"وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ مُّحِيطًا","english":"And to Allah belongs all that is in the heavens and all that is in the earth and Allah has encompassed everything.","vec_preview":[0.010200000368058681,0.005799999926239252,-0.02979999966919422,0.0052999998442828655,9.999999747378752e-05,-0.027899999171495438,-0.0007999999797903001,-0.024900000542402267]},{"ayah_id":"4:127","surah":4,"ayah":127,"arabic":"وَيَسْتَفْتُونَكَ فِي النِّسَاءِ ۖ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَىٰ عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ اللَّاتِي لَا تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَن تَنكِحُوهُنَّ وَالْمُسْتَضْعَفِينَ مِنَ الْوِلْدَانِ وَأَن تَقُومُوا لِلْيَتَامَىٰ بِالْقِسْطِ ۚ وَمَا تَفْعَلُوا مِنْ خَيْرٍ فَإِنَّ اللَّهَ كَانَ بِهِ عَلِيمًا","english":"And, (O Prophet,) people ask about your edict on matters concerning (orphan) women. Say: ‘Allah ordains you in their case, and the commandment (already) being communicated to you in the holy Book (also) pertains to those orphan women whom you deny (the rights) which have been prescribed for them. And (in order to take their assets into possession) you want to marry them. In addition to that, there is (also a decree) on affairs concerning helpless minor children, that stick to justice in matters of orphans. And whatever good you do, Allah is indeed Well Aware of that.","vec_preview":[0.02800000086426735,0.006099999882280827,-0.029200000688433647,-0.008100000210106373,0.047200001776218414,-0.03550000116229057,-0.0052999998442828655,-0.06650000065565109]},{"ayah_id":"4:128","surah":4,"ayah":128,"arabic":"وَإِنِ امْرَأَةٌ خَافَتْ مِن بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا فَلَا جُنَاحَ عَلَيْهِمَا أَن يُصْلِحَا بَيْنَهُمَا صُلْحًا ۚ وَالصُّلْحُ خَيْرٌ ۗ وَأُحْضِرَتِ الْأَنفُسُ الشُّحَّ ۚ وَإِن تُحْسِنُوا وَتَتَّقُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا","english":"If a woman fears maltreatment or indifference on the part of her husband, there is no harm if both (husband and wife) reconcile on some appropriate accord, and reconciliation (in truth) is best. The human nature has (no doubt) been made (more or less) self-seeking, but if you practise benevolence and guard yourselves against evil, Allah is indeed Well Aware of the works that you do.","vec_preview":[0.009700000286102295,0.013799999840557575,-0.04879999905824661,-9.999999747378752e-05,0.03849999979138374,-0.05050000175833702,-0.01209999993443489,-0.04050000011920929]},{"ayah_id":"4:129","surah":4,"ayah":129,"arabic":"وَلَن تَسْتَطِيعُوا أَن تَعْدِلُوا بَيْنَ النِّسَاءِ وَلَوْ حَرَصْتُمْ ۖ فَلَا تَمِيلُوا كُلَّ الْمَيْلِ فَتَذَرُوهَا كَالْمُعَلَّقَةِ ۚ وَإِن تُصْلِحُوا وَتَتَّقُوا فَإِنَّ اللَّهَ كَانَ غَفُورًا رَّحِيمًا","english":"And you simply do not have the ability to do (ideal) justice amongst your (more than one) wives, however ardently you may desire to do it. Do not, therefore, incline with absolute fondness (towards one, thus) leaving the other like something suspended (in the midst). But if you mend your ways and refrain (from injustice and maltreatment), Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.005799999926239252,0.017400000244379044,-0.042899999767541885,0.0017000000225380063,0.032099999487400055,-0.04039999842643738,-0.006399999838322401,-0.03849999979138374]},{"ayah_id":"4:130","surah":4,"ayah":130,"arabic":"وَإِن يَتَفَرَّقَا يُغْنِ اللَّهُ كُلًّا مِّن سَعَتِهِ ۚ وَكَانَ اللَّهُ وَاسِعًا حَكِيمًا","english":"And if both (husband and wife) end up in separation, Allah will make each of them independent (of the other) out of His own abundance and Allah is All-Embracing, Most Wise.","vec_preview":[0.00139999995008111,0.03350000083446503,-0.019099999219179153,0.003100000089034438,0.010200000368058681,-0.0272000003606081,-0.02459999918937683,-0.026799999177455902]},{"ayah_id":"4:131","surah":4,"ayah":131,"arabic":"وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَلَقَدْ وَصَّيْنَا الَّذِينَ أُوتُوا الْكِتَابَ مِن قَبْلِكُمْ وَإِيَّاكُمْ أَنِ اتَّقُوا اللَّهَ ۚ وَإِن تَكْفُرُوا فَإِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَانَ اللَّهُ غَنِيًّا حَمِيدًا","english":"And to Allah belongs whatever is in the heavens and whatever is in the earth. And no doubt We enjoined those (too) who were given the Book before you, and (have ordained) you (as well) to keep fearing Allah. But if you disobey, then assuredly whatever is in the heavens and whatever is in the earth (all) belongs to Allah, and Allah is Beyond all Needs, Ever-Praiseworthy.","vec_preview":[0.00930000003427267,0.01730000041425228,-0.02810000069439411,-0.017100000753998756,0.018200000748038292,-0.027300000190734863,-0.012199999764561653,-0.03779999911785126]},{"ayah_id":"4:132","surah":4,"ayah":132,"arabic":"وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا","english":"And to Allah belongs whatever is in the heavens and whatever is in the earth; and enough is Allah to be the Guardian.","vec_preview":[-0.0006000000284984708,0.011699999682605267,-0.02969999983906746,-0.0006000000284984708,0.013299999758601189,-0.025499999523162842,-0.00039999998989515007,-0.0284000001847744]},{"ayah_id":"4:133","surah":4,"ayah":133,"arabic":"إِن يَشَأْ يُذْهِبْكُمْ أَيُّهَا النَّاسُ وَيَأْتِ بِآخَرِينَ ۚ وَكَانَ اللَّهُ عَلَىٰ ذَٰلِكَ قَدِيرًا","english":"O people! If He wills, He may eliminate you and bring others (in your place) and Allah is All-Powerful to do this.","vec_preview":[0.0038999998942017555,0.0066999997943639755,-0.03060000017285347,-0.006500000134110451,0.03370000049471855,-0.03779999911785126,-0.018200000748038292,-0.0414000004529953]},{"ayah_id":"4:134","surah":4,"ayah":134,"arabic":"مَّن كَانَ يُرِيدُ ثَوَابَ الدُّنْيَا فَعِندَ اللَّهِ ثَوَابُ الدُّنْيَا وَالْآخِرَةِ ۚ وَكَانَ اللَّهُ سَمِيعًا بَصِيرًا","english":"Whoever desires the reward of the world, then with Allah is the reward of (both) the world and the Hereafter and Allah is All-Hearing, All-Seeing.","vec_preview":[0.00039999998989515007,0.0142000000923872,-0.019200000911951065,-0.002300000051036477,0.0142000000923872,-0.03849999979138374,-0.01590000092983246,-0.029600000008940697]},{"ayah_id":"4:135","surah":4,"ayah":135,"arabic":"۞ يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ وَلَوْ عَلَىٰ أَنفُسِكُمْ أَوِ الْوَالِدَيْنِ وَالْأَقْرَبِينَ ۚ إِن يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَاللَّهُ أَوْلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا الْهَوَىٰ أَن تَعْدِلُوا ۚ وَإِن تَلْوُوا أَوْ تُعْرِضُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا","english":"O believers! Become tenaciously firm on justice, bearing witness (merely) for the sake of Allah even if (the witness) is against your own selves or (your) parents or (your) relatives. Whether the person (against whom is the evidence) is rich or poor, Allah is a greater Well-Wisher of them both (than you are). So do not follow the desires of your (ill-commanding) selves lest you swerve from justice. But if (whilst giving evidence) you twist your statement or evade (the truth), then Allah is indeed Well Aware of (all the works) that you are doing.","vec_preview":[0.0142000000923872,0.016499999910593033,-0.034699998795986176,-0.009100000374019146,0.03750000149011612,-0.05700000002980232,-0.0272000003606081,-0.04309999942779541]},{"ayah_id":"4:136","surah":4,"ayah":136,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَىٰ رَسُولِهِ وَالْكِتَابِ الَّذِي أَنزَلَ مِن قَبْلُ ۚ وَمَن يَكْفُرْ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا","english":"O believers! Put faith in Allah and His Messenger (blessings and peace be upon him) and in the Book which He has revealed to His Messenger (blessings and peace be upon him) and the Book that He revealed before (it). And he who denies Allah, His angels, His Books, His Messengers and the Last Day has surely strayed far away.","vec_preview":[0.01600000075995922,0.00430000014603138,-0.027499999850988388,-0.014999999664723873,0.03009999915957451,-0.04320000112056732,-0.019300000742077827,-0.04540000110864639]},{"ayah_id":"4:137","surah":4,"ayah":137,"arabic":"إِنَّ الَّذِينَ آمَنُوا ثُمَّ كَفَرُوا ثُمَّ آمَنُوا ثُمَّ كَفَرُوا ثُمَّ ازْدَادُوا كُفْرًا لَّمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ سَبِيلًا","english":"Indeed, those who believe, then disbelieve and then believe again and reject faith once more and then advance further in denying faith, Allah will never (incline to) forgive them, nor guide them to the straight road.","vec_preview":[0.002099999925121665,0.00989999994635582,-0.032499998807907104,-0.014000000432133675,0.030400000512599945,-0.03229999914765358,-0.019700000062584877,-0.031700000166893005]},{"ayah_id":"4:138","surah":4,"ayah":138,"arabic":"بَشِّرِ الْمُنَافِقِينَ بِأَنَّ لَهُمْ عَذَابًا أَلِيمًا","english":"(O Prophet!) Convey to the hypocrites the news that a grievous torment awaits them.","vec_preview":[0.01080000028014183,0.028999999165534973,-0.0340999998152256,-0.007699999958276749,0.04100000113248825,-0.04230000078678131,-0.022299999371170998,-0.03909999877214432]},{"ayah_id":"4:139","surah":4,"ayah":139,"arabic":"الَّذِينَ يَتَّخِذُونَ الْكَافِرِينَ أَوْلِيَاءَ مِن دُونِ الْمُؤْمِنِينَ ۚ أَيَبْتَغُونَ عِندَهُمُ الْعِزَّةَ فَإِنَّ الْعِزَّةَ لِلَّهِ جَمِيعًا","english":"(They are) those who consider the (hostile) disbelievers instead of the believers as their supporters. Do they seek honour in their company? So, all veneration (and glory) belongs only to Almighty Allah.","vec_preview":[0.008299999870359898,0.016300000250339508,-0.03920000046491623,0.017999999225139618,0.0210999995470047,-0.04989999905228615,-0.014100000262260437,-0.03849999979138374]},{"ayah_id":"4:140","surah":4,"ayah":140,"arabic":"وَقَدْ نَزَّلَ عَلَيْكُمْ فِي الْكِتَابِ أَنْ إِذَا سَمِعْتُمْ آيَاتِ اللَّهِ يُكْفَرُ بِهَا وَيُسْتَهْزَأُ بِهَا فَلَا تَقْعُدُوا مَعَهُمْ حَتَّىٰ يَخُوضُوا فِي حَدِيثٍ غَيْرِهِ ۚ إِنَّكُمْ إِذًا مِّثْلُهُمْ ۗ إِنَّ اللَّهَ جَامِعُ الْمُنَافِقِينَ وَالْكَافِرِينَ فِي جَهَنَّمَ جَمِيعًا","english":"And indeed, Allah has revealed to you this (command) in the Book that when you hear Allah’s Revelations being denied and ridiculed, do not sit in their company until they engage in some other discourse (renouncing the denial and ridicule). Otherwise you too will become like them. Surely, Allah will assemble the hypocrites and the disbelievers together in Hell.","vec_preview":[0.014700000174343586,0.014800000004470348,-0.023499999195337296,0.00019999999494757503,0.03099999949336052,-0.03359999880194664,-0.007899999618530273,-0.0478999987244606]},{"ayah_id":"4:141","surah":4,"ayah":141,"arabic":"الَّذِينَ يَتَرَبَّصُونَ بِكُمْ فَإِن كَانَ لَكُمْ فَتْحٌ مِّنَ اللَّهِ قَالُوا أَلَمْ نَكُن مَّعَكُمْ وَإِن كَانَ لِلْكَافِرِينَ نَصِيبٌ قَالُوا أَلَمْ نَسْتَحْوِذْ عَلَيْكُمْ وَنَمْنَعْكُم مِّنَ الْمُؤْمِنِينَ ۚ فَاللَّهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيَامَةِ ۗ وَلَن يَجْعَلَ اللَّهُ لِلْكَافِرِينَ عَلَى الْمُؤْمِنِينَ سَبِيلًا","english":"Those (hypocrites) who pry into your (victory and setback), then if you are granted victory by Allah, say: ‘Were we not with you?’ And if the disbelievers get a portion (of some apparent breakthrough), they say (to them): ‘Did we not get the better of you, and (in spite of that) did we not save you from (ruin at the hands of) the Muslims?’ So, Allah will judge between you on the Day of Resurrection, and never will Allah allow the disbelievers anyway to (overpower) the Muslims.","vec_preview":[0.0034000000450760126,0.04170000180602074,-0.030500000342726707,0.004999999888241291,0.03840000182390213,-0.02800000086426735,-0.010499999858438969,-0.04520000144839287]},{"ayah_id":"4:142","surah":4,"ayah":142,"arabic":"إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَىٰ يُرَاءُونَ النَّاسَ وَلَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا","english":"Surely, the hypocrites (self-deluding) seek to deceive Allah, whilst He is to make them suffer for their (own) deception. And when they stand up for Prayer, they do it sluggishly, (simply) for showing off to the people. And they (also) remember Allah but little.","vec_preview":[-0.0020000000949949026,0.028599999845027924,-0.036400001496076584,-0.000699999975040555,0.039000000804662704,-0.03889999911189079,-0.009399999864399433,-0.04399999976158142]},{"ayah_id":"4:143","surah":4,"ayah":143,"arabic":"مُّذَبْذَبِينَ بَيْنَ ذَٰلِكَ لَا إِلَىٰ هَـٰؤُلَاءِ وَلَا إِلَىٰ هَـٰؤُلَاءِ ۚ وَمَن يُضْلِلِ اللَّهُ فَلَن تَجِدَ لَهُ سَبِيلًا","english":"Confounded between (belief and disbelief), they belong neither to (the disbelievers) nor to (the believers). And he whom Allah holds astray you shall not find for him any road (to guidance).","vec_preview":[0.00139999995008111,0.007899999618530273,-0.03999999910593033,0.006099999882280827,0.03449999913573265,-0.05339999869465828,-0.02539999969303608,-0.03519999980926514]},{"ayah_id":"4:144","surah":4,"ayah":144,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الْكَافِرِينَ أَوْلِيَاءَ مِن دُونِ الْمُؤْمِنِينَ ۚ أَتُرِيدُونَ أَن تَجْعَلُوا لِلَّهِ عَلَيْكُمْ سُلْطَانًا مُّبِينًا","english":"O believers! Do not consider (hostile) disbelievers as (your) reliable supporters instead of believers. Do you wish to set a manifest evidence for Allah against you (through friendship with the hostile disbelievers)?","vec_preview":[0.005499999970197678,0.007300000172108412,-0.03779999911785126,-0.002099999925121665,0.03759999945759773,-0.050700001418590546,-0.02879999950528145,-0.040300000458955765]},{"ayah_id":"4:145","surah":4,"ayah":145,"arabic":"إِنَّ الْمُنَافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ وَلَن تَجِدَ لَهُمْ نَصِيرًا","english":"The hypocrites will surely be in the lowest depth of Hell, and you will never find for them any helper.","vec_preview":[-0.018400000408291817,0.020600000396370888,-0.047200001776218414,0.007699999958276749,0.027499999850988388,-0.04560000076889992,-0.012900000438094139,-0.03889999911189079]},{"ayah_id":"4:146","surah":4,"ayah":146,"arabic":"إِلَّا الَّذِينَ تَابُوا وَأَصْلَحُوا وَاعْتَصَمُوا بِاللَّهِ وَأَخْلَصُوا دِينَهُمْ لِلَّهِ فَأُولَـٰئِكَ مَعَ الْمُؤْمِنِينَ ۖ وَسَوْفَ يُؤْتِ اللَّهُ الْمُؤْمِنِينَ أَجْرًا عَظِيمًا","english":"But those who repent, make amends, and establish a firm bond with Allah, and make their Din (faith and devotion) sincerely for Allah—they will be in the company of the believers. And Allah will soon bestow a tremendous reward upon the believers.","vec_preview":[-0.010999999940395355,0.01720000058412552,-0.03280000016093254,-0.007600000128149986,0.03579999879002571,-0.043699998408555984,-0.022099999710917473,-0.0421999990940094]},{"ayah_id":"4:147","surah":4,"ayah":147,"arabic":"مَّا يَفْعَلُ اللَّهُ بِعَذَابِكُمْ إِن شَكَرْتُمْ وَآمَنتُمْ ۚ وَكَانَ اللَّهُ شَاكِرًا عَلِيمًا","english":"Why should Allah torment you if you become grateful and believe? And Allah is Most Appreciative (of every truth), Well Aware (of every act).","vec_preview":[0.016699999570846558,0.019999999552965164,-0.017899999395012856,0.0,0.0333000011742115,-0.05040000006556511,-0.01769999973475933,-0.045499999076128006]},{"ayah_id":"4:148","surah":4,"ayah":148,"arabic":"۞ لَّا يُحِبُّ اللَّهُ الْجَهْرَ بِالسُّوءِ مِنَ الْقَوْلِ إِلَّا مَن ظُلِمَ ۚ وَكَانَ اللَّهُ سَمِيعًا عَلِيمًا","english":"Allah does not like anyone’s foul words being voiced loud (publicly and openly) except by one who has been a victim of oppression (he is allowed to expose the cruelty of the oppressor), and Allah is All-Hearing, All-Knowing.","vec_preview":[-0.019999999552965164,0.011599999852478504,-0.027699999511241913,0.01269999984651804,0.01679999940097332,-0.051100000739097595,-0.02810000069439411,-0.026100000366568565]},{"ayah_id":"4:149","surah":4,"ayah":149,"arabic":"إِن تُبْدُوا خَيْرًا أَوْ تُخْفُوهُ أَوْ تَعْفُوا عَن سُوءٍ فَإِنَّ اللَّهَ كَانَ عَفُوًّا قَدِيرًا","english":"Whether you make a good act known or keep it hidden or excuse some(one’s) evil act, Allah is indeed Most Forgiving, All-Powerful.","vec_preview":[-0.0019000000320374966,-0.0007999999797903001,-0.022199999541044235,0.004699999932199717,0.01119999960064888,-0.047200001776218414,-0.010400000028312206,-0.03830000013113022]},{"ayah_id":"4:150","surah":4,"ayah":150,"arabic":"إِنَّ الَّذِينَ يَكْفُرُونَ بِاللَّهِ وَرُسُلِهِ وَيُرِيدُونَ أَن يُفَرِّقُوا بَيْنَ اللَّهِ وَرُسُلِهِ وَيَقُولُونَ نُؤْمِنُ بِبَعْضٍ وَنَكْفُرُ بِبَعْضٍ وَيُرِيدُونَ أَن يَتَّخِذُوا بَيْنَ ذَٰلِكَ سَبِيلًا","english":"Surely, those who disbelieve in Allah and His Messengers and seek to discriminate between Allah and His Messengers and say: ‘We believe in some and deny the others,’ and intend to find a way in between (belief and disbelief),","vec_preview":[-0.0003000000142492354,0.010900000110268593,-0.032999999821186066,-0.00019999999494757503,0.03269999846816063,-0.04529999941587448,-0.026599999517202377,-0.05130000039935112]},{"ayah_id":"4:151","surah":4,"ayah":151,"arabic":"أُولَـٰئِكَ هُمُ الْكَافِرُونَ حَقًّا ۚ وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُّهِينًا","english":"They are the ones who are in fact the disbelievers. And We have prepared a humiliating torment for the disbelievers.","vec_preview":[0.002300000051036477,0.011699999682605267,-0.020600000396370888,0.006800000090152025,0.014100000262260437,-0.045499999076128006,-0.013399999588727951,-0.03350000083446503]},{"ayah_id":"4:152","surah":4,"ayah":152,"arabic":"وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ وَلَمْ يُفَرِّقُوا بَيْنَ أَحَدٍ مِّنْهُمْ أُولَـٰئِكَ سَوْفَ يُؤْتِيهِمْ أُجُورَهُمْ ۗ وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا","english":"But those who believed in Allah and (all) His Messengers and, (in embracing faith,) made no distinction between any of these (Messengers), He will soon pay them their rewards. And Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.004100000020116568,0.022299999371170998,-0.03500000014901161,-0.005100000184029341,0.01769999973475933,-0.05090000107884407,-0.01590000092983246,-0.03280000016093254]},{"ayah_id":"4:153","surah":4,"ayah":153,"arabic":"يَسْأَلُكَ أَهْلُ الْكِتَابِ أَن تُنَزِّلَ عَلَيْهِمْ كِتَابًا مِّنَ السَّمَاءِ ۚ فَقَدْ سَأَلُوا مُوسَىٰ أَكْبَرَ مِن ذَٰلِكَ فَقَالُوا أَرِنَا اللَّهَ جَهْرَةً فَأَخَذَتْهُمُ الصَّاعِقَةُ بِظُلْمِهِمْ ۚ ثُمَّ اتَّخَذُوا الْعِجْلَ مِن بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ فَعَفَوْنَا عَن ذَٰلِكَ ۚ وَآتَيْنَا مُوسَىٰ سُلْطَانًا مُّبِينًا","english":"(O Beloved!) The People of the Book ask you to bring down to them a Book from heaven (completely inscribed in one go). They asked Musa (Moses) for something even greater than that; they said: ‘Show us Allah visibly (in Person).’ So owing to (their) transgression (i.e., this denigrating demand), a thunderbolt seized them. (They died and were later raised to life by Musa’s [Moses’s] prayer.) Then they adopted the calf (as their god) after the clear signs (pointing to the truth) had reached them. Then We overlooked this (sin) as well, and bestowed upon Musa (Moses) a marked dominance over them.","vec_preview":[0.01489999983459711,0.0008999999845400453,-0.01640000008046627,-0.010200000368058681,0.026799999177455902,-0.022099999710917473,-0.010499999858438969,-0.040300000458955765]},{"ayah_id":"4:154","surah":4,"ayah":154,"arabic":"وَرَفَعْنَا فَوْقَهُمُ الطُّورَ بِمِيثَاقِهِمْ وَقُلْنَا لَهُمُ ادْخُلُوا الْبَابَ سُجَّدًا وَقُلْنَا لَهُمْ لَا تَعْدُوا فِي السَّبْتِ وَأَخَذْنَا مِنْهُم مِّيثَاقًا غَلِيظًا","english":"And (when the Jews again rejected the injunctions contained in the Torah,) We raised (and suspended Mount) Tur over them in order to take a (firm) promise from them. And We commanded them: ‘Enter the gate (of this city—the Ailia gate) prostrate (in gratitude),’ and We (also) said to them: ‘Do not also violate the Sabbath (prohibition of fishing on Saturday), and We took from them a reiterated and firm promise.’","vec_preview":[-0.01769999973475933,0.007799999788403511,-0.04170000180602074,-0.005100000184029341,0.02160000056028366,-0.014700000174343586,-0.013399999588727951,-0.04969999939203262]},{"ayah_id":"4:155","surah":4,"ayah":155,"arabic":"فَبِمَا نَقْضِهِم مِّيثَاقَهُمْ وَكُفْرِهِم بِآيَاتِ اللَّهِ وَقَتْلِهِمُ الْأَنبِيَاءَ بِغَيْرِ حَقٍّ وَقَوْلِهِمْ قُلُوبُنَا غُلْفٌ ۚ بَلْ طَبَعَ اللَّهُ عَلَيْهَا بِكُفْرِهِمْ فَلَا يُؤْمِنُونَ إِلَّا قَلِيلًا","english":"So (they were afflicted with punishments) because of their breaking the promise, rejecting the Revelations of Allah, killing the Prophets unjustly (and also owing to) their saying: ‘Our hearts are (wrapped) in covers.’ (Nay, that was not the truth;) the fact is that Allah has sealed their hearts due to their disbelief, so, except for a few, they will not accept faith;","vec_preview":[-0.008700000122189522,0.01080000028014183,-0.026000000536441803,0.004900000058114529,0.023399999365210533,-0.03720000013709068,-0.03150000050663948,-0.032499998807907104]},{"ayah_id":"4:156","surah":4,"ayah":156,"arabic":"وَبِكُفْرِهِمْ وَقَوْلِهِمْ عَلَىٰ مَرْيَمَ بُهْتَانًا عَظِيمًا","english":"And (moreover) due to their rejection of faith and uttering against Maryam (Mary) a grave calumny;","vec_preview":[0.005100000184029341,0.019700000062584877,-0.014800000004470348,0.008899999782443047,0.016200000420212746,-0.021199999377131462,-0.004600000102072954,-0.04399999976158142]},{"ayah_id":"4:157","surah":4,"ayah":157,"arabic":"وَقَوْلِهِمْ إِنَّا قَتَلْنَا الْمَسِيحَ عِيسَى ابْنَ مَرْيَمَ رَسُولَ اللَّهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَـٰكِن شُبِّهَ لَهُمْ ۚ وَإِنَّ الَّذِينَ اخْتَلَفُوا فِيهِ لَفِي شَكٍّ مِّنْهُ ۚ مَا لَهُم بِهِ مِنْ عِلْمٍ إِلَّا اتِّبَاعَ الظَّنِّ ۚ وَمَا قَتَلُوهُ يَقِينًا","english":"And (also) because of their uttering (the boastful claim): ‘We (have) killed Allah’s Messenger, the Messiah, ‘Isa, the son of Maryam (Jesus, the son of Mary),’ whereas they neither killed nor crucified him. But (in truth) someone was made the like (of ‘Isa—Jesus) in their view. But those who disagree about him have surely fallen prey to doubt (concerning) this (murder). They know nothing (what the truth is) except (that they are) following fancy. And they certainly did not murder ‘Isa (Jesus).","vec_preview":[0.01759999990463257,0.011599999852478504,-0.017000000923871994,0.011699999682605267,0.02319999970495701,-0.0340999998152256,-0.037700001150369644,-0.038600001484155655]},{"ayah_id":"4:158","surah":4,"ayah":158,"arabic":"بَل رَّفَعَهُ اللَّهُ إِلَيْهِ ۚ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا","english":"In fact, Allah lifted him up towards Himself (in heaven) and Allah is Almighty, Most Wise.","vec_preview":[-0.002899999963119626,0.007400000002235174,-0.018300000578165054,-0.0031999999191612005,0.023600000888109207,-0.03420000150799751,-0.03060000017285347,-0.031099999323487282]},{"ayah_id":"4:159","surah":4,"ayah":159,"arabic":"وَإِن مِّنْ أَهْلِ الْكِتَابِ إِلَّا لَيُؤْمِنَنَّ بِهِ قَبْلَ مَوْتِهِ ۖ وَيَوْمَ الْقِيَامَةِ يَكُونُ عَلَيْهِمْ شَهِيدًا","english":"And, (shortly before the Last Hour at the time of the Messiah’s descent,) there will not be any (individual or sect) of the People of the Book, but will (rightly) believe in ‘Isa (Jesus) before his death; and ‘Isa (Jesus) will bear witness to them on the Day of Resurrection.","vec_preview":[0.019600000232458115,0.011900000274181366,-0.01940000057220459,0.014700000174343586,0.02250000089406967,-0.027300000190734863,-0.02329999953508377,-0.055799998342990875]},{"ayah_id":"4:160","surah":4,"ayah":160,"arabic":"فَبِظُلْمٍ مِّنَ الَّذِينَ هَادُوا حَرَّمْنَا عَلَيْهِمْ طَيِّبَاتٍ أُحِلَّتْ لَهُمْ وَبِصَدِّهِمْ عَن سَبِيلِ اللَّهِ كَثِيرًا","english":"Then on account of injustice on the part of the Jews, We made unlawful for them (many) pure provisions that had been made lawful for them (before), and (also) for the reason that they hindered (people) at a large scale from the path of Allah.","vec_preview":[-0.0017000000225380063,0.004600000102072954,-0.024299999698996544,-0.014800000004470348,0.025100000202655792,-0.041099999099969864,-0.018400000408291817,-0.02669999934732914]},{"ayah_id":"4:161","surah":4,"ayah":161,"arabic":"وَأَخْذِهِمُ الرِّبَا وَقَدْ نُهُوا عَنْهُ وَأَكْلِهِمْ أَمْوَالَ النَّاسِ بِالْبَاطِلِ ۚ وَأَعْتَدْنَا لِلْكَافِرِينَ مِنْهُمْ عَذَابًا أَلِيمًا","english":"And (also) because of their taking usury, despite that they were forbidden to do it, and because of their usurping others’ wealth wrongfully (they were punished). And We have prepared a torturous torment for those of them who disbelieve.","vec_preview":[0.01590000092983246,0.030899999663233757,-0.037300001829862595,0.00839999970048666,0.01209999993443489,-0.03909999877214432,-0.014999999664723873,-0.0430000014603138]},{"ayah_id":"4:162","surah":4,"ayah":162,"arabic":"لَّـٰكِنِ الرَّاسِخُونَ فِي الْعِلْمِ مِنْهُمْ وَالْمُؤْمِنُونَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ ۚ وَالْمُقِيمِينَ الصَّلَاةَ ۚ وَالْمُؤْتُونَ الزَّكَاةَ وَالْمُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أُولَـٰئِكَ سَنُؤْتِيهِمْ أَجْرًا عَظِيمًا","english":"But those amongst them who possess substantial knowledge and faith (equally) believe in (the Revelation) that has been sent down to you and (the Revelation) that was sent down before you. And (how righteous they are!) they establish the Prayer regularly, and pay Zakat (the Alms-due) persistently, and keep faith in Allah and the Day of Resurrection. They are the ones whom We shall soon pay a mighty wage.","vec_preview":[-0.013899999670684338,0.02979999966919422,-0.02889999933540821,-0.0007999999797903001,0.039400000125169754,-0.04259999841451645,-0.022099999710917473,-0.045499999076128006]},{"ayah_id":"4:163","surah":4,"ayah":163,"arabic":"۞ إِنَّا أَوْحَيْنَا إِلَيْكَ كَمَا أَوْحَيْنَا إِلَىٰ نُوحٍ وَالنَّبِيِّينَ مِن بَعْدِهِ ۚ وَأَوْحَيْنَا إِلَىٰ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ وَعِيسَىٰ وَأَيُّوبَ وَيُونُسَ وَهَارُونَ وَسُلَيْمَانَ ۚ وَآتَيْنَا دَاوُودَ زَبُورًا","english":"(O Beloved!) Indeed, We have sent Revelation to you as We sent it to Nuh (Noah) and (other) Messengers after him; and We also sent Revelation to Ibrahim (Abraham), Isma‘il (Ishmael), Ishaq (Isaac), Ya‘qub (Jacob) and (his) children, and ‘Isa (Jesus), Ayyub (Job), Yunus (Jonah), Harun (Aaron) and Sulayman (Solomon); and We conferred the Zabur (the Book of Psalms) upon Dawud (David).","vec_preview":[-0.002300000051036477,0.007300000172108412,-0.021400000900030136,0.006200000178068876,0.029999999329447746,-0.038100000470876694,-0.03220000118017197,-0.039500001817941666]},{"ayah_id":"4:164","surah":4,"ayah":164,"arabic":"وَرُسُلًا قَدْ قَصَصْنَاهُمْ عَلَيْكَ مِن قَبْلُ وَرُسُلًا لَّمْ نَقْصُصْهُمْ عَلَيْكَ ۚ وَكَلَّمَ اللَّهُ مُوسَىٰ تَكْلِيمًا","english":"And (We have sent many) Messengers whose annals We have narrated to you earlier; and We sent (a number of) those Messengers whose details We have not (yet) related to you; and Allah (also) spoke to Musa (Moses) directly.","vec_preview":[-0.005499999970197678,0.0020000000949949026,-0.02070000022649765,-0.00279999990016222,0.016599999740719795,-0.04190000146627426,-0.028699999675154686,-0.04179999977350235]},{"ayah_id":"4:165","surah":4,"ayah":165,"arabic":"رُّسُلًا مُّبَشِّرِينَ وَمُنذِرِينَ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَى اللَّهِ حُجَّةٌ بَعْدَ الرُّسُلِ ۚ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا","english":"The Messengers who were Bearers of good news and Warners (were sent) so that after (the arrival of these) Messengers people may not have any plea against Allah. And Allah is Almighty, Most Wise.","vec_preview":[0.02160000056028366,0.01940000057220459,-0.02630000002682209,0.002199999988079071,0.021800000220537186,-0.04910000041127205,-0.02630000002682209,-0.03629999980330467]},{"ayah_id":"4:166","surah":4,"ayah":166,"arabic":"لَّـٰكِنِ اللَّهُ يَشْهَدُ بِمَا أَنزَلَ إِلَيْكَ ۖ أَنزَلَهُ بِعِلْمِهِ ۖ وَالْمَلَائِكَةُ يَشْهَدُونَ ۚ وَكَفَىٰ بِاللَّهِ شَهِيدًا","english":"(O Beloved! Whether somebody believes in your Prophethood or not,) Allah (Himself) bears witness to (this fact that) whatever He has sent down to you has sent down with His knowledge. And the angels (too) bear witness to that effect (for your sake), and Allah is All-Sufficient as a witness.","vec_preview":[-0.00570000009611249,0.012000000104308128,-0.010400000028312206,-0.0005000000237487257,0.04399999976158142,-0.026399999856948853,-0.003800000064074993,-0.04960000142455101]},{"ayah_id":"4:167","surah":4,"ayah":167,"arabic":"إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَن سَبِيلِ اللَّهِ قَدْ ضَلُّوا ضَلَالًا بَعِيدًا","english":"Verily, those who disbelieved (i.e., belied the Prophethood of Muhammad [blessings and peace be upon him]) and hindered (people) from the path of Allah, they undoubtedly went far astray (from the truth).","vec_preview":[-0.00839999970048666,0.00279999990016222,-0.03229999914765358,-0.01590000092983246,0.009999999776482582,-0.04390000179409981,-0.012600000016391277,-0.02290000021457672]},{"ayah_id":"4:168","surah":4,"ayah":168,"arabic":"إِنَّ الَّذِينَ كَفَرُوا وَظَلَمُوا لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ طَرِيقًا","english":"Indeed, those who have disbelieved (by denying Allah’s witness) and done injustice (by denying the Messenger’s glory), Allah will by no means forgive them, nor will show them any path (on the Day of Judgment),","vec_preview":[-0.0017999999690800905,0.00039999998989515007,-0.0357000008225441,-0.002899999963119626,0.014000000432133675,-0.045099999755620956,-0.01889999955892563,-0.026900000870227814]},{"ayah_id":"4:169","surah":4,"ayah":169,"arabic":"إِلَّا طَرِيقَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا","english":"Except the path of Hell wherein they shall dwell beyond the count of time and that is easy for Allah.","vec_preview":[0.0019000000320374966,-0.008299999870359898,-0.040800001472234726,0.005499999970197678,0.006399999838322401,-0.05660000070929527,-0.013399999588727951,-0.03579999879002571]},{"ayah_id":"4:170","surah":4,"ayah":170,"arabic":"يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُمُ الرَّسُولُ بِالْحَقِّ مِن رَّبِّكُمْ فَآمِنُوا خَيْرًا لَّكُمْ ۚ وَإِن تَكْفُرُوا فَإِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا","english":"O mankind! Indeed, this Messenger (blessings and peace be upon him) has come to you with the truth from your Lord. So believe (in him) for your own good. But if you disbelieve (i.e., deny his Prophethood, then bear in mind that He is Beyond Any Need of you because) whatever is in the heavens and the earth belongs to Allah indeed. And Allah is All-Knowing, Most Wise.","vec_preview":[0.024900000542402267,0.02500000037252903,-0.045099999755620956,-0.00419999985024333,0.007400000002235174,-0.04520000144839287,-0.005900000222027302,-0.04500000178813934]},{"ayah_id":"4:171","surah":4,"ayah":171,"arabic":"يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ ۚ إِنَّمَا الْمَسِيحُ عِيسَى ابْنُ مَرْيَمَ رَسُولُ اللَّهِ وَكَلِمَتُهُ أَلْقَاهَا إِلَىٰ مَرْيَمَ وَرُوحٌ مِّنْهُ ۖ فَآمِنُوا بِاللَّهِ وَرُسُلِهِ ۖ وَلَا تَقُولُوا ثَلَاثَةٌ ۚ انتَهُوا خَيْرًا لَّكُمْ ۚ إِنَّمَا اللَّهُ إِلَـٰهٌ وَاحِدٌ ۖ سُبْحَانَهُ أَن يَكُونَ لَهُ وَلَدٌ ۘ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَكَفَىٰ بِاللَّهِ وَكِيلًا","english":"O People of the Book! Exceed not the limits in your din (religion), and speak nothing but the truth about Allah’s glory. The fact is simple that the Messiah, ‘Isa, the son of Maryam (Jesus, the son of Mary) is Allah’s Messenger and His Word which He conveyed to Maryam (Mary) and a Spirit from Him. So believe in Allah and His Messengers and do not say: ‘There are three (Gods).’ Refrain (from this belief); (that) is best for you. Verily, Allah is the Only One God, Holy is He, far above having a son. Whatever is in the heavens and whatever is in the earth (all) belongs to Him alone. And Sufficient is Allah as a Guardian.","vec_preview":[0.019899999722838402,0.00930000003427267,-0.016599999740719795,0.0008999999845400453,0.019899999722838402,-0.020600000396370888,-0.01269999984651804,-0.04390000179409981]},{"ayah_id":"4:172","surah":4,"ayah":172,"arabic":"لَّن يَسْتَنكِفَ الْمَسِيحُ أَن يَكُونَ عَبْدًا لِّلَّهِ وَلَا الْمَلَائِكَةُ الْمُقَرَّبُونَ ۚ وَمَن يَسْتَنكِفْ عَنْ عِبَادَتِهِ وَيَسْتَكْبِرْ فَسَيَحْشُرُهُمْ إِلَيْهِ جَمِيعًا","english":"The Messiah feels no embarrassment in being a servant of Allah. Nor do the closest angels (ever feel ashamed). And whoever disdains to be His servant and perpetrates arrogance, He will soon assemble together all such people before Him.","vec_preview":[0.002899999963119626,0.009600000455975533,-0.031199999153614044,0.01759999990463257,0.014800000004470348,-0.04349999874830246,-0.013399999588727951,-0.03620000183582306]},{"ayah_id":"4:173","surah":4,"ayah":173,"arabic":"فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُوَفِّيهِمْ أُجُورَهُمْ وَيَزِيدُهُم مِّن فَضْلِهِ ۖ وَأَمَّا الَّذِينَ اسْتَنكَفُوا وَاسْتَكْبَرُوا فَيُعَذِّبُهُمْ عَذَابًا أَلِيمًا وَلَا يَجِدُونَ لَهُم مِّن دُونِ اللَّهِ وَلِيًّا وَلَا نَصِيرًا","english":"So those who believe and persist in doing pious deeds, He will pay them their wages in full and will (then) award them more out of His bounty. But those who disdain (worshipping Allah) and behave arrogantly, He will punish them with grievous torment, and they will not find for them any friend or helper besides Allah.","vec_preview":[0.011099999770522118,0.03689999878406525,-0.03150000050663948,-0.00800000037997961,0.03269999846816063,-0.05050000175833702,-0.01810000091791153,-0.0272000003606081]},{"ayah_id":"4:174","surah":4,"ayah":174,"arabic":"يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُم بُرْهَانٌ مِّن رَّبِّكُمْ وَأَنزَلْنَا إِلَيْكُمْ نُورًا مُّبِينًا","english":"O mankind! (The most vital, perfect, clear and) conclusive evidence has reached you from your (Ever-Glorious and Most Exalted) Lord (in the form of the Holy Being of the Prophet Muhammad [Blessings and peace be upon him]). And (besides) We have (also) sent down to you the brightening and radiant light (in the shape of the Holy Qur’an).","vec_preview":[0.010900000110268593,0.004600000102072954,-0.044599998742341995,-0.01119999960064888,0.030300000682473183,-0.04580000042915344,-0.013299999758601189,-0.043699998408555984]},{"ayah_id":"4:175","surah":4,"ayah":175,"arabic":"فَأَمَّا الَّذِينَ آمَنُوا بِاللَّهِ وَاعْتَصَمُوا بِهِ فَسَيُدْخِلُهُمْ فِي رَحْمَةٍ مِّنْهُ وَفَضْلٍ وَيَهْدِيهِمْ إِلَيْهِ صِرَاطًا مُّسْتَقِيمًا","english":"So, those who believe in Allah and hold fast to His (embrace, Allah) will soon admit them to His (exceptional) mercy and grace and will show them the straight path to (reach) Him.","vec_preview":[0.009399999864399433,0.02889999933540821,-0.03660000115633011,0.0017000000225380063,0.022299999371170998,-0.0340999998152256,-0.01140000019222498,-0.03099999949336052]},{"ayah_id":"4:176","surah":4,"ayah":176,"arabic":"يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلَالَةِ ۚ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَلَهُ أُخْتٌ فَلَهَا نِصْفُ مَا تَرَكَ ۚ وَهُوَ يَرِثُهَا إِن لَّمْ يَكُن لَّهَا وَلَدٌ ۚ فَإِن كَانَتَا اثْنَتَيْنِ فَلَهُمَا الثُّلُثَانِ مِمَّا تَرَكَ ۚ وَإِن كَانُوا إِخْوَةً رِّجَالًا وَنِسَاءً فَلِلذَّكَرِ مِثْلُ حَظِّ الْأُنثَيَيْنِ ۗ يُبَيِّنُ اللَّهُ لَكُمْ أَن تَضِلُّوا ۗ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ","english":"They seek edict (i.e., judgment under Islamic law) from you. Say: ‘Allah ordains pertaining to (the inheritance of) kalala (the deceased leaving neither children nor parents behind): If a man dies childless but has one sister, she shall have (as her share) half (the property) that he leaves. (If, on the contrary, a sister is kalala, then in the case of her death) the brother will be (the sole) heir (to his sister), if she has no children. Then, if (after a kalala brother’s death) two (sisters) are (the heirs), they are entitled to share two-thirds of (the property) he leaves. And if (in the case of the deceased who is kalala) he has some brothers and sisters, male (as well as) female heirs, then the share of each male shall be as much as the (portion of) two females.’ Allah is clearly explaining (these laws) to you lest you should go astray. And Allah knows everything well.","vec_preview":[0.004600000102072954,0.01209999993443489,-0.026100000366568565,-0.013799999840557575,0.05169999971985817,-0.025100000202655792,-0.017100000753998756,-0.048900000751018524]}]