[{"ayah_id":"63:1","surah":63,"ayah":1,"arabic":"إِذَا جَاءَكَ الْمُنَافِقُونَ قَالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ ۗ وَاللَّهُ يَعْلَمُ إِنَّكَ لَرَسُولُهُ وَاللَّهُ يَشْهَدُ إِنَّ الْمُنَافِقِينَ لَكَاذِبُونَ","english":"(O Esteemed Beloved!) When the hypocrites come to you, they say: ‘We bear witness that you are certainly the Messenger of Allah.’ And Allah knows that surely you are His Messenger (blessings and peace be upon him). But Allah bears witness that undoubtedly the hypocrites are liars.","vec_preview":[0.004000000189989805,0.010900000110268593,-0.027699999511241913,0.002300000051036477,0.03669999912381172,-0.042399998754262924,-0.002099999925121665,-0.0471000000834465]},{"ayah_id":"63:2","surah":63,"ayah":2,"arabic":"اتَّخَذُوا أَيْمَانَهُمْ جُنَّةً فَصَدُّوا عَن سَبِيلِ اللَّهِ ۚ إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَ","english":"They have made their oaths a shield. Then they hinder (the people) from the path of Allah. Surely, that is an extremely evil (work) which they are doing.","vec_preview":[-0.01810000091791153,0.005900000222027302,-0.043699998408555984,-0.006899999920278788,0.03150000050663948,-0.03550000116229057,-0.01119999960064888,-0.04439999908208847]},{"ayah_id":"63:3","surah":63,"ayah":3,"arabic":"ذَٰلِكَ بِأَنَّهُمْ آمَنُوا ثُمَّ كَفَرُوا فَطُبِعَ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَفْقَهُونَ","english":"That is because they believed (with their tongues) but remained disbelievers (at heart). So their hearts have been sealed. And they do not understand (anything).","vec_preview":[0.0003000000142492354,0.007600000128149986,-0.04430000111460686,-0.009100000374019146,0.014100000262260437,-0.021400000900030136,-0.038100000470876694,-0.036400001496076584]},{"ayah_id":"63:4","surah":63,"ayah":4,"arabic":"۞ وَإِذَا رَأَيْتَهُمْ تُعْجِبُكَ أَجْسَامُهُمْ ۖ وَإِن يَقُولُوا تَسْمَعْ لِقَوْلِهِمْ ۖ كَأَنَّهُمْ خُشُبٌ مُّسَنَّدَةٌ ۖ يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ ۚ هُمُ الْعَدُوُّ فَاحْذَرْهُمْ ۚ قَاتَلَهُمُ اللَّهُ ۖ أَنَّىٰ يُؤْفَكُونَ","english":"(O servant!) When you see them, their bodies (and height and structure) seem attractive to you, and if they speak, you lend ear to what they say (i.e., they will look sensible to you, but the fact is that) they are nothing but wooden planks propped up against a supporting wall. They take every loud voice (as some suffering and misery) befallen them. It is these (hypocrites) who are (your) enemies. So be on guard against them. May Allah ruin them; where are they wandering distracted!","vec_preview":[-0.011500000022351742,0.042399998754262924,-0.047200001776218414,0.0035000001080334187,0.04230000078678131,-0.025100000202655792,-0.011699999682605267,-0.0364999994635582]},{"ayah_id":"63:5","surah":63,"ayah":5,"arabic":"وَإِذَا قِيلَ لَهُمْ تَعَالَوْا يَسْتَغْفِرْ لَكُمْ رَسُولُ اللَّهِ لَوَّوْا رُءُوسَهُمْ وَرَأَيْتَهُمْ يَصُدُّونَ وَهُم مُّسْتَكْبِرُونَ","english":"And when it is said to them: ‘Come so that Allah’s Messenger (blessings and peace be upon him) may seek forgiveness for you,’ these (hypocrites) jerk their heads aside (insolently) and you see them keeping away (from your presence) in arrogance.*","vec_preview":[0.014700000174343586,0.01510000042617321,-0.027499999850988388,0.0035000001080334187,0.020099999383091927,-0.042399998754262924,-0.0008999999845400453,-0.03830000013113022]},{"ayah_id":"63:6","surah":63,"ayah":6,"arabic":"سَوَاءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ لَن يَغْفِرَ اللَّهُ لَهُمْ ۚ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ","english":"It is all the same for these (evil-fated denigrators of the Holy Prophet [blessings and peace be upon him]) whether you seek for them forgiveness or do not seek for them forgiveness, Allah will never forgive them (because they mock you and show you dislike and arrogance). Surely, Allah does not provide guidance to the disobedient community.","vec_preview":[-0.0031999999191612005,0.014600000344216824,-0.031099999323487282,-0.016100000590085983,0.02459999918937683,-0.04479999840259552,-0.01889999955892563,-0.03840000182390213]},{"ayah_id":"63:7","surah":63,"ayah":7,"arabic":"هُمُ الَّذِينَ يَقُولُونَ لَا تُنفِقُوا عَلَىٰ مَنْ عِندَ رَسُولِ اللَّهِ حَتَّىٰ يَنفَضُّوا ۗ وَلِلَّهِ خَزَائِنُ السَّمَاوَاتِ وَالْأَرْضِ وَلَـٰكِنَّ الْمُنَافِقِينَ لَا يَفْقَهُونَ","english":"(O Esteemed Beloved!) They are the people who say this as well (out of malice and enmity against you): ‘Do not spend on those (destitute devotees of Allah) who remain in the presence of the Messenger of Allah (i.e., do not provide them financial help) until they (all may desert him and) flee away (and disperse). In truth, to Allah belong all the treasures of the heavens and the earth, but the hypocrites do not understand.","vec_preview":[0.008700000122189522,0.020400000736117363,-0.05260000005364418,-0.020600000396370888,0.022199999541044235,-0.04089999943971634,-0.01140000019222498,-0.05009999871253967]},{"ayah_id":"63:8","surah":63,"ayah":8,"arabic":"يَقُولُونَ لَئِن رَّجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ ۚ وَلِلَّهِ الْعِزَّةُ وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ وَلَـٰكِنَّ الْمُنَافِقِينَ لَا يَعْلَمُونَ","english":"They say: ‘If (now) we return to Medina, then (we) the honourable will drive out the dishonourable (i.e., the Muslims).’ But in fact, honour belongs to Allah alone and His Messenger and the believers. However, the hypocrites do not understand (this reality).","vec_preview":[0.009700000286102295,-0.002400000113993883,-0.026499999687075615,-0.016599999740719795,0.028999999165534973,-0.0421999990940094,-0.018300000578165054,-0.05389999970793724]},{"ayah_id":"63:9","surah":63,"ayah":9,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُلْهِكُمْ أَمْوَالُكُمْ وَلَا أَوْلَادُكُمْ عَن ذِكْرِ اللَّهِ ۚ وَمَن يَفْعَلْ ذَٰلِكَ فَأُولَـٰئِكَ هُمُ الْخَاسِرُونَ","english":"O believers! Let not your wealth and your children make you neglectful of the very remembrance of Allah. And whoever does so, it is they who are the losers.","vec_preview":[0.01269999984651804,0.014499999582767487,-0.024000000208616257,-0.005900000222027302,0.04859999939799309,-0.05350000038743019,-0.009499999694526196,-0.04690000042319298]},{"ayah_id":"63:10","surah":63,"ayah":10,"arabic":"وَأَنفِقُوا مِن مَّا رَزَقْنَاكُم مِّن قَبْلِ أَن يَأْتِيَ أَحَدَكُمُ الْمَوْتُ فَيَقُولَ رَبِّ لَوْلَا أَخَّرْتَنِي إِلَىٰ أَجَلٍ قَرِيبٍ فَأَصَّدَّقَ وَأَكُن مِّنَ الصَّالِحِينَ","english":"And spend (in the way of Allah) out of (the wealth) which We have given you before death approaches one of you, and he says: ‘O my Lord, why did You not give me respite for a short while so that I could donate in charity and become one of the most pious?’","vec_preview":[0.01889999955892563,0.03180000185966492,-0.03830000013113022,-0.0008999999845400453,0.031599998474121094,-0.038600001484155655,-0.017100000753998756,-0.05719999969005585]},{"ayah_id":"63:11","surah":63,"ayah":11,"arabic":"وَلَن يُؤَخِّرَ اللَّهُ نَفْسًا إِذَا جَاءَ أَجَلُهَا ۚ وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ","english":"And Allah never grants respite to anyone when his hour of death approaches. And Allah is Well Aware of the actions that you do.","vec_preview":[-0.019899999722838402,9.999999747378752e-05,-0.027300000190734863,0.01209999993443489,0.03440000116825104,-0.04749999940395355,-0.019899999722838402,-0.033900000154972076]}]