[{"ayah_id":"62:1","surah":62,"ayah":1,"arabic":"يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ الْمَلِكِ الْقُدُّوسِ الْعَزِيزِ الْحَكِيمِ","english":"(Everything) in the heavens and in the earth glorifies Allah, (the Real) King, the Most Pure (of all shortcomings and imperfections), the Lord of Honour, the Almighty, the Most Wise.","vec_preview":[0.007300000172108412,0.017999999225139618,-0.03220000118017197,0.005799999926239252,0.010499999858438969,-0.025800000876188278,0.006200000178068876,-0.020899999886751175]},{"ayah_id":"62:2","surah":62,"ayah":2,"arabic":"هُوَ الَّذِي بَعَثَ فِي الْأُمِّيِّينَ رَسُولًا مِّنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَإِن كَانُوا مِن قَبْلُ لَفِي ضَلَالٍ مُّبِينٍ","english":"He is the One Who sent a (Glorious) Messenger (blessings and peace be upon him) amongst the illiterate people from amongst themselves who recites to them His Revelations and cleanses and purifies them (outwardly and inwardly) and teaches them the Book and wisdom. Indeed, they were in open error before (his most welcome arrival).","vec_preview":[0.026599999517202377,0.014399999752640724,-0.030899999663233757,0.010700000450015068,0.019500000402331352,-0.020800000056624413,-0.025100000202655792,-0.03970000147819519]},{"ayah_id":"62:3","surah":62,"ayah":3,"arabic":"وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","english":"And (He has sent this Messenger for purification and education amongst) others of them also who have not yet joined these people (that are present now i.e., they will come after them in later eras). And He is Almighty, Most Wise.","vec_preview":[0.002199999988079071,0.024299999698996544,-0.03229999914765358,-0.010599999688565731,0.02419999986886978,-0.04919999837875366,-0.01769999973475933,-0.0333000011742115]},{"ayah_id":"62:4","surah":62,"ayah":4,"arabic":"ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَن يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ","english":"This (arrival of the Holy Messenger [blessings and peace be upon him] as well as his spiritual benevolence) is Allah’s bounty which He grants whom He likes. And Allah is Most Bountiful.","vec_preview":[-0.004100000020116568,0.009600000455975533,-0.023499999195337296,0.010099999606609344,0.022099999710917473,-0.023499999195337296,-0.03449999913573265,-0.03060000017285347]},{"ayah_id":"62:5","surah":62,"ayah":5,"arabic":"مَثَلُ الَّذِينَ حُمِّلُوا التَّوْرَاةَ ثُمَّ لَمْ يَحْمِلُوهَا كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًا ۚ بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِ اللَّهِ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","english":"The case of those who were burdened with (the commandments and teachings of) the Torah (but) then did not bear it (i.e., this Messenger was mentioned in it, but they disbelieved in him) is like that of a donkey loaded with heavy books on its back. How evil is the example of those who have rejected Allah’s Revelations! And Allah does not guide the wrongdoers.","vec_preview":[-0.012199999764561653,0.00570000009611249,-0.019500000402331352,-0.0026000000070780516,0.013500000350177288,-0.030400000512599945,-0.028699999675154686,-0.045099999755620956]},{"ayah_id":"62:6","surah":62,"ayah":6,"arabic":"قُلْ يَا أَيُّهَا الَّذِينَ هَادُوا إِن زَعَمْتُمْ أَنَّكُمْ أَوْلِيَاءُ لِلَّهِ مِن دُونِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ إِن كُنتُمْ صَادِقِينَ","english":"Say: ‘O Jews, if you think that, leaving all other people, you alone are the friends of Allah (i.e., Awliya’), then long for death (because His Awliya’ will not fear in the grave and the Hereafter) if you are true (in your thinking).’","vec_preview":[0.016300000250339508,0.010099999606609344,-0.027799999341368675,-0.00930000003427267,0.0478999987244606,-0.027499999850988388,-0.03500000014901161,-0.04769999906420708]},{"ayah_id":"62:7","surah":62,"ayah":7,"arabic":"وَلَا يَتَمَنَّوْنَهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ ۚ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ","english":"And these people will never long for it due to (the rejection of the Messenger and disbelief) which they have sent forward. And Allah knows the wrongdoers well.","vec_preview":[-0.017999999225139618,-0.0038999998942017555,-0.03460000082850456,-0.009399999864399433,0.013000000268220901,-0.03880000114440918,-0.034299999475479126,-0.03420000150799751]},{"ayah_id":"62:8","surah":62,"ayah":8,"arabic":"قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلَاقِيكُمْ ۖ ثُمَّ تُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ","english":"Say: ‘The death from which you are fleeing is bound to catch up with you. Then you will be returned to Him (the Lord) Who knows the unseen and the seen. So He will inform you of what you used to do.’","vec_preview":[0.033799998462200165,0.012500000186264515,-0.029400000348687172,-0.00860000029206276,0.04830000177025795,-0.03929999843239784,-0.023000000044703484,-0.04670000076293945]},{"ayah_id":"62:9","surah":62,"ayah":9,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِيَ لِلصَّلَاةِ مِن يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَىٰ ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ ۚ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ","english":"O believers! When on Fridays the call is made for (Jumu‘a) Prayer, hasten towards the remembrance of Allah (i.e., the Jumu‘a sermon and Prayer) immediately and abandon purchase and sale (i.e., business). That is better for you if you have knowledge.","vec_preview":[0.009999999776482582,0.011599999852478504,-0.03460000082850456,-0.00279999990016222,0.026499999687075615,-0.03099999949336052,-0.004900000058114529,-0.05000000074505806]},{"ayah_id":"62:10","surah":62,"ayah":10,"arabic":"فَإِذَا قُضِيَتِ الصَّلَاةُ فَانتَشِرُوا فِي الْأَرْضِ وَابْتَغُوا مِن فَضْلِ اللَّهِ وَاذْكُرُوا اللَّهَ كَثِيرًا لَّعَلَّكُمْ تُفْلِحُونَ","english":"Then after the Prayer is offered, disperse in the land and (then) look for Allah’s bounty (i.e., sustenance). And remember Allah much so that you may attain to prosperity.","vec_preview":[0.00860000029206276,0.021900000050663948,-0.03959999978542328,0.0024999999441206455,0.0272000003606081,-0.03060000017285347,-0.0024999999441206455,-0.03420000150799751]},{"ayah_id":"62:11","surah":62,"ayah":11,"arabic":"وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ۚ قُلْ مَا عِندَ اللَّهِ خَيْرٌ مِّنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ","english":"And when they found some business or entertainment opportunity, they rushed towards that (due to their neediness and financial constraint) and left you standing (during the sermon). Say: ‘Whatever is with Allah is better than sport and business. And Allah is the Best of sustainers.’","vec_preview":[0.0066999997943639755,0.014600000344216824,-0.03350000083446503,-0.007899999618530273,0.054099999368190765,-0.023099999874830246,-0.002300000051036477,-0.046300001442432404]}]