[{"ayah_id":"25:1","surah":25,"ayah":1,"arabic":"تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَىٰ عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا","english":"Blessed is He (Allah) Who sent down to His (most beloved and most intimate) servant the Criterion (the Qur’an) that (draws the difference between right and wrong and) gives judgment in order that he may be a Warner to all the worlds;","vec_preview":[-0.002300000051036477,0.049300000071525574,-0.0333000011742115,-0.021400000900030136,0.01549999974668026,-0.03750000149011612,0.012400000356137753,-0.04580000042915344]},{"ayah_id":"25:2","surah":25,"ayah":2,"arabic":"الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَلَمْ يَتَّخِذْ وَلَدًا وَلَمْ يَكُن لَّهُ شَرِيكٌ فِي الْمُلْكِ وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا","english":"He (Allah) to Whom belongs the sovereignty of the heavens and the earth, and Who has not taken (to Himself) any children, nor has He any partner in His Kingdom and He alone has created everything, and then destined (i.e., formatted) it exactly according to a definite estimation (its features, functions, time frame and everything for all the stages of its growth and survival).","vec_preview":[0.01769999973475933,0.0027000000700354576,-0.03220000118017197,0.009700000286102295,0.00039999998989515007,-0.04780000075697899,-0.015699999406933784,-0.03500000014901161]},{"ayah_id":"25:3","surah":25,"ayah":3,"arabic":"وَاتَّخَذُوا مِن دُونِهِ آلِهَةً لَّا يَخْلُقُونَ شَيْئًا وَهُمْ يُخْلَقُونَ وَلَا يَمْلِكُونَ لِأَنفُسِهِمْ ضَرًّا وَلَا نَفْعًا وَلَا يَمْلِكُونَ مَوْتًا وَلَا حَيَاةً وَلَا نُشُورًا","english":"And these (polytheists) have taken besides Him other gods which cannot create anything and are themselves created and possess no power either to harm or to benefit themselves and control neither death nor life, nor (have they any authority) to raise up (after death) and assemble.","vec_preview":[-0.0019000000320374966,0.013199999928474426,-0.04390000179409981,0.0015999999595806003,0.014700000174343586,-0.03849999979138374,-0.012799999676644802,-0.0430000014603138]},{"ayah_id":"25:4","surah":25,"ayah":4,"arabic":"وَقَالَ الَّذِينَ كَفَرُوا إِنْ هَـٰذَا إِلَّا إِفْكٌ افْتَرَاهُ وَأَعَانَهُ عَلَيْهِ قَوْمٌ آخَرُونَ ۖ فَقَدْ جَاءُوا ظُلْمًا وَزُورًا","english":"And the disbelievers say: ‘This (Qur’an) is but a lie which this (claimant of Prophethood) has fabricated and other people have helped him in (inventing) it.’ Surely, the disbelievers have come down to sheer injustice and falsehood.","vec_preview":[0.006899999920278788,0.009499999694526196,-0.039000000804662704,-0.0038999998942017555,0.0333000011742115,-0.0478999987244606,-0.03819999843835831,-0.02500000037252903]},{"ayah_id":"25:5","surah":25,"ayah":5,"arabic":"وَقَالُوا أَسَاطِيرُ الْأَوَّلِينَ اكْتَتَبَهَا فَهِيَ تُمْلَىٰ عَلَيْهِ بُكْرَةً وَأَصِيلًا","english":"And they say: ‘(This Qur’an comprises) fables of the ancients which this man has got written; then these (fables) are recited to him morning and evening (in order to memorize and narrate further).’","vec_preview":[0.01940000057220459,0.010099999606609344,-0.018300000578165054,0.004000000189989805,0.026499999687075615,-0.03370000049471855,-0.0210999995470047,-0.03290000185370445]},{"ayah_id":"25:6","surah":25,"ayah":6,"arabic":"قُلْ أَنزَلَهُ الَّذِي يَعْلَمُ السِّرَّ فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ إِنَّهُ كَانَ غَفُورًا رَّحِيمًا","english":"Say: ‘He (Allah) Who knows all the secrets (present) in the heavens and the earth has sent down this Qur’an. Surely, He is Most Forgiving, Ever-Merciful.’","vec_preview":[-0.003100000089034438,0.006500000134110451,-0.019600000232458115,-0.006399999838322401,0.01850000023841858,-0.027899999171495438,0.004600000102072954,-0.02889999933540821]},{"ayah_id":"25:7","surah":25,"ayah":7,"arabic":"وَقَالُوا مَالِ هَـٰذَا الرَّسُولِ يَأْكُلُ الطَّعَامَ وَيَمْشِي فِي الْأَسْوَاقِ ۙ لَوْلَا أُنزِلَ إِلَيْهِ مَلَكٌ فَيَكُونَ مَعَهُ نَذِيرًا","english":"And they say: ‘What is the matter with this Messenger (blessings and peace be upon him)? He eats food and walks about in the marketplaces. Why has an angel not been sent down to him that he might (join) him as a Warner?","vec_preview":[0.04230000078678131,0.012600000016391277,-0.01759999990463257,0.00279999990016222,0.023900000378489494,-0.037300001829862595,-0.013899999670684338,-0.04019999876618385]},{"ayah_id":"25:8","surah":25,"ayah":8,"arabic":"أَوْ يُلْقَىٰ إِلَيْهِ كَنزٌ أَوْ تَكُونُ لَهُ جَنَّةٌ يَأْكُلُ مِنْهَا ۚ وَقَالَ الظَّالِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلًا مَّسْحُورًا","english":"Or a treasure should have been sent down to him, or (at least) he should have owned a garden so that he might eat (of its income).’ And the wrongdoers say (to the Muslims): ‘You are following but a man spellbound.’","vec_preview":[0.014800000004470348,0.004600000102072954,-0.03359999880194664,0.021900000050663948,0.04780000075697899,-0.011699999682605267,-0.04010000079870224,-0.03929999843239784]},{"ayah_id":"25:9","surah":25,"ayah":9,"arabic":"انظُرْ كَيْفَ ضَرَبُوا لَكَ الْأَمْثَالَ فَضَلُّوا فَلَا يَسْتَطِيعُونَ سَبِيلًا","english":"(O Esteemed Beloved!) Just see what sort of comparisons they utter for you! So they have gone astray and cannot find any path (to guidance).","vec_preview":[0.013199999928474426,0.03009999915957451,-0.024399999529123306,0.02280000038444996,0.026399999856948853,-0.04430000111460686,-0.01549999974668026,-0.039400000125169754]},{"ayah_id":"25:10","surah":25,"ayah":10,"arabic":"تَبَارَكَ الَّذِي إِن شَاءَ جَعَلَ لَكَ خَيْرًا مِّن ذَٰلِكَ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ وَيَجْعَل لَّكَ قُصُورًا","english":"Most Blessed is He. If He pleases, He can produce gardens for you (far) better than these (here in the world) beneath which streams flow, and raise for you magnificent palaces (but these are not the conditions for a Prophet and Messenger).","vec_preview":[0.014800000004470348,0.012500000186264515,-0.041200000792741776,0.004100000020116568,0.02969999983906746,-0.05079999938607216,-0.01549999974668026,-0.041099999099969864]},{"ayah_id":"25:11","surah":25,"ayah":11,"arabic":"بَلْ كَذَّبُوا بِالسَّاعَةِ ۖ وَأَعْتَدْنَا لِمَن كَذَّبَ بِالسَّاعَةِ سَعِيرًا","english":"But they have denied the Last Hour (as well), and for everyone who denies the Last Hour, We have prepared the blazing Fire (of Hell).","vec_preview":[-0.010999999940395355,0.006599999964237213,-0.02199999988079071,-0.006300000008195639,0.021400000900030136,-0.001500000013038516,-0.02590000070631504,-0.04479999840259552]},{"ayah_id":"25:12","surah":25,"ayah":12,"arabic":"إِذَا رَأَتْهُم مِّن مَّكَانٍ بَعِيدٍ سَمِعُوا لَهَا تَغَيُّظًا وَزَفِيرًا","english":"When that (Fire of Hell) will be visible to them (even) from a distant place, they will hear it raging and roaring.","vec_preview":[-0.012299999594688416,0.047600001096725464,-0.02669999934732914,0.00430000014603138,0.02019999921321869,-0.02979999966919422,0.009800000116229057,-0.0575999990105629]},{"ayah_id":"25:13","surah":25,"ayah":13,"arabic":"وَإِذَا أُلْقُوا مِنْهَا مَكَانًا ضَيِّقًا مُّقَرَّنِينَ دَعَوْا هُنَالِكَ ثُبُورًا","english":"And when, tightly bound (together or bound to their satans,) they will be thrown into it from some narrow place, then they will cry out for (their) destruction.","vec_preview":[-0.00570000009611249,0.014999999664723873,-0.029400000348687172,0.015300000086426735,0.02280000038444996,-0.02250000089406967,-0.022199999541044235,-0.041600000113248825]},{"ayah_id":"25:14","surah":25,"ayah":14,"arabic":"لَّا تَدْعُوا الْيَوْمَ ثُبُورًا وَاحِدًا وَادْعُوا ثُبُورًا كَثِيرًا","english":"(It will be said to them:) ‘Do not call out (just) for one destruction Today but call for many more destructions.’","vec_preview":[-0.0010999999940395355,0.03269999846816063,-0.018699999898672104,-0.003800000064074993,0.03590000048279762,-0.01510000042617321,-0.01940000057220459,-0.03319999948143959]},{"ayah_id":"25:15","surah":25,"ayah":15,"arabic":"قُلْ أَذَٰلِكَ خَيْرٌ أَمْ جَنَّةُ الْخُلْدِ الَّتِي وُعِدَ الْمُتَّقُونَ ۚ كَانَتْ لَهُمْ جَزَاءً وَمَصِيرًا","english":"Say: ‘Is this (a) better (state), or the (life of) eternal Paradise promised to the Godfearing? This is their reward (of deeds) and their abode.","vec_preview":[0.015200000256299973,0.019099999219179153,-0.03709999844431877,-0.01549999974668026,0.04670000076293945,-0.03350000083446503,-0.023800000548362732,-0.029500000178813934]},{"ayah_id":"25:16","surah":25,"ayah":16,"arabic":"لَّهُمْ فِيهَا مَا يَشَاءُونَ خَالِدِينَ ۚ كَانَ عَلَىٰ رَبِّكَ وَعْدًا مَّسْئُولًا","english":"(All) that they long for will be (available) for them in these (Gardens of Paradise). They will live (in it) for ever. That is a coveted promise which your Lord has made a (bountiful) obligation upon Himself (and which will surely be fulfilled).’","vec_preview":[-0.004800000227987766,0.01850000023841858,-0.039000000804662704,-0.007600000128149986,0.026599999517202377,-0.03359999880194664,-0.02239999920129776,-0.03889999911189079]},{"ayah_id":"25:17","surah":25,"ayah":17,"arabic":"وَيَوْمَ يَحْشُرُهُمْ وَمَا يَعْبُدُونَ مِن دُونِ اللَّهِ فَيَقُولُ أَأَنتُمْ أَضْلَلْتُمْ عِبَادِي هَـٰؤُلَاءِ أَمْ هُمْ ضَلُّوا السَّبِيلَ","english":"And on that Day, Allah will assemble them together with those they worshipped besides Allah. He will then say: ‘Was it you who led these My servants astray, or did they (themselves) go astray from the path?’","vec_preview":[-0.00570000009611249,0.027000000700354576,-0.03420000150799751,0.002300000051036477,0.02590000070631504,-0.030500000342726707,-0.006099999882280827,-0.03799999877810478]},{"ayah_id":"25:18","surah":25,"ayah":18,"arabic":"قَالُوا سُبْحَانَكَ مَا كَانَ يَنبَغِي لَنَا أَن نَّتَّخِذَ مِن دُونِكَ مِنْ أَوْلِيَاءَ وَلَـٰكِن مَّتَّعْتَهُمْ وَآبَاءَهُمْ حَتَّىٰ نَسُوا الذِّكْرَ وَكَانُوا قَوْمًا بُورًا","english":"They will say: ‘Glory be to You. It did not become us (even) to take friends other than You (let alone asking them to worship others besides You). But, (O Lord,) You bestowed upon them and their fathers worldly riches to such an extent that they forgot (even) Your remembrance. And these were but the (doomed) people to be destroyed.’","vec_preview":[0.01510000042617321,0.005200000014156103,-0.0210999995470047,0.006300000008195639,0.029899999499320984,-0.06040000170469284,-0.025599999353289604,-0.04470000043511391]},{"ayah_id":"25:19","surah":25,"ayah":19,"arabic":"فَقَدْ كَذَّبُوكُم بِمَا تَقُولُونَ فَمَا تَسْتَطِيعُونَ صَرْفًا وَلَا نَصْرًا ۚ وَمَن يَظْلِم مِّنكُمْ نُذِقْهُ عَذَابًا كَبِيرًا","english":"(O disbelievers!) They have denied what you said. So, (now) you can neither avert the torment nor help yourselves. And, (listen,) whoever of you does injustice, We shall make him taste a mighty torment.","vec_preview":[0.019700000062584877,0.027000000700354576,-0.03269999846816063,-0.009399999864399433,0.03629999980330467,-0.045099999755620956,-0.017400000244379044,-0.03370000049471855]},{"ayah_id":"25:20","surah":25,"ayah":20,"arabic":"وَمَا أَرْسَلْنَا قَبْلَكَ مِنَ الْمُرْسَلِينَ إِلَّا إِنَّهُمْ لَيَأْكُلُونَ الطَّعَامَ وَيَمْشُونَ فِي الْأَسْوَاقِ ۗ وَجَعَلْنَا بَعْضَكُمْ لِبَعْضٍ فِتْنَةً أَتَصْبِرُونَ ۗ وَكَانَ رَبُّكَ بَصِيرًا","english":"And We did not send Messengers before you but (that) they certainly ate food and also walked about in the marketplaces (as needed). And We have made you a trial for one another. Will you observe patience (in trial)? And your Lord is All-Seeing.","vec_preview":[0.027699999511241913,0.016100000590085983,-0.030300000682473183,0.002400000113993883,0.029100000858306885,-0.041099999099969864,-0.010099999606609344,-0.05460000038146973]},{"ayah_id":"25:21","surah":25,"ayah":21,"arabic":"۞ وَقَالَ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا لَوْلَا أُنزِلَ عَلَيْنَا الْمَلَائِكَةُ أَوْ نَرَىٰ رَبَّنَا ۗ لَقَدِ اسْتَكْبَرُوا فِي أَنفُسِهِمْ وَعَتَوْا عُتُوًّا كَبِيرًا","english":"And those who do not hope for meeting with Us say: ‘Why were angels not sent down to us? Or if we could see our Lord (with our own eyes, we would certainly believe).’ In fact, they esteem (themselves) very highly in their hearts and are rebelling beyond bounds.","vec_preview":[-0.009499999694526196,-0.00279999990016222,-0.026100000366568565,-0.02019999921321869,0.04830000177025795,-0.05400000140070915,-0.002199999988079071,-0.04100000113248825]},{"ayah_id":"25:22","surah":25,"ayah":22,"arabic":"يَوْمَ يَرَوْنَ الْمَلَائِكَةَ لَا بُشْرَىٰ يَوْمَئِذٍ لِّلْمُجْرِمِينَ وَيَقُولُونَ حِجْرًا مَّحْجُورًا","english":"The Day when they will see the angels, there will be no matter of joy for the evildoers anyway on that Day. They will rather say (frightened on seeing them): ‘Would that there were a barricade (which could save us from them! Or the angels, on seeing them, will say: Entry to Paradise is totally forbidden for you.)’","vec_preview":[-0.018200000748038292,0.027000000700354576,-0.033799998462200165,-0.0012000000569969416,0.03020000085234642,-0.019700000062584877,-0.008799999952316284,-0.05400000140070915]},{"ayah_id":"25:23","surah":25,"ayah":23,"arabic":"وَقَدِمْنَا إِلَىٰ مَا عَمِلُوا مِنْ عَمَلٍ فَجَعَلْنَاهُ هَبَاءً مَّنثُورًا","english":"And (then) We shall turn to the deeds they (presumably) did (in life) and shall make them scattered dust particles.","vec_preview":[0.005100000184029341,-0.009200000204145908,-0.031099999323487282,-0.01549999974668026,0.031599998474121094,-0.0272000003606081,-0.01810000091791153,-0.042100001126527786]},{"ayah_id":"25:24","surah":25,"ayah":24,"arabic":"أَصْحَابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُّسْتَقَرًّا وَأَحْسَنُ مَقِيلًا","english":"On that Day, the lodging for the inmates of Paradise will be the best, and their resting place (too) will be excellent (where they will retire for a nap after the reckoning noon).","vec_preview":[0.010200000368058681,0.012500000186264515,-0.04399999976158142,0.010499999858438969,0.01759999990463257,-0.015300000086426735,-0.020999999716877937,-0.04010000079870224]},{"ayah_id":"25:25","surah":25,"ayah":25,"arabic":"وَيَوْمَ تَشَقَّقُ السَّمَاءُ بِالْغَمَامِ وَنُزِّلَ الْمَلَائِكَةُ تَنزِيلًا","english":"And that Day, the sky will be rent asunder, changed into (the resemblance of smoke, like) a cloud, and the angels will be sent down rank upon rank.","vec_preview":[-0.013299999758601189,0.027899999171495438,-0.03240000084042549,0.0013000000035390258,-0.0031999999191612005,0.0010000000474974513,0.0020000000949949026,-0.04960000142455101]},{"ayah_id":"25:26","surah":25,"ayah":26,"arabic":"الْمُلْكُ يَوْمَئِذٍ الْحَقُّ لِلرَّحْمَـٰنِ ۚ وَكَانَ يَوْمًا عَلَى الْكَافِرِينَ عَسِيرًا","english":"That Day, true sovereignty will belong to the Most Kind (Lord) and that will be very hard (i.e., tough) Day on the disbelievers.","vec_preview":[0.013100000098347664,0.03139999881386757,-0.029400000348687172,-0.0052999998442828655,-0.0024999999441206455,-0.0406000018119812,-0.007000000216066837,-0.031300000846385956]},{"ayah_id":"25:27","surah":25,"ayah":27,"arabic":"وَيَوْمَ يَعَضُّ الظَّالِمُ عَلَىٰ يَدَيْهِ يَقُولُ يَا لَيْتَنِي اتَّخَذْتُ مَعَ الرَّسُولِ سَبِيلًا","english":"And that Day, every wrongdoer will bite his hands (in fury and frustration and) will say: ‘Would that I had taken the path (of guidance by joining) the companionship of the Holy Messenger (blessings and peace be upon him)!","vec_preview":[0.01899999938905239,0.00930000003427267,-0.026599999517202377,0.0020000000949949026,0.005799999926239252,-0.03220000118017197,0.0026000000070780516,-0.06260000169277191]},{"ayah_id":"25:28","surah":25,"ayah":28,"arabic":"يَا وَيْلَتَىٰ لَيْتَنِي لَمْ أَتَّخِذْ فُلَانًا خَلِيلًا","english":"Ah! Woe to me! Would that I had not taken such a one for a friend!","vec_preview":[0.006599999964237213,0.021700000390410423,-0.009800000116229057,-0.005200000014156103,-0.004399999976158142,-0.04280000180006027,-0.033799998462200165,-0.040800001472234726]},{"ayah_id":"25:29","surah":25,"ayah":29,"arabic":"لَّقَدْ أَضَلَّنِي عَنِ الذِّكْرِ بَعْدَ إِذْ جَاءَنِي ۗ وَكَانَ الشَّيْطَانُ لِلْإِنسَانِ خَذُولًا","english":"Surely, he led me astray from the direction and guidance after it had come to me, and Satan leaves man helpless and forlorn (in the time of distress).","vec_preview":[-0.0003000000142492354,-0.000699999975040555,-0.03319999948143959,0.010099999606609344,0.018300000578165054,-0.04500000178813934,-0.034299999475479126,-0.04479999840259552]},{"ayah_id":"25:30","surah":25,"ayah":30,"arabic":"وَقَالَ الرَّسُولُ يَا رَبِّ إِنَّ قَوْمِي اتَّخَذُوا هَـٰذَا الْقُرْآنَ مَهْجُورًا","english":"And the (Holy) Messenger (blessings and peace be upon him) will submit: ‘O Lord, surely my people had utterly abandoned this Qur’an.’","vec_preview":[0.02319999970495701,-0.019200000911951065,-0.024800000712275505,0.004000000189989805,0.0203000009059906,-0.04529999941587448,-0.014100000262260437,-0.0568000003695488]},{"ayah_id":"25:31","surah":25,"ayah":31,"arabic":"وَكَذَٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا مِّنَ الْمُجْرِمِينَ ۗ وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا","english":"And that is how We made for every Prophet (their) enemy from the evildoers (who used to oppose their Prophetic mission, and this way, a conflict between the forces of good and evil would develop and a favourable and congenial environment for peaceful change would take shape against tyranny, oppression and injustice). And your Lord is sufficient to guide and help.","vec_preview":[0.027699999511241913,0.008999999612569809,-0.029100000858306885,0.014800000004470348,0.018400000408291817,-0.04580000042915344,-0.02539999969303608,-0.03139999881386757]},{"ayah_id":"25:32","surah":25,"ayah":32,"arabic":"وَقَالَ الَّذِينَ كَفَرُوا لَوْلَا نُزِّلَ عَلَيْهِ الْقُرْآنُ جُمْلَةً وَاحِدَةً ۚ كَذَٰلِكَ لِنُثَبِّتَ بِهِ فُؤَادَكَ ۖ وَرَتَّلْنَاهُ تَرْتِيلًا","english":"And the disbelievers say: ‘Why has the Qur’an not been (put together and) sent down to this (Prophet) in one go?’ It has been revealed gradually (in segments) so that by this We may strengthen your (most sanctified) heart, and (that is why) We have recited it gradually with pauses (in order that your heart may feel tranquil by receiving Our message again and again).","vec_preview":[0.008500000461935997,-0.00019999999494757503,-0.018200000748038292,0.006800000090152025,0.04039999842643738,-0.04190000146627426,-0.02459999918937683,-0.04520000144839287]},{"ayah_id":"25:33","surah":25,"ayah":33,"arabic":"وَلَا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْنَاكَ بِالْحَقِّ وَأَحْسَنَ تَفْسِيرًا","english":"And these (disbelievers) do not bring you any (such) instance (as an objection or inquiry), but We provide you with the truth (to reply it) and an explanation better (than that).","vec_preview":[0.010400000028312206,0.01269999984651804,-0.03350000083446503,0.0010999999940395355,0.016499999910593033,-0.021199999377131462,-0.023900000378489494,-0.039799999445676804]},{"ayah_id":"25:34","surah":25,"ayah":34,"arabic":"الَّذِينَ يُحْشَرُونَ عَلَىٰ وُجُوهِهِمْ إِلَىٰ جَهَنَّمَ أُولَـٰئِكَ شَرٌّ مَّكَانًا وَأَضَلُّ سَبِيلًا","english":"(They) are such people as will be driven headlong towards Hell. It is they who are the worst ones as for their abode and are (also) much distracted from the (straight) path.","vec_preview":[0.009100000374019146,0.013899999670684338,-0.04179999977350235,0.02669999934732914,0.03660000115633011,-0.037700001150369644,-0.009200000204145908,-0.04619999974966049]},{"ayah_id":"25:35","surah":25,"ayah":35,"arabic":"وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ وَجَعَلْنَا مَعَهُ أَخَاهُ هَارُونَ وَزِيرًا","english":"And surely, We gave Musa (Moses) the Book, and appointed his brother Harun (Aaron) with him as his minister (for his help).","vec_preview":[0.023399999365210533,-0.006000000052154064,-0.029100000858306885,0.014000000432133675,0.0017999999690800905,-0.03150000050663948,-0.010900000110268593,-0.043800000101327896]},{"ayah_id":"25:36","surah":25,"ayah":36,"arabic":"فَقُلْنَا اذْهَبَا إِلَى الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِنَا فَدَمَّرْنَاهُمْ تَدْمِيرًا","english":"Then We said: ‘Go, both of you, to the people who have rejected Our signs.’ (But when, despite that, they did not abstain from belying Us) We totally destroyed them.","vec_preview":[0.0027000000700354576,-0.013899999670684338,-0.03709999844431877,-0.01860000006854534,0.020899999886751175,-0.013500000350177288,-0.035599999129772186,-0.04809999838471413]},{"ayah_id":"25:37","surah":25,"ayah":37,"arabic":"وَقَوْمَ نُوحٍ لَّمَّا كَذَّبُوا الرُّسُلَ أَغْرَقْنَاهُمْ وَجَعَلْنَاهُمْ لِلنَّاسِ آيَةً ۖ وَأَعْتَدْنَا لِلظَّالِمِينَ عَذَابًا أَلِيمًا","english":"And the people of Nuh ([Noah] as well), when they denied the Prophets, We drowned them and made them a sign of warning for (other) people. And We have prepared a painful torment for the wrongdoers.","vec_preview":[0.013500000350177288,-0.002899999963119626,-0.026000000536441803,-0.013299999758601189,0.01720000058412552,-0.046799998730421066,-0.019300000742077827,-0.050999999046325684]},{"ayah_id":"25:38","surah":25,"ayah":38,"arabic":"وَعَادًا وَثَمُودَ وَأَصْحَابَ الرَّسِّ وَقُرُونًا بَيْنَ ذَٰلِكَ كَثِيرًا","english":"And (We also annihilated) ‘?d and Thamud and the residents of Rass and many (other) people in between.","vec_preview":[0.01510000042617321,0.009600000455975533,-0.02250000089406967,-0.007300000172108412,0.025299999862909317,-0.0430000014603138,-0.01549999974668026,-0.032600000500679016]},{"ayah_id":"25:39","surah":25,"ayah":39,"arabic":"وَكُلًّا ضَرَبْنَا لَهُ الْأَمْثَالَ ۖ وَكُلًّا تَبَّرْنَا تَتْبِيرًا","english":"And We explained examples to each one (of them for direction and guidance,) but (when they did not refrain from rebellion,) We wiped them off completely.","vec_preview":[0.003100000089034438,0.011099999770522118,-0.014600000344216824,0.026100000366568565,-0.005100000184029341,-0.03440000116825104,-0.014499999582767487,-0.0348999984562397]},{"ayah_id":"25:40","surah":25,"ayah":40,"arabic":"وَلَقَدْ أَتَوْا عَلَى الْقَرْيَةِ الَّتِي أُمْطِرَتْ مَطَرَ السَّوْءِ ۚ أَفَلَمْ يَكُونُوا يَرَوْنَهَا ۚ بَلْ كَانُوا لَا يَرْجُونَ نُشُورًا","english":"And certainly these (disbelievers) have passed by (the remains of) that town on which was showered a disastrous rain (of stones). Did they not see that (ruined town)? But the truth is that they do not expect to be raised up (after death).","vec_preview":[0.00419999985024333,-0.008500000461935997,-0.04179999977350235,0.0008999999845400453,0.017000000923871994,-0.03720000013709068,-0.026000000536441803,-0.04340000078082085]},{"ayah_id":"25:41","surah":25,"ayah":41,"arabic":"وَإِذَا رَأَوْكَ إِن يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَـٰذَا الَّذِي بَعَثَ اللَّهُ رَسُولًا","english":"And, (O Esteemed Beloved,) when they see you, they do nothing but make fun of you (and say:) ‘Is this (the one) Allah has sent as a Messenger?","vec_preview":[0.005499999970197678,0.004900000058114529,-0.024700000882148743,0.016699999570846558,0.019700000062584877,-0.03229999914765358,-0.009499999694526196,-0.052299998700618744]},{"ayah_id":"25:42","surah":25,"ayah":42,"arabic":"إِن كَادَ لَيُضِلُّنَا عَنْ آلِهَتِنَا لَوْلَا أَن صَبَرْنَا عَلَيْهَا ۚ وَسَوْفَ يَعْلَمُونَ حِينَ يَرَوْنَ الْعَذَابَ مَنْ أَضَلُّ سَبِيلًا","english":"He had nearly turned us away from our gods, had we not held fast to their (worship).’ And when they see the torment, they will soon realize who was astray.","vec_preview":[-0.012500000186264515,0.006399999838322401,-0.020600000396370888,0.015699999406933784,0.014100000262260437,-0.045899998396635056,-0.01810000091791153,-0.05490000173449516]},{"ayah_id":"25:43","surah":25,"ayah":43,"arabic":"أَرَأَيْتَ مَنِ اتَّخَذَ إِلَـٰهَهُ هَوَاهُ أَفَأَنتَ تَكُونُ عَلَيْهِ وَكِيلًا","english":"Have you seen him who has taken the desire of his lower self as god? Would you then become a guardian over him?","vec_preview":[0.0012000000569969416,0.011599999852478504,-0.022299999371170998,0.026799999177455902,0.009200000204145908,-0.03269999846816063,-0.01679999940097332,-0.02930000051856041]},{"ayah_id":"25:44","surah":25,"ayah":44,"arabic":"أَمْ تَحْسَبُ أَنَّ أَكْثَرَهُمْ يَسْمَعُونَ أَوْ يَعْقِلُونَ ۚ إِنْ هُمْ إِلَّا كَالْأَنْعَامِ ۖ بَلْ هُمْ أَضَلُّ سَبِيلًا","english":"Do you think that most of them hear or understand? (Nay,) they have become like cattle, rather worse in error than they are.","vec_preview":[0.0026000000070780516,0.0340999998152256,-0.026399999856948853,-0.008500000461935997,0.019500000402331352,-0.054999999701976776,-0.006500000134110451,-0.037300001829862595]},{"ayah_id":"25:45","surah":25,"ayah":45,"arabic":"أَلَمْ تَرَ إِلَىٰ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ وَلَوْ شَاءَ لَجَعَلَهُ سَاكِنًا ثُمَّ جَعَلْنَا الشَّمْسَ عَلَيْهِ دَلِيلًا","english":"Have you not had a glance of (the Might of) your Lord, how He lengthens the shadow (till noon)? And had He willed, He could certainly have made it stationary. Then We have made the sun a proof of this (shadow).","vec_preview":[-0.010400000028312206,-0.0019000000320374966,-0.026200000196695328,0.011099999770522118,0.016899999231100082,-0.04740000143647194,-0.004100000020116568,-0.04399999976158142]},{"ayah_id":"25:46","surah":25,"ayah":46,"arabic":"ثُمَّ قَبَضْنَاهُ إِلَيْنَا قَبْضًا يَسِيرًا","english":"Then, drawing this (shadow) little by little towards Ourselves, We roll it up.","vec_preview":[0.003000000026077032,0.01850000023841858,-0.02710000053048134,-0.006000000052154064,0.017100000753998756,-0.0364999994635582,-0.02239999920129776,-0.028599999845027924]},{"ayah_id":"25:47","surah":25,"ayah":47,"arabic":"وَهُوَ الَّذِي جَعَلَ لَكُمُ اللَّيْلَ لِبَاسًا وَالنَّوْمَ سُبَاتًا وَجَعَلَ النَّهَارَ نُشُورًا","english":"And He is the One Who has made the night a (wrapper-like) covering for you and made sleep (a means of) rest (for you) and the day a time to get up (for work).","vec_preview":[0.021800000220537186,0.004800000227987766,-0.02590000070631504,-0.01119999960064888,0.0272000003606081,-0.03750000149011612,-0.010200000368058681,-0.04619999974966049]},{"ayah_id":"25:48","surah":25,"ayah":48,"arabic":"وَهُوَ الَّذِي أَرْسَلَ الرِّيَاحَ بُشْرًا بَيْنَ يَدَيْ رَحْمَتِهِ ۚ وَأَنزَلْنَا مِنَ السَّمَاءِ مَاءً طَهُورًا","english":"And He is the One Who sends the breezes as good news before (the rain of) His mercy. And it is We Who send down pure (and cleansing) water from the sky,","vec_preview":[0.015399999916553497,0.006300000008195639,-0.033799998462200165,-0.027000000700354576,0.013199999928474426,-0.024800000712275505,-0.019500000402331352,-0.03790000081062317]},{"ayah_id":"25:49","surah":25,"ayah":49,"arabic":"لِّنُحْيِيَ بِهِ بَلْدَةً مَّيْتًا وَنُسْقِيَهُ مِمَّا خَلَقْنَا أَنْعَامًا وَأَنَاسِيَّ كَثِيرًا","english":"So that We may give life with that to (any) dead city, and (furthermore) We provide this (water) for drink to many cattle and (nomadic) people that We have created.","vec_preview":[0.015699999406933784,0.0032999999821186066,-0.021199999377131462,-0.027000000700354576,0.01209999993443489,-0.011800000444054604,-0.021900000050663948,-0.041600000113248825]},{"ayah_id":"25:50","surah":25,"ayah":50,"arabic":"وَلَقَدْ صَرَّفْنَاهُ بَيْنَهُمْ لِيَذَّكَّرُوا فَأَبَىٰ أَكْثَرُ النَّاسِ إِلَّا كُفُورًا","english":"And surely, We keep distributing this (rain) amongst them (on the scale of different times and cities) so that they may contemplate. Even then most people did not accept (anything) except ingratitude.","vec_preview":[0.018200000748038292,0.02419999986886978,-0.015300000086426735,-0.025499999523162842,0.02669999934732914,-0.025800000876188278,-0.025699999183416367,-0.017400000244379044]},{"ayah_id":"25:51","surah":25,"ayah":51,"arabic":"وَلَوْ شِئْنَا لَبَعَثْنَا فِي كُلِّ قَرْيَةٍ نَّذِيرًا","english":"And had We willed, We would have sent a Warner in every town.","vec_preview":[0.004699999932199717,-0.005200000014156103,-0.01730000041425228,0.007799999788403511,0.0013000000035390258,-0.007300000172108412,-0.017000000923871994,-0.04270000010728836]},{"ayah_id":"25:52","surah":25,"ayah":52,"arabic":"فَلَا تُطِعِ الْكَافِرِينَ وَجَاهِدْهُم بِهِ جِهَادًا كَبِيرًا","english":"So, (O man of faith,) do not follow the disbelievers, and launch a large-scale struggle against them by means of (logic and preaching of the Qur’an).","vec_preview":[-0.010300000198185444,0.006599999964237213,-0.025599999353289604,-0.003100000089034438,0.04129999876022339,-0.02879999950528145,-0.027400000020861626,-0.030400000512599945]},{"ayah_id":"25:53","surah":25,"ayah":53,"arabic":"۞ وَهُوَ الَّذِي مَرَجَ الْبَحْرَيْنِ هَـٰذَا عَذْبٌ فُرَاتٌ وَهَـٰذَا مِلْحٌ أُجَاجٌ وَجَعَلَ بَيْنَهُمَا بَرْزَخًا وَحِجْرًا مَّحْجُورًا","english":"And He is the One Who joined two rivers, this (one) very sweet and freshening and that (other one) very salty and bitter. And He set a barrier and a strong partition between them.","vec_preview":[0.025200000032782555,0.026000000536441803,-0.03229999914765358,0.00039999998989515007,0.02280000038444996,-0.05829999968409538,-0.026000000536441803,-0.02019999921321869]},{"ayah_id":"25:54","surah":25,"ayah":54,"arabic":"وَهُوَ الَّذِي خَلَقَ مِنَ الْمَاءِ بَشَرًا فَجَعَلَهُ نَسَبًا وَصِهْرًا ۗ وَكَانَ رَبُّكَ قَدِيرًا","english":"And He is the One Who created man from (a sperm drop resembling) water, and made for him (kinship by) lineage and in-laws. And your Lord is All-Powerful.","vec_preview":[0.011800000444054604,0.026000000536441803,-0.03480000048875809,-0.017000000923871994,0.021800000220537186,-0.03929999843239784,-0.01759999990463257,-0.027400000020861626]},{"ayah_id":"25:55","surah":25,"ayah":55,"arabic":"وَيَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَا يَنفَعُهُمْ وَلَا يَضُرُّهُمْ ۗ وَكَانَ الْكَافِرُ عَلَىٰ رَبِّهِ ظَهِيرًا","english":"And they (disbelievers) worship besides Allah those (idols) that can neither bring them any profit, nor do them any harm. And the disbeliever is (always) a helper (of Satan) in (disobeying) his Lord.","vec_preview":[-0.022299999371170998,0.009600000455975533,-0.04540000110864639,0.0006000000284984708,0.01730000041425228,-0.05820000171661377,-0.024299999698996544,-0.01679999940097332]},{"ayah_id":"25:56","surah":25,"ayah":56,"arabic":"وَمَا أَرْسَلْنَاكَ إِلَّا مُبَشِّرًا وَنَذِيرًا","english":"And We have not sent you but as a Bearer of good news (for the obedient servants of Allah) and as a Warner (to the rebels).","vec_preview":[0.014700000174343586,0.032499998807907104,-0.018200000748038292,0.017799999564886093,0.027799999341368675,-0.03909999877214432,-0.017000000923871994,-0.02800000086426735]},{"ayah_id":"25:57","surah":25,"ayah":57,"arabic":"قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ إِلَّا مَن شَاءَ أَن يَتَّخِذَ إِلَىٰ رَبِّهِ سَبِيلًا","english":"Say: ‘I do not ask you for any compensation for this (preaching), but that whoever desires to take a path to (reach) his Lord (may step in).’","vec_preview":[0.026900000870227814,0.012900000438094139,-0.02810000069439411,-0.0007999999797903001,0.03530000150203705,-0.0357000008225441,-0.019300000742077827,-0.03689999878406525]},{"ayah_id":"25:58","surah":25,"ayah":58,"arabic":"وَتَوَكَّلْ عَلَى الْحَيِّ الَّذِي لَا يَمُوتُ وَسَبِّحْ بِحَمْدِهِ ۚ وَكَفَىٰ بِهِ بِذُنُوبِ عِبَادِهِ خَبِيرًا","english":"And put your trust in the Ever-Living (Lord) Who will never die, and glorify Him with His praise, and Sufficient is His awareness of the sins of His servants,","vec_preview":[0.007699999958276749,0.010700000450015068,-0.0406000018119812,0.004399999976158142,0.01600000075995922,-0.039799999445676804,-0.025800000876188278,-0.0421999990940094]},{"ayah_id":"25:59","surah":25,"ayah":59,"arabic":"الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۚ الرَّحْمَـٰنُ فَاسْأَلْ بِهِ خَبِيرًا","english":"He Who created the heavenly spheres and the earth and this (universe) in between in six periods.* Then He established (His authority) on the Throne (befitting His Majesty. He) is Most Kind. (O aspirant to His gnosis!) Ask of Him someone who has attained to His awareness. (The unaware do not have any gnosis of Him.)","vec_preview":[0.015300000086426735,0.023600000888109207,-0.02759999968111515,-0.002099999925121665,0.014999999664723873,-0.034299999475479126,0.007699999958276749,-0.039900001138448715]},{"ayah_id":"25:60","surah":25,"ayah":60,"arabic":"وَإِذَا قِيلَ لَهُمُ اسْجُدُوا لِلرَّحْمَـٰنِ قَالُوا وَمَا الرَّحْمَـٰنُ أَنَسْجُدُ لِمَا تَأْمُرُنَا وَزَادَهُمْ نُفُورًا ۩","english":"And when it is said to them: ‘Prostrate yourselves before the Most Kind (Lord),’ the (deniers of the truth) say: ‘What is the Most Kind Lord? Shall we prostrate ourselves before whatever you command us?’ And this (command) increased only hatred in them.","vec_preview":[0.010499999858438969,0.01360000018030405,-0.0348999984562397,0.002899999963119626,0.029999999329447746,-0.04100000113248825,-0.017799999564886093,-0.022600000724196434]},{"ayah_id":"25:61","surah":25,"ayah":61,"arabic":"تَبَارَكَ الَّذِي جَعَلَ فِي السَّمَاءِ بُرُوجًا وَجَعَلَ فِيهَا سِرَاجًا وَقَمَرًا مُّنِيرًا","english":"Most Blessed and Most Glorified is He Who made vast mansions of heavenly spheres (in the form of galaxies) in the heavenly cosmos and made (the sun) in it a (light-generating and heat-emitting) lamp and a shining moon (in the solar system).","vec_preview":[0.003000000026077032,0.021900000050663948,-0.03319999948143959,-0.0017999999690800905,0.02329999953508377,-0.03269999846816063,-0.006200000178068876,-0.05139999836683273]},{"ayah_id":"25:62","surah":25,"ayah":62,"arabic":"وَهُوَ الَّذِي جَعَلَ اللَّيْلَ وَالنَّهَارَ خِلْفَةً لِّمَنْ أَرَادَ أَن يَذَّكَّرَ أَوْ أَرَادَ شُكُورًا","english":"And He is the One Who made the day and the night rotate after each other for him who desires to contemplate or intends to be grateful. (There is direction and guidance in these creative powers.)","vec_preview":[-0.0008999999845400453,0.003599999938160181,-0.03539999946951866,-0.016200000420212746,0.0210999995470047,-0.01810000091791153,-0.02280000038444996,-0.05290000140666962]},{"ayah_id":"25:63","surah":25,"ayah":63,"arabic":"وَعِبَادُ الرَّحْمَـٰنِ الَّذِينَ يَمْشُونَ عَلَى الْأَرْضِ هَوْنًا وَإِذَا خَاطَبَهُمُ الْجَاهِلُونَ قَالُوا سَلَامًا","english":"And the (favourite) servants of the Most Kind (Lord) are those who walk gently on the earth, and when the ignorant (i.e., impolite) people say to them something (unlikable), they (get aside), saying: ‘Peace.’","vec_preview":[0.0015999999595806003,0.020500000566244125,-0.04089999943971634,0.008799999952316284,0.02710000053048134,-0.03629999980330467,-0.021199999377131462,-0.02449999935925007]},{"ayah_id":"25:64","surah":25,"ayah":64,"arabic":"وَالَّذِينَ يَبِيتُونَ لِرَبِّهِمْ سُجَّدًا وَقِيَامًا","english":"And (these) are the ones who spend their nights prostrating themselves and standing before their Lord (cloaked in submissiveness).","vec_preview":[0.007899999618530273,0.008899999782443047,-0.03909999877214432,0.008899999782443047,0.034299999475479126,-0.01679999940097332,-0.01769999973475933,-0.03519999980926514]},{"ayah_id":"25:65","surah":25,"ayah":65,"arabic":"وَالَّذِينَ يَقُولُونَ رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ ۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا","english":"And (these) are the people who pray (all the time before the presence of Allah): ‘O our Lord, turn away from us the torment of Hell. Surely, its torment is most injurious (and everlasting).","vec_preview":[0.005200000014156103,0.0010000000474974513,-0.03929999843239784,0.004699999932199717,0.0364999994635582,-0.051600001752376556,-0.009499999694526196,-0.04259999841451645]},{"ayah_id":"25:66","surah":25,"ayah":66,"arabic":"إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا","english":"Surely, that is an evil lodging (for temporary lodgers) and an evil abode (for permanent dwellers).’","vec_preview":[0.013399999588727951,0.02459999918937683,-0.02759999968111515,0.02070000022649765,0.017799999564886093,-0.03550000116229057,-0.009700000286102295,-0.041099999099969864]},{"ayah_id":"25:67","surah":25,"ayah":67,"arabic":"وَالَّذِينَ إِذَا أَنفَقُوا لَمْ يُسْرِفُوا وَلَمْ يَقْتُرُوا وَكَانَ بَيْنَ ذَٰلِكَ قَوَامًا","english":"And (these) are the people who are neither extravagant nor miserly when they spend. And their spending is (based on) a balance between the two extremes (of extravagance and miserliness).","vec_preview":[0.023900000378489494,0.017500000074505806,-0.04360000044107437,0.0035000001080334187,0.026799999177455902,-0.05810000002384186,-0.030799999833106995,-0.032099999487400055]},{"ayah_id":"25:68","surah":25,"ayah":68,"arabic":"وَالَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَـٰهًا آخَرَ وَلَا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَلَا يَزْنُونَ ۚ وَمَن يَفْعَلْ ذَٰلِكَ يَلْقَ أَثَامًا","english":"And these are the people who do not worship any other god apart from Allah, nor do they kill the soul whose killing without any lawful cause Allah has forbidden, nor do they commit adultery. And whoever does this will receive the punishment due for the sin.","vec_preview":[-0.003800000064074993,0.01759999990463257,-0.036400001496076584,0.0019000000320374966,0.03750000149011612,-0.03849999979138374,-0.022299999371170998,-0.033900000154972076]},{"ayah_id":"25:69","surah":25,"ayah":69,"arabic":"يُضَاعَفْ لَهُ الْعَذَابُ يَوْمَ الْقِيَامَةِ وَيَخْلُدْ فِيهِ مُهَانًا","english":"His punishment will be doubled on the Day of Rising and, disgraced and humiliated, he will live in it forever.","vec_preview":[0.010599999688565731,0.03240000084042549,-0.027000000700354576,0.016200000420212746,0.024299999698996544,-0.019700000062584877,-0.008299999870359898,-0.04170000180602074]},{"ayah_id":"25:70","surah":25,"ayah":70,"arabic":"إِلَّا مَن تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَـٰئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ ۗ وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا","english":"But whoever repents and believes and does good deeds, so these are the people whose evil deeds Allah will change into good ones. And Allah is Most Forgiving, Ever-Merciful.","vec_preview":[0.00930000003427267,0.014000000432133675,-0.02319999970495701,0.00139999995008111,0.021400000900030136,-0.047200001776218414,-0.013000000268220901,-0.023399999365210533]},{"ayah_id":"25:71","surah":25,"ayah":71,"arabic":"وَمَن تَابَ وَعَمِلَ صَالِحًا فَإِنَّهُ يَتُوبُ إِلَى اللَّهِ مَتَابًا","english":"And whoever repents and executes good, so he returns to Allah (the way) returning is due.","vec_preview":[0.016100000590085983,-0.001500000013038516,-0.025699999183416367,-0.0005000000237487257,0.03310000151395798,-0.01119999960064888,-0.020099999383091927,-0.03889999911189079]},{"ayah_id":"25:72","surah":25,"ayah":72,"arabic":"وَالَّذِينَ لَا يَشْهَدُونَ الزُّورَ وَإِذَا مَرُّوا بِاللَّغْوِ مَرُّوا كِرَامًا","english":"And these are the people who do not attend (both verbally and practically) the false and untruthful matters, and when they pass by evil activities, they pass on (observing caution) with utmost nobility and dignity.","vec_preview":[0.006399999838322401,0.014100000262260437,-0.037300001829862595,0.008299999870359898,0.014600000344216824,-0.04610000178217888,-0.033399999141693115,-0.03840000182390213]},{"ayah_id":"25:73","surah":25,"ayah":73,"arabic":"وَالَّذِينَ إِذَا ذُكِّرُوا بِآيَاتِ رَبِّهِمْ لَمْ يَخِرُّوا عَلَيْهَا صُمًّا وَعُمْيَانًا","english":"And these are the people who, when they are directed and guided by means of Revelations of their Lord, do not fall at them deaf and blind (but reflect on them).","vec_preview":[-0.005100000184029341,0.007300000172108412,-0.0430000014603138,-0.01899999938905239,0.007400000002235174,-0.02800000086426735,-0.02810000069439411,-0.033399999141693115]},{"ayah_id":"25:74","surah":25,"ayah":74,"arabic":"وَالَّذِينَ يَقُولُونَ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا","english":"And these are the people who submit (before the presence of Allah): ‘O our Lord, grant us coolness of eyes in our wives and our children, and make us leaders of the Godfearing people.’","vec_preview":[0.01140000019222498,-0.00930000003427267,-0.03099999949336052,-0.006899999920278788,0.040699999779462814,-0.03799999877810478,-0.01850000023841858,-0.04280000180006027]},{"ayah_id":"25:75","surah":25,"ayah":75,"arabic":"أُولَـٰئِكَ يُجْزَوْنَ الْغُرْفَةَ بِمَا صَبَرُوا وَيُلَقَّوْنَ فِيهَا تَحِيَّةً وَسَلَامًا","english":"They will be rewarded with lofty palaces (in Paradise) as recompense for their patience and steadfastness and will be welcomed therein with greetings and salutations of peace.","vec_preview":[0.010499999858438969,0.03240000084042549,-0.03759999945759773,0.007400000002235174,0.006200000178068876,-0.004399999976158142,-0.012799999676644802,-0.040800001472234726]},{"ayah_id":"25:76","surah":25,"ayah":76,"arabic":"خَالِدِينَ فِيهَا ۚ حَسُنَتْ مُسْتَقَرًّا وَمُقَامًا","english":"They will live therein forever. Those (lofty palaces in Paradise) are the most excellent lodgings and (decent) abodes.","vec_preview":[0.03200000151991844,0.025200000032782555,-0.04430000111460686,0.010200000368058681,0.03240000084042549,-0.022099999710917473,-0.026200000196695328,-0.039400000125169754]},{"ayah_id":"25:77","surah":25,"ayah":77,"arabic":"قُلْ مَا يَعْبَأُ بِكُمْ رَبِّي لَوْلَا دُعَاؤُكُمْ ۖ فَقَدْ كَذَّبْتُمْ فَسَوْفَ يَكُونُ لِزَامًا","english":"Say: ‘My Lord cares little for you if you do not worship (Him). But you have indeed rejected (Him). So now this (denial) will ever endure as a permanent torment (for you).’","vec_preview":[0.005499999970197678,0.0006000000284984708,-0.042500000447034836,-0.0013000000035390258,0.019999999552965164,-0.03790000081062317,-0.0284000001847744,-0.0348999984562397]}]