[{"ayah_id":"13:1","surah":13,"ayah":1,"arabic":"المر ۚ تِلْكَ آيَاتُ الْكِتَابِ ۗ وَالَّذِي أُنزِلَ إِلَيْكَ مِن رَّبِّكَ الْحَقُّ وَلَـٰكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ","english":"Alif, Lam, Mim, Ra. (Only Allah and the Messenger [blessings and peace be upon him] know the real meaning.) These are the Verses of the Book of Allah, and whatever has been revealed to you from your Lord is the truth, but most people do not believe.","vec_preview":[0.02449999935925007,0.017400000244379044,-0.017799999564886093,-0.02930000051856041,0.008799999952316284,-0.03959999978542328,-0.010700000450015068,-0.04800000041723251]},{"ayah_id":"13:2","surah":13,"ayah":2,"arabic":"اللَّهُ الَّذِي رَفَعَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۖ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ كُلٌّ يَجْرِي لِأَجَلٍ مُّسَمًّى ۚ يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ لَعَلَّكُم بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ","english":"Allah is He Who has raised the heavens aloft (in space) without pillars (as) you see; then He established His authority on the Throne (encompassing the entire universe befitting His glory) and fettered the sun and the moon to a system, each moving (in its respective orbit to complete its rotation) during its appointed term. He alone devises strategies for the total system (of the entire universe), and vividly manifests (all the) signs (or the laws of nature) so that you may develop firm faith in appearing before your Lord.","vec_preview":[-0.007400000002235174,0.01590000092983246,-0.030700000002980232,0.009200000204145908,0.011500000022351742,-0.02669999934732914,-0.006200000178068876,-0.041200000792741776]},{"ayah_id":"13:3","surah":13,"ayah":3,"arabic":"وَهُوَ الَّذِي مَدَّ الْأَرْضَ وَجَعَلَ فِيهَا رَوَاسِيَ وَأَنْهَارًا ۖ وَمِن كُلِّ الثَّمَرَاتِ جَعَلَ فِيهَا زَوْجَيْنِ اثْنَيْنِ ۖ يُغْشِي اللَّيْلَ النَّهَارَ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَتَفَكَّرُونَ","english":"And He is the One Who spread out the earth (despite its being round) and brought about mountains and rivers in it and produced pairs of (genders) two each amongst all kinds of fruits (as well. He is the One Who) stretches the cover of the night over the day. Indeed, there are (many) signs in it for those who meditate.","vec_preview":[0.03920000046491623,0.004000000189989805,-0.039400000125169754,-0.003100000089034438,0.022099999710917473,-0.0210999995470047,-0.03449999913573265,-0.05090000107884407]},{"ayah_id":"13:4","surah":13,"ayah":4,"arabic":"وَفِي الْأَرْضِ قِطَعٌ مُّتَجَاوِرَاتٌ وَجَنَّاتٌ مِّنْ أَعْنَابٍ وَزَرْعٌ وَنَخِيلٌ صِنْوَانٌ وَغَيْرُ صِنْوَانٍ يُسْقَىٰ بِمَاءٍ وَاحِدٍ وَنُفَضِّلُ بَعْضَهَا عَلَىٰ بَعْضٍ فِي الْأُكُلِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَعْقِلُونَ","english":"And there are, in the earth, tracts (of different kinds) that are adjacent to each other and the gardens of grapes and crops and palm trees, clustered and non-clustered. All these are irrigated with the same water. And (despite that) We make some of them superior to others in taste. Verily, there are (great) signs in it for the people who apply reason.","vec_preview":[0.009600000455975533,0.04560000076889992,-0.03720000013709068,0.013500000350177288,0.03200000151991844,-0.025599999353289604,-0.027300000190734863,-0.04439999908208847]},{"ayah_id":"13:5","surah":13,"ayah":5,"arabic":"۞ وَإِن تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ أَإِذَا كُنَّا تُرَابًا أَإِنَّا لَفِي خَلْقٍ جَدِيدٍ ۗ أُولَـٰئِكَ الَّذِينَ كَفَرُوا بِرَبِّهِمْ ۖ وَأُولَـٰئِكَ الْأَغْلَالُ فِي أَعْنَاقِهِمْ ۖ وَأُولَـٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ","english":"And if you are surprised (at the denial of the disbelievers), then (more) surprising is that they say: ‘What, when we become dust (after death), shall we then be created anew?’ They are the ones who deny their Lord, and they alone will have shackles around their necks. And they are the ones who are the inmates of Hell. They will reside in it forever.","vec_preview":[0.003100000089034438,0.01640000008046627,-0.029999999329447746,0.009999999776482582,0.030899999663233757,-0.04650000110268593,-0.029100000858306885,-0.0421999990940094]},{"ayah_id":"13:6","surah":13,"ayah":6,"arabic":"وَيَسْتَعْجِلُونَكَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ وَقَدْ خَلَتْ مِن قَبْلِهِمُ الْمَثُلَاتُ ۗ وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِّلنَّاسِ عَلَىٰ ظُلْمِهِمْ ۖ وَإِنَّ رَبَّكَ لَشَدِيدُ الْعِقَابِ","english":"And they hasten to demand from you punishment before mercy though many torments have passed before them. And, (O Beloved,) your Lord is Most Forgiving to the people despite their (oppression and) injustice. But certainly, your Lord is Severe in punishment (as well).","vec_preview":[0.00930000003427267,0.030300000682473183,-0.04529999941587448,-0.0012000000569969416,0.03759999945759773,-0.04749999940395355,0.0007999999797903001,-0.04309999942779541]},{"ayah_id":"13:7","surah":13,"ayah":7,"arabic":"وَيَقُولُ الَّذِينَ كَفَرُوا لَوْلَا أُنزِلَ عَلَيْهِ آيَةٌ مِّن رَّبِّهِ ۗ إِنَّمَا أَنتَ مُنذِرٌ ۖ وَلِكُلِّ قَوْمٍ هَادٍ","english":"And the disbelievers say: ‘Why has any sign not been sent down to this (Messenger) from his Lord?’ (O My Glorious Messenger!) You are only a warner (to the disobedient of their evil consequences) and a provider of guidance to every community (of the world).","vec_preview":[0.018300000578165054,0.016599999740719795,-0.026599999517202377,0.009499999694526196,0.035100001841783524,-0.041999999433755875,-0.01899999938905239,-0.0340999998152256]},{"ayah_id":"13:8","surah":13,"ayah":8,"arabic":"اللَّهُ يَعْلَمُ مَا تَحْمِلُ كُلُّ أُنثَىٰ وَمَا تَغِيضُ الْأَرْحَامُ وَمَا تَزْدَادُ ۖ وَكُلُّ شَيْءٍ عِندَهُ بِمِقْدَارٍ","english":"Allah knows what every female bears in her womb, and how much the wombs contract and how much they distend, and with Him is everything in a fixed measure.","vec_preview":[-0.0003000000142492354,0.013100000098347664,-0.023499999195337296,0.026100000366568565,0.017000000923871994,-0.04659999907016754,-0.014499999582767487,-0.025499999523162842]},{"ayah_id":"13:9","surah":13,"ayah":9,"arabic":"عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْكَبِيرُ الْمُتَعَالِ","english":"He is the Knower of the unseen and the seen, the Most Great (and) the Most Exalted.","vec_preview":[-0.0017000000225380063,0.000699999975040555,-0.0032999999821186066,0.0052999998442828655,0.017500000074505806,-0.007000000216066837,-0.0035000001080334187,-0.02199999988079071]},{"ayah_id":"13:10","surah":13,"ayah":10,"arabic":"سَوَاءٌ مِّنكُم مَّنْ أَسَرَّ الْقَوْلَ وَمَن جَهَرَ بِهِ وَمَنْ هُوَ مُسْتَخْفٍ بِاللَّيْلِ وَسَارِبٌ بِالنَّهَارِ","english":"He amongst you who talks in a low voice, and the other who talks in a loud voice, and he who is hidden in (the darkness of) the night, and he who moves about in the day(light), all are alike (to Him).","vec_preview":[0.022099999710917473,0.018300000578165054,-0.022299999371170998,0.003000000026077032,0.040699999779462814,-0.04390000179409981,0.007799999788403511,-0.04270000010728836]},{"ayah_id":"13:11","surah":13,"ayah":11,"arabic":"لَهُ مُعَقِّبَاتٌ مِّن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ ۗ إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنفُسِهِمْ ۗ وَإِذَا أَرَادَ اللَّهُ بِقَوْمٍ سُوءًا فَلَا مَرَدَّ لَهُ ۚ وَمَا لَهُم مِّن دُونِهِ مِن وَالٍ","english":"For (every) human being there are (angels) coming in succession who, before him and behind him, guard him by the command of Allah. Verily, Allah does not change the state of a people until they bring about a change in themselves. And when Allah intends to torment a people (due to their own evil works), then none can avert it. Nor is there any helper for them apart from Allah.","vec_preview":[-0.006099999882280827,0.019200000911951065,-0.03550000116229057,0.0034000000450760126,0.047600001096725464,-0.038100000470876694,-0.04230000078678131,-0.049800001084804535]},{"ayah_id":"13:12","surah":13,"ayah":12,"arabic":"هُوَ الَّذِي يُرِيكُمُ الْبَرْقَ خَوْفًا وَطَمَعًا وَيُنشِئُ السَّحَابَ الثِّقَالَ","english":"He is the One Who, to rouse in you (sometimes) fear and (some other times) hope, shows you lightning, and (at times) raises (rain-laden) heavy clouds.","vec_preview":[0.0071000000461936,0.028200000524520874,-0.03530000150203705,0.00139999995008111,0.019999999552965164,-0.03689999878406525,0.0010999999940395355,-0.05209999904036522]},{"ayah_id":"13:13","surah":13,"ayah":13,"arabic":"وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ وَيُرْسِلُ الصَّوَاعِقَ فَيُصِيبُ بِهَا مَن يَشَاءُ وَهُمْ يُجَادِلُونَ فِي اللَّهِ وَهُوَ شَدِيدُ الْمِحَالِ","english":"And the thunder (of clouds and lightning or the angel appointed over it) and all angels glorify Him with His praise out of His fear. And He sends thunderbolts and strikes with them whom He wills. And they (the disbelievers, despite these signs of His Might,) dispute about Allah. And He is Stern in strategy and Severe in grip.","vec_preview":[0.013000000268220901,0.035100001841783524,-0.03539999946951866,0.009100000374019146,0.03220000118017197,-0.01360000018030405,0.0027000000700354576,-0.03449999913573265]},{"ayah_id":"13:14","surah":13,"ayah":14,"arabic":"لَهُ دَعْوَةُ الْحَقِّ ۖ وَالَّذِينَ يَدْعُونَ مِن دُونِهِ لَا يَسْتَجِيبُونَ لَهُم بِشَيْءٍ إِلَّا كَبَاسِطِ كَفَّيْهِ إِلَى الْمَاءِ لِيَبْلُغَ فَاهُ وَمَا هُوَ بِبَالِغِهِ ۚ وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ","english":"Calling towards the truth (i.e., the Oneness of Allah) is for Him alone. And those (false gods—idols) they (disbelievers) worship besides Him cannot give them any answer at all. Their example is like the one who (sits) stretching both his palms towards water so that it may reach his mouth (itself), but it (the water) reaches not (like this). And (in like manner) the praying of disbelievers (to idols and their idol-worship) is but a distraction.","vec_preview":[-0.00860000029206276,0.02410000003874302,-0.030700000002980232,-0.002199999988079071,0.02810000069439411,-0.025100000202655792,-0.012299999594688416,-0.023900000378489494]},{"ayah_id":"13:15","surah":13,"ayah":15,"arabic":"وَلِلَّهِ يَسْجُدُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَالُهُم بِالْغُدُوِّ وَالْآصَالِ ۩","english":"And whoever is in the heavens and the earth prostrates himself before Allah, (some) willingly and (others) perforce, and their shadows (too prostrate themselves before Him) morning and evening. (Then why do the disbelievers do idol-worship, turning away from Allah?)","vec_preview":[0.012600000016391277,0.014100000262260437,-0.0272000003606081,-0.0015999999595806003,0.007499999832361937,-0.019700000062584877,0.0044999998062849045,-0.03280000016093254]},{"ayah_id":"13:16","surah":13,"ayah":16,"arabic":"قُلْ مَن رَّبُّ السَّمَاوَاتِ وَالْأَرْضِ قُلِ اللَّهُ ۚ قُلْ أَفَاتَّخَذْتُم مِّن دُونِهِ أَوْلِيَاءَ لَا يَمْلِكُونَ لِأَنفُسِهِمْ نَفْعًا وَلَا ضَرًّا ۚ قُلْ هَلْ يَسْتَوِي الْأَعْمَىٰ وَالْبَصِيرُ أَمْ هَلْ تَسْتَوِي الظُّلُمَاتُ وَالنُّورُ ۗ أَمْ جَعَلُوا لِلَّهِ شُرَكَاءَ خَلَقُوا كَخَلْقِهِ فَتَشَابَهَ الْخَلْقُ عَلَيْهِمْ ۚ قُلِ اللَّهُ خَالِقُ كُلِّ شَيْءٍ وَهُوَ الْوَاحِدُ الْقَهَّارُ","english":"Say(to these disbelievers): ‘Who is the Sustainer of the heavens and the earth?’ Say (yourself): ‘Allah.’ (Again) ask (them): ‘Have you taken besides Allah (these idols) as your protectors who cannot control any profit or loss even for themselves?’ Say: ‘Can the blind and the seeing be equal? Or can darkness and light be the same? Have they associated such partners with Allah that have also created (some creation) themselves similar to that of Allah, so this creation (created by these idols) has caused them doubt of resemblance (i.e., error of judgment that they too could create as Allah does)?’ Say: ‘Allah alone is the Creator of everything. And He is One. He is Dominant over all.’","vec_preview":[0.012199999764561653,0.010499999858438969,-0.026100000366568565,-0.0026000000070780516,0.035599999129772186,-0.03359999880194664,-0.012299999594688416,-0.0333000011742115]},{"ayah_id":"13:17","surah":13,"ayah":17,"arabic":"أَنزَلَ مِنَ السَّمَاءِ مَاءً فَسَالَتْ أَوْدِيَةٌ بِقَدَرِهَا فَاحْتَمَلَ السَّيْلُ زَبَدًا رَّابِيًا ۚ وَمِمَّا يُوقِدُونَ عَلَيْهِ فِي النَّارِ ابْتِغَاءَ حِلْيَةٍ أَوْ مَتَاعٍ زَبَدٌ مِّثْلُهُ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ الْحَقَّ وَالْبَاطِلَ ۚ فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفَاءً ۖ وَأَمَّا مَا يَنفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ","english":"He sends down water from the sky and the valleys flow according to their (respective) capacity. Then the floodwater carries the scum raised to the surface. And the items that are heated in the fire for making ornaments or other articles also have foam that comes up the same way. Thus Allah illustrates examples of the truth and falsehood. So, (whether produced by water or by fire,) the foam or scum passes away useless, but what is beneficial to the people endures in the earth. That is how Allah illustrates examples.","vec_preview":[0.002899999963119626,0.03269999846816063,-0.029600000008940697,-0.00019999999494757503,0.00930000003427267,-0.02710000053048134,-0.021400000900030136,-0.02969999983906746]},{"ayah_id":"13:18","surah":13,"ayah":18,"arabic":"لِلَّذِينَ اسْتَجَابُوا لِرَبِّهِمُ الْحُسْنَىٰ ۚ وَالَّذِينَ لَمْ يَسْتَجِيبُوا لَهُ لَوْ أَنَّ لَهُم مَّا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ ۚ أُولَـٰئِكَ لَهُمْ سُوءُ الْحِسَابِ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمِهَادُ","english":"For those who accept the command of their Lord, there is the excellent outcome. And those who reject His command, even though they possess all that is in the earth, and the like of it added to that, and they offer it as ransom (to be delivered from the torment, even then) they are the ones whose accountability will be horrible. And Hell is their abode, and that is a wretched abode.","vec_preview":[0.0026000000070780516,0.01979999989271164,-0.05079999938607216,-0.01269999984651804,0.003599999938160181,-0.046799998730421066,-0.014100000262260437,-0.03519999980926514]},{"ayah_id":"13:19","surah":13,"ayah":19,"arabic":"۞ أَفَمَن يَعْلَمُ أَنَّمَا أُنزِلَ إِلَيْكَ مِن رَّبِّكَ الْحَقُّ كَمَنْ هُوَ أَعْمَىٰ ۚ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ","english":"Someone who knows that whatever has been revealed to you is the truth, can he be like the one who is blind? Truly it is only those endowed with wisdom who accept admonition,","vec_preview":[-0.015200000256299973,0.02250000089406967,-0.021900000050663948,0.0003000000142492354,0.020800000056624413,-0.04390000179409981,-0.018200000748038292,-0.04479999840259552]},{"ayah_id":"13:20","surah":13,"ayah":20,"arabic":"الَّذِينَ يُوفُونَ بِعَهْدِ اللَّهِ وَلَا يَنقُضُونَ الْمِيثَاقَ","english":"Those who fulfil their pledge to Allah and do not breach their covenant,","vec_preview":[-0.020400000736117363,0.0006000000284984708,-0.029999999329447746,-0.008799999952316284,0.03290000185370445,-0.027899999171495438,-0.0364999994635582,-0.03460000082850456]},{"ayah_id":"13:21","surah":13,"ayah":21,"arabic":"وَالَّذِينَ يَصِلُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوءَ الْحِسَابِ","english":"And who keep unified all (i.e., fulfil all their obligations to Allah, to the Messenger [blessings and peace be upon him], to humanity at large and to their close relatives) that Allah has enjoined to be unified and remain in a state of fear from Allah and dread an evil reckoning;","vec_preview":[-0.0005000000237487257,0.023600000888109207,-0.05090000107884407,0.0203000009059906,0.029500000178813934,-0.040699999779462814,-0.009100000374019146,-0.03680000081658363]},{"ayah_id":"13:22","surah":13,"ayah":22,"arabic":"وَالَّذِينَ صَبَرُوا ابْتِغَاءَ وَجْهِ رَبِّهِمْ وَأَقَامُوا الصَّلَاةَ وَأَنفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ أُولَـٰئِكَ لَهُمْ عُقْبَى الدَّارِ","english":"And who remain steadfast in seeking the pleasure of their Lord, and establish Prayer, and spend (both) secretly and openly out of the sustenance We have provided, and continue eliminating evil by means of good; they are the ones for whom there is a (beautiful) home in the Hereafter.","vec_preview":[0.009200000204145908,0.01810000091791153,-0.04540000110864639,-0.006000000052154064,0.023800000548362732,-0.048700001090765,-0.003599999938160181,-0.03629999980330467]},{"ayah_id":"13:23","surah":13,"ayah":23,"arabic":"جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا وَمَن صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ ۖ وَالْمَلَائِكَةُ يَدْخُلُونَ عَلَيْهِم مِّن كُلِّ بَابٍ","english":"(There) are evergreen gardens. They will enter them with the pious from amongst their ancestors, their wives and their children. And the angels will come to them through every door (of Paradise).","vec_preview":[0.03889999911189079,0.033900000154972076,-0.043299999088048935,0.05480000004172325,0.009200000204145908,-0.023600000888109207,0.0052999998442828655,-0.04769999906420708]},{"ayah_id":"13:24","surah":13,"ayah":24,"arabic":"سَلَامٌ عَلَيْكُم بِمَا صَبَرْتُمْ ۚ فَنِعْمَ عُقْبَى الدَّارِ","english":"(Greeting, they will say:) ‘Peace be upon you as a reward for your patience! So (see now) what a beautiful home the Hereafter is!’","vec_preview":[0.020600000396370888,0.039400000125169754,-0.02759999968111515,-0.000699999975040555,0.023499999195337296,-0.029899999499320984,-0.01269999984651804,-0.03500000014901161]},{"ayah_id":"13:25","surah":13,"ayah":25,"arabic":"وَالَّذِينَ يَنقُضُونَ عَهْدَ اللَّهِ مِن بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ ۙ أُولَـٰئِكَ لَهُمُ اللَّعْنَةُ وَلَهُمْ سُوءُ الدَّارِ","english":"And those who break the promise of Allah after making it firm and sever all (the relations and obligations) that Allah has commanded to be kept unified, and do mischief and strife in the land—upon them is the curse and for them is an evil home;","vec_preview":[-0.013399999588727951,0.024299999698996544,-0.03840000182390213,0.013899999670684338,0.02410000003874302,-0.041099999099969864,-0.011699999682605267,-0.0348999984562397]},{"ayah_id":"13:26","surah":13,"ayah":26,"arabic":"اللَّهُ يَبْسُطُ الرِّزْقَ لِمَن يَشَاءُ وَيَقْدِرُ ۚ وَفَرِحُوا بِالْحَيَاةِ الدُّنْيَا وَمَا الْحَيَاةُ الدُّنْيَا فِي الْآخِرَةِ إِلَّا مَتَاعٌ","english":"Allah releases the provision abundantly for whom He pleases and restrains (for whom He wills). And these (disbelievers) are greatly charmed by the worldly life whereas, in contrast with the life in the Hereafter, the worldly life is nothing but a worthless provision.","vec_preview":[0.006899999920278788,0.01600000075995922,-0.023099999874830246,0.017799999564886093,0.006899999920278788,-0.033900000154972076,-0.018699999898672104,-0.03830000013113022]},{"ayah_id":"13:27","surah":13,"ayah":27,"arabic":"وَيَقُولُ الَّذِينَ كَفَرُوا لَوْلَا أُنزِلَ عَلَيْهِ آيَةٌ مِّن رَّبِّهِ ۗ قُلْ إِنَّ اللَّهَ يُضِلُّ مَن يَشَاءُ وَيَهْدِي إِلَيْهِ مَنْ أَنَابَ","english":"And the disbelievers say: ‘Why has any sign not been sent down to him (the Messenger) from his Lord?’ Say: ‘Verily, Allah (despite the signs) holds astray whom He wills, and leads him who turns to Him in repentance towards Himself.","vec_preview":[-0.004600000102072954,0.014499999582767487,-0.020899999886751175,0.01860000006854534,0.03739999979734421,-0.03799999877810478,-0.03909999877214432,-0.03189999982714653]},{"ayah_id":"13:28","surah":13,"ayah":28,"arabic":"الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ","english":"Those who believe and their hearts become calm and contented with the remembrance of Allah—know that it is the remembrance of Allah alone that brings calm to the hearts.","vec_preview":[-0.00019999999494757503,0.01269999984651804,-0.01759999990463257,-0.009499999694526196,0.035100001841783524,-0.019899999722838402,-0.03449999913573265,-0.04699999839067459]},{"ayah_id":"13:29","surah":13,"ayah":29,"arabic":"الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ طُوبَىٰ لَهُمْ وَحُسْنُ مَآبٍ","english":"Those who believe and do pious works, for them there are pleasures and rejoicing and an excellent abode (in the Hereafter).’","vec_preview":[0.026100000366568565,0.01640000008046627,-0.047200001776218414,-0.00430000014603138,0.04650000110268593,-0.014700000174343586,-0.03220000118017197,-0.031300000846385956]},{"ayah_id":"13:30","surah":13,"ayah":30,"arabic":"كَذَٰلِكَ أَرْسَلْنَاكَ فِي أُمَّةٍ قَدْ خَلَتْ مِن قَبْلِهَا أُمَمٌ لِّتَتْلُوَ عَلَيْهِمُ الَّذِي أَوْحَيْنَا إِلَيْكَ وَهُمْ يَكْفُرُونَ بِالرَّحْمَـٰنِ ۚ قُلْ هُوَ رَبِّي لَا إِلَـٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ مَتَابِ","english":"(O Beloved!) Thus We have sent you (as a Messenger) to an Umma (Community) before whom in fact (all) the communities have passed. (This is now the last of all the communities) so that you may recite to them that (Book) which We have revealed to you. And they are still denying al-Rahman (the Most Kind Lord). Say: ‘He is my Lord. There is no God but He. In Him have I put my trust and I turn towards Him alone.’","vec_preview":[0.010599999688565731,0.008299999870359898,-0.03280000016093254,9.999999747378752e-05,0.020500000566244125,-0.04500000178813934,-0.01209999993443489,-0.04619999974966049]},{"ayah_id":"13:31","surah":13,"ayah":31,"arabic":"وَلَوْ أَنَّ قُرْآنًا سُيِّرَتْ بِهِ الْجِبَالُ أَوْ قُطِّعَتْ بِهِ الْأَرْضُ أَوْ كُلِّمَ بِهِ الْمَوْتَىٰ ۗ بَل لِّلَّهِ الْأَمْرُ جَمِيعًا ۗ أَفَلَمْ يَيْأَسِ الَّذِينَ آمَنُوا أَن لَّوْ يَشَاءُ اللَّهُ لَهَدَى النَّاسَ جَمِيعًا ۗ وَلَا يَزَالُ الَّذِينَ كَفَرُوا تُصِيبُهُم بِمَا صَنَعُوا قَارِعَةٌ أَوْ تَحُلُّ قَرِيبًا مِّن دَارِهِمْ حَتَّىٰ يَأْتِيَ وَعْدُ اللَّهِ ۚ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ","english":"And if there were a Qur’an by which mountains could be set in motion, or by which the earth could be split open, or by which the dead could be spoken to (even then they would not believe in it). But all matters are under the control of Allah. Have the believers not yet perceived that if Allah had so willed, He would have guided all mankind? And (some) disaster will continue afflicting the disbelievers due to their misdeeds, or will be alighting close to their homes (i.e., towns) until Allah’s promise (of torment) comes to pass. Surely, Allah does not go against His promise.","vec_preview":[-0.002400000113993883,0.011599999852478504,-0.03530000150203705,0.008100000210106373,0.01850000023841858,-0.03720000013709068,-0.028200000524520874,-0.030400000512599945]},{"ayah_id":"13:32","surah":13,"ayah":32,"arabic":"وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّن قَبْلِكَ فَأَمْلَيْتُ لِلَّذِينَ كَفَرُوا ثُمَّ أَخَذْتُهُمْ ۖ فَكَيْفَ كَانَ عِقَابِ","english":"And indeed the Messengers were mocked (by the disbelievers) before you (as well). So I granted the disbelievers respite and then seized them (with torment). (See) then how My torment was!","vec_preview":[0.009200000204145908,0.01979999989271164,-0.022600000724196434,0.009600000455975533,0.009100000374019146,-0.06610000133514404,-0.018300000578165054,-0.04540000110864639]},{"ayah_id":"13:33","surah":13,"ayah":33,"arabic":"أَفَمَنْ هُوَ قَائِمٌ عَلَىٰ كُلِّ نَفْسٍ بِمَا كَسَبَتْ ۗ وَجَعَلُوا لِلَّهِ شُرَكَاءَ قُلْ سَمُّوهُمْ ۚ أَمْ تُنَبِّئُونَهُ بِمَا لَا يَعْلَمُ فِي الْأَرْضِ أَم بِظَاهِرٍ مِّنَ الْقَوْلِ ۗ بَلْ زُيِّنَ لِلَّذِينَ كَفَرُوا مَكْرُهُمْ وَصُدُّوا عَنِ السَّبِيلِ ۗ وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ","english":"He (Allah) Who is watching the conduct of every soul and (these idols that the disbelievers) have made peers to Allah—(can they be alike? No way!) Say: ‘(Just) name them. (You fools!) Do you inform Him (Allah) of something whose (existence) He does not know in the whole earth? Or is it all (mere) superficial talk (which has no contact with reality)?’ Rather (the truth is that) the deceptive scheme of the disbelievers has been made fascinating to them, and they have been hindered from the (straight) path. And he whom Allah holds strayed, there is none who can be his guide.","vec_preview":[0.012299999594688416,0.030799999833106995,-0.040800001472234726,0.010900000110268593,0.020099999383091927,-0.05389999970793724,-0.02160000056028366,-0.02250000089406967]},{"ayah_id":"13:34","surah":13,"ayah":34,"arabic":"لَّهُمْ عَذَابٌ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَشَقُّ ۖ وَمَا لَهُم مِّنَ اللَّهِ مِن وَاقٍ","english":"There is for them a chastisement in the worldly life (as well), but certainly the torment in the Hereafter is fiercer. And there is none who can rescue them from (the punishment of) Allah.","vec_preview":[0.002300000051036477,0.012400000356137753,-0.02290000021457672,0.009999999776482582,0.025499999523162842,-0.033799998462200165,-0.005400000140070915,-0.035999998450279236]},{"ayah_id":"13:35","surah":13,"ayah":35,"arabic":"۞ مَّثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ ۖ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۖ أُكُلُهَا دَائِمٌ وَظِلُّهَا ۚ تِلْكَ عُقْبَى الَّذِينَ اتَّقَوا ۖ وَّعُقْبَى الْكَافِرِينَ النَّارُ","english":"A glimpse of the Paradise that has been promised to the Godfearing (depicts that) it has rivers flowing under it; its fruits are everlasting, and so is its shade. This is (the beauty of) the end of those who adopt Godwariness. And the end of the disbelievers is the Fire of Hell.","vec_preview":[-0.00019999999494757503,0.021800000220537186,-0.03189999982714653,-0.009700000286102295,0.02290000021457672,-0.04859999939799309,-0.017899999395012856,-0.056699998676776886]},{"ayah_id":"13:36","surah":13,"ayah":36,"arabic":"وَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَفْرَحُونَ بِمَا أُنزِلَ إِلَيْكَ ۖ وَمِنَ الْأَحْزَابِ مَن يُنكِرُ بَعْضَهُ ۚ قُلْ إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ وَلَا أُشْرِكَ بِهِ ۚ إِلَيْهِ أَدْعُو وَإِلَيْهِ مَآبِ","english":"And those whom We have given the Book (the Torah, if they are true believers, then) they rejoice at this (Qur’an) which has been revealed to you. And also some from amongst their sects are those who deny a part of it. Say: ‘I have been given the command to worship Allah and not to associate (any) partner with Him. I invite towards Him alone, and to Him I shall return.’","vec_preview":[0.01360000018030405,0.0013000000035390258,-0.037700001150369644,-0.0203000009059906,0.030300000682473183,-0.027400000020861626,-0.02319999970495701,-0.05550000071525574]},{"ayah_id":"13:37","surah":13,"ayah":37,"arabic":"وَكَذَٰلِكَ أَنزَلْنَاهُ حُكْمًا عَرَبِيًّا ۚ وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُم بَعْدَ مَا جَاءَكَ مِنَ الْعِلْمِ مَا لَكَ مِنَ اللَّهِ مِن وَلِيٍّ وَلَا وَاقٍ","english":"And in like manner, We have revealed this (Qur’an) as a commandment in the Arabic language. And, (O listener,) if you follow the desires of these (disbelievers) after the (conclusive) knowledge has reached you, then there is no helper or protector for you against Allah.","vec_preview":[-0.007000000216066837,0.008999999612569809,-0.030899999663233757,-0.014299999922513962,0.01209999993443489,-0.04470000043511391,-0.017500000074505806,-0.035599999129772186]},{"ayah_id":"13:38","surah":13,"ayah":38,"arabic":"وَلَقَدْ أَرْسَلْنَا رُسُلًا مِّن قَبْلِكَ وَجَعَلْنَا لَهُمْ أَزْوَاجًا وَذُرِّيَّةً ۚ وَمَا كَانَ لِرَسُولٍ أَن يَأْتِيَ بِآيَةٍ إِلَّا بِإِذْنِ اللَّهِ ۗ لِكُلِّ أَجَلٍ كِتَابٌ","english":"And, (O Messenger,) indeed We sent before you (many) Messengers and brought up for them wives and children (as well). And that is not the role of a Messenger to bring a sign but by Allah’s command. There is an inscription for every appointed term.","vec_preview":[0.02449999935925007,0.0017999999690800905,-0.025599999353289604,0.0027000000700354576,0.015399999916553497,-0.040800001472234726,-0.006500000134110451,-0.0471000000834465]},{"ayah_id":"13:39","surah":13,"ayah":39,"arabic":"يَمْحُو اللَّهُ مَا يَشَاءُ وَيُثْبِتُ ۖ وَعِندَهُ أُمُّ الْكِتَابِ","english":"Allah erases whatever (writing) He wills and confirms (whatever He wills). And with Him alone is the Real Book (the Protected Tablet [al-Lawh al-Mahfuz]).","vec_preview":[0.008799999952316284,-0.002099999925121665,-0.010499999858438969,0.010999999940395355,0.012199999764561653,-0.00559999980032444,-0.0210999995470047,-0.03709999844431877]},{"ayah_id":"13:40","surah":13,"ayah":40,"arabic":"وَإِن مَّا نُرِيَنَّكَ بَعْضَ الَّذِي نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيْكَ الْبَلَاغُ وَعَلَيْنَا الْحِسَابُ","english":"And whether We show you (during your visible life) a portion (of the torment) that We have promised these (disbelievers), or We lift you (before that-both these options are subject to Our Will). Your assignment is only to communicate (the commandments) and accountability rests with Us.","vec_preview":[0.004699999932199717,0.024299999698996544,-0.031199999153614044,0.010300000198185444,0.02590000070631504,-0.03869999945163727,-0.014299999922513962,-0.04910000041127205]},{"ayah_id":"13:41","surah":13,"ayah":41,"arabic":"أَوَلَمْ يَرَوْا أَنَّا نَأْتِي الْأَرْضَ نَنقُصُهَا مِنْ أَطْرَافِهَا ۚ وَاللَّهُ يَحْكُمُ لَا مُعَقِّبَ لِحُكْمِهِ ۚ وَهُوَ سَرِيعُ الْحِسَابِ","english":"Do they not see that We are persistently reducing the land (under their control—most of the areas under their rule are gradually accepting the Islamic Rule)? And Allah is the One Who decrees; there is none who can undo His decree. And He is Swift in calling to account.","vec_preview":[-0.003800000064074993,0.0,-0.0340999998152256,0.002899999963119626,-0.008100000210106373,-0.045899998396635056,-0.020500000566244125,-0.03680000081658363]},{"ayah_id":"13:42","surah":13,"ayah":42,"arabic":"وَقَدْ مَكَرَ الَّذِينَ مِن قَبْلِهِمْ فَلِلَّهِ الْمَكْرُ جَمِيعًا ۖ يَعْلَمُ مَا تَكْسِبُ كُلُّ نَفْسٍ ۗ وَسَيَعْلَمُ الْكُفَّارُ لِمَنْ عُقْبَى الدَّارِ","english":"And no doubt, those who have passed before them also indulged in deceitful plots. So the power to reverse all these plots (also) rests with Allah. He knows best what every soul is busy earning, and the disbelievers will soon come to know for whom is the home of the Hereafter!","vec_preview":[0.010099999606609344,0.013899999670684338,-0.030700000002980232,0.027300000190734863,0.016200000420212746,-0.04839999973773956,-0.03009999915957451,-0.040699999779462814]},{"ayah_id":"13:43","surah":13,"ayah":43,"arabic":"وَيَقُولُ الَّذِينَ كَفَرُوا لَسْتَ مُرْسَلًا ۚ قُلْ كَفَىٰ بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ وَمَنْ عِندَهُ عِلْمُ الْكِتَابِ","english":"And the disbelievers say: ‘You are not a Messenger.’ Say: ‘Sufficient is Allah as a Witness between you and me (on my Messengership), as well as the one who possesses the knowledge of the (revealed) Book.’","vec_preview":[0.013899999670684338,0.008200000040233135,-0.026799999177455902,-0.005200000014156103,0.04320000112056732,-0.02759999968111515,-0.030899999663233757,-0.041200000792741776]}]