[{"ayah_id":"49:1","surah":49,"ayah":1,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُقَدِّمُوا بَيْنَ يَدَيِ اللَّهِ وَرَسُولِهِ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ","english":"O believers! Do not step ahead of Allah and His Messenger ([blessings and peace be upon him] in any matter) and keep fearing Allah (lest some discourtesy should occur displeasing the Messenger [blessings and peace be upon him]). Surely, Allah is All-Hearing, All-Knowing.","vec_preview":[0.01119999960064888,0.00860000029206276,-0.03790000081062317,-0.014100000262260437,0.047600001096725464,-0.045899998396635056,-0.027300000190734863,-0.04749999940395355]},{"ayah_id":"49:2","surah":49,"ayah":2,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْهَرُوا لَهُ بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ أَن تَحْبَطَ أَعْمَالُكُمْ وَأَنتُمْ لَا تَشْعُرُونَ","english":"O believers! Do not raise your voices above the voice of the Prophet (blessings and peace be upon him), and (also) do not speak to him so loud as you are loud when you speak to one another (lest) all your actions should come to nothing (including your faith), and you are not even aware (that your faith and all pious works have been wrecked).","vec_preview":[0.004000000189989805,0.00279999990016222,-0.04259999841451645,-0.01979999989271164,0.04270000010728836,-0.04479999840259552,-0.03200000151991844,-0.05040000006556511]},{"ayah_id":"49:3","surah":49,"ayah":3,"arabic":"إِنَّ الَّذِينَ يَغُضُّونَ أَصْوَاتَهُمْ عِندَ رَسُولِ اللَّهِ أُولَـٰئِكَ الَّذِينَ امْتَحَنَ اللَّهُ قُلُوبَهُمْ لِلتَّقْوَىٰ ۚ لَهُم مَّغْفِرَةٌ وَأَجْرٌ عَظِيمٌ","english":"Assuredly, those who keep their voices low in the presence of Allah’s Messenger (out of profound veneration and submissiveness), it is they whose hearts Allah has chosen for Godwariness and permeated with sincerity. For them alone is forgiveness and an immense reward.","vec_preview":[0.009200000204145908,0.0142000000923872,-0.03229999914765358,0.010999999940395355,0.028300000354647636,-0.03280000016093254,-0.01730000041425228,-0.03220000118017197]},{"ayah_id":"49:4","surah":49,"ayah":4,"arabic":"إِنَّ الَّذِينَ يُنَادُونَكَ مِن وَرَاءِ الْحُجُرَاتِ أَكْثَرُهُمْ لَا يَعْقِلُونَ","english":"Verily, those who call out to you from outside your apartments, most of them do not have the understanding (of your exalted station and incomparable status and polite manners of veneration that are due to you).","vec_preview":[0.0015999999595806003,0.013000000268220901,-0.016499999910593033,-0.017000000923871994,0.04769999906420708,-0.052799999713897705,-0.03519999980926514,-0.061400000005960464]},{"ayah_id":"49:5","surah":49,"ayah":5,"arabic":"وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّىٰ تَخْرُجَ إِلَيْهِمْ لَكَانَ خَيْرًا لَّهُمْ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ","english":"And if they had only been patient till you had come out to them, it would have been better for them. And Allah is Most Forgiving, Ever-Merciful.","vec_preview":[-0.014700000174343586,0.02319999970495701,-0.026900000870227814,0.019300000742077827,0.02889999933540821,-0.05510000139474869,-0.014800000004470348,-0.034299999475479126]},{"ayah_id":"49:6","surah":49,"ayah":6,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِن جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا أَن تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَىٰ مَا فَعَلْتُمْ نَادِمِينَ","english":"O believers! If some wicked person brings you any news, inquire thoroughly into its truth (lest) you should cause (undue) harm to a people unknowingly, and later feel regret for what you have done.","vec_preview":[0.02019999921321869,0.025299999862909317,-0.048700001090765,-0.006399999838322401,0.054099999368190765,-0.03539999946951866,-0.014800000004470348,-0.0430000014603138]},{"ayah_id":"49:7","surah":49,"ayah":7,"arabic":"وَاعْلَمُوا أَنَّ فِيكُمْ رَسُولَ اللَّهِ ۚ لَوْ يُطِيعُكُمْ فِي كَثِيرٍ مِّنَ الْأَمْرِ لَعَنِتُّمْ وَلَـٰكِنَّ اللَّهَ حَبَّبَ إِلَيْكُمُ الْإِيمَانَ وَزَيَّنَهُ فِي قُلُوبِكُمْ وَكَرَّهَ إِلَيْكُمُ الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ ۚ أُولَـٰئِكَ هُمُ الرَّاشِدُونَ","english":"And remember that the Messenger of Allah (blessings and peace be upon him) is amongst you. If he accepted what you say in most of the matters, you would be in serious trouble. But Allah has blessed you with the love of faith and has embelished it in your hearts and has made you hate disbelief, disobedience and sins. Such are they that follow the path of Din (Religion) resolutely and steadfastly.","vec_preview":[0.013000000268220901,0.015699999406933784,-0.022600000724196434,0.002300000051036477,0.026200000196695328,-0.048700001090765,-0.017400000244379044,-0.044199999421834946]},{"ayah_id":"49:8","surah":49,"ayah":8,"arabic":"فَضْلًا مِّنَ اللَّهِ وَنِعْمَةً ۚ وَاللَّهُ عَلِيمٌ حَكِيمٌ","english":"(It) is due to Allah’s bounty and favour (i.e., the raising of the untaught Messenger and his presence amongst you). And Allah is All-Knowing, Most Wise.","vec_preview":[0.0006000000284984708,0.014499999582767487,-0.025699999183416367,0.014000000432133675,0.029999999329447746,-0.02810000069439411,-0.025699999183416367,-0.03200000151991844]},{"ayah_id":"49:9","surah":49,"ayah":9,"arabic":"وَإِن طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا ۖ فَإِن بَغَتْ إِحْدَاهُمَا عَلَى الْأُخْرَىٰ فَقَاتِلُوا الَّتِي تَبْغِي حَتَّىٰ تَفِيءَ إِلَىٰ أَمْرِ اللَّهِ ۚ فَإِن فَاءَتْ فَأَصْلِحُوا بَيْنَهُمَا بِالْعَدْلِ وَأَقْسِطُوا ۖ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ","english":"And if two parties of the Muslims fight, make them reconcile. Then if either of these (parties) commits injustice and aggression against the other, fight against (the party) that is committing aggression till it returns to Allah’s command (of establishing peace). When they revert and submit, make peace between them with equity. And put justice to work. Surely, Allah loves those who do justice.","vec_preview":[-0.007899999618530273,0.03539999946951866,-0.041099999099969864,-0.002400000113993883,0.03400000184774399,-0.05139999836683273,-0.026900000870227814,-0.042500000447034836]},{"ayah_id":"49:10","surah":49,"ayah":10,"arabic":"إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ ۚ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ","english":"The truth is that (all) believers are brothers (to one another). So make peace between your two brothers and always fear Allah, so that you may be shown mercy.","vec_preview":[0.019700000062584877,0.0215000007301569,-0.03189999982714653,-0.00930000003427267,0.021400000900030136,-0.04830000177025795,-0.031099999323487282,-0.04780000075697899]},{"ayah_id":"49:11","surah":49,"ayah":11,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَسْخَرْ قَوْمٌ مِّن قَوْمٍ عَسَىٰ أَن يَكُونُوا خَيْرًا مِّنْهُمْ وَلَا نِسَاءٌ مِّن نِّسَاءٍ عَسَىٰ أَن يَكُنَّ خَيْرًا مِّنْهُنَّ ۖ وَلَا تَلْمِزُوا أَنفُسَكُمْ وَلَا تَنَابَزُوا بِالْأَلْقَابِ ۖ بِئْسَ الِاسْمُ الْفُسُوقُ بَعْدَ الْإِيمَانِ ۚ وَمَن لَّمْ يَتُبْ فَأُولَـٰئِكَ هُمُ الظَّالِمُونَ","english":"O believers! Let no community ridicule another community. It is likely that they may be better than those (who ridicule). Nor should women make fun of other women. It is likely that they may be better than those (who make fun). And do not offend or find fault with one another, nor call each other names. Calling someone wicked or indecent after (he embraces) faith is an extremely evil name. And those who do not turn to Allah in repentance, it is they who are the wrongdoers.","vec_preview":[0.01080000028014183,0.010400000028312206,-0.04809999838471413,-0.01140000019222498,0.048700001090765,-0.03869999945163727,-0.03759999945759773,-0.0414000004529953]},{"ayah_id":"49:12","surah":49,"ayah":12,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِّنَ الظَّنِّ إِنَّ بَعْضَ الظَّنِّ إِثْمٌ ۖ وَلَا تَجَسَّسُوا وَلَا يَغْتَب بَّعْضُكُم بَعْضًا ۚ أَيُحِبُّ أَحَدُكُمْ أَن يَأْكُلَ لَحْمَ أَخِيهِ مَيْتًا فَكَرِهْتُمُوهُ ۚ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ تَوَّابٌ رَّحِيمٌ","english":"O believers! Avoid most conjectures. Indeed, some conjectures are sins (liable to punishment in the Hereafter). And spy not (on someone’s unknown matters or secrets), nor backbite one another. Would any of you like to eat the flesh of his dead brother? You would hate it. And fear Allah (in all such matters). Indeed, Allah is Ever-Returning, Ever-Merciful.","vec_preview":[0.01489999983459711,0.023600000888109207,-0.04019999876618385,0.002400000113993883,0.04820000007748604,-0.040699999779462814,-0.04050000011920929,-0.056699998676776886]},{"ayah_id":"49:13","surah":49,"ayah":13,"arabic":"يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُم مِّن ذَكَرٍ وَأُنثَىٰ وَجَعَلْنَاكُمْ شُعُوبًا وَقَبَائِلَ لِتَعَارَفُوا ۚ إِنَّ أَكْرَمَكُمْ عِندَ اللَّهِ أَتْقَاكُمْ ۚ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ","english":"O people! We created you from a male and a female, and (divided) you into (large) peoples and tribes, so that you might recognize one another. Surely, the most honourable amongst you in the sight of Allah is he who fears Allah the most. Certainly, Allah is All-Knowing, All-Aware.","vec_preview":[0.01269999984651804,0.014499999582767487,-0.029500000178813934,-0.010200000368058681,0.036400001496076584,-0.027000000700354576,-0.025299999862909317,-0.04490000009536743]},{"ayah_id":"49:14","surah":49,"ayah":14,"arabic":"۞ قَالَتِ الْأَعْرَابُ آمَنَّا ۖ قُل لَّمْ تُؤْمِنُوا وَلَـٰكِن قُولُوا أَسْلَمْنَا وَلَمَّا يَدْخُلِ الْإِيمَانُ فِي قُلُوبِكُمْ ۖ وَإِن تُطِيعُوا اللَّهَ وَرَسُولَهُ لَا يَلِتْكُم مِّنْ أَعْمَالِكُمْ شَيْئًا ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ","english":"The Bedouins say: ‘We have believed.’ Say: ‘You have not believed. Rather say: We have accepted Islam. And the belief has not yet gone into your hearts. If you obey Allah and His Messenger (blessings and peace be upon him), He will not decrease anything (in reward) for your deeds. Surely, Allah is Most Forgiving, Ever-Merciful.’","vec_preview":[0.015799999237060547,0.01810000091791153,-0.028699999675154686,-0.014499999582767487,0.04569999873638153,-0.030400000512599945,-0.021400000900030136,-0.04270000010728836]},{"ayah_id":"49:15","surah":49,"ayah":15,"arabic":"إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ ثُمَّ لَمْ يَرْتَابُوا وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنفُسِهِمْ فِي سَبِيلِ اللَّهِ ۚ أُولَـٰئِكَ هُمُ الصَّادِقُونَ","english":"The true believers are only those who have believed in Allah and His Messenger (blessings and peace be upon him) and then never have any doubt, and who fight in the way of Allah with their material as well as human resources. It is they who are true (in their claim to believe).","vec_preview":[0.007499999832361937,9.999999747378752e-05,-0.03909999877214432,-0.021400000900030136,0.0215000007301569,-0.04179999977350235,-0.024700000882148743,-0.04399999976158142]},{"ayah_id":"49:16","surah":49,"ayah":16,"arabic":"قُلْ أَتُعَلِّمُونَ اللَّهَ بِدِينِكُمْ وَاللَّهُ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ","english":"Say: ‘Are you trying to show off to Allah your Din (Religion) whilst Allah knows all that is in the heavens and in the earth? And Allah is Well Aware of everything.’","vec_preview":[-0.003599999938160181,0.019200000911951065,-0.02539999969303608,0.00570000009611249,0.02539999969303608,-0.03290000185370445,-0.0038999998942017555,-0.03460000082850456]},{"ayah_id":"49:17","surah":49,"ayah":17,"arabic":"يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا ۖ قُل لَّا تَمُنُّوا عَلَيَّ إِسْلَامَكُم ۖ بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ أَنْ هَدَاكُمْ لِلْإِيمَانِ إِن كُنتُمْ صَادِقِينَ","english":"These people are showing off to you that they have done a favour to you by embracing Islam. Say: ‘Do not show off your Islam as a favour to me. Instead, Allah is the One Who favours you by guiding you to faith, provided you are true (to belief).’","vec_preview":[0.00570000009611249,0.026900000870227814,-0.03500000014901161,-0.005499999970197678,0.03220000118017197,-0.037300001829862595,-0.02759999968111515,-0.046799998730421066]},{"ayah_id":"49:18","surah":49,"ayah":18,"arabic":"إِنَّ اللَّهَ يَعْلَمُ غَيْبَ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَاللَّهُ بَصِيرٌ بِمَا تَعْمَلُونَ","english":"Surely, Allah knows all the unseen of the heavens and the earth, and Allah monitors best whatever you do.","vec_preview":[-0.007899999618530273,0.0008999999845400453,-0.021199999377131462,0.013399999588727951,0.008799999952316284,-0.03220000118017197,-0.0038999998942017555,-0.03420000150799751]}]